{
  "source": "GIKI Website",
  "data": [
    {
      "section": "Academics",
      "title": "Academic Overview",
      "content": "GIKI offers a comprehensive range of undergraduate and graduate programs across various engineering and science disciplines, focusing on innovation, critical thinking, and research.",
      "url": "https://giki.edu.pk/academics/"
    },
    {
      "section": "Faculties",
      "title": "Faculty of Engineering Sciences",
      "content": "The Faculty of Engineering Sciences blends Mathematics, Physics, Computing, and Engineering in its programs. It prepares students for real-world problem-solving and technological innovation.",
      "url": "https://giki.edu.pk/FES/"
    },
    {
      "section": "Faculties",
      "title": "Faculty of Computer Science and Engineering",
      "content": "Programs offered include Computer Science, Computer Engineering, Artificial Intelligence, and Cyber Security. The faculty aims to produce graduates with a solid foundation in computing and technical expertise.",
      "url": "https://giki.edu.pk/FCSE/"
    },
    {
      "section": "Faculties",
      "title": "Faculty of Mechanical Engineering",
      "content": "This faculty provides in-depth education in mechanical design, thermodynamics, fluid mechanics, and manufacturing, fostering students' ability to innovate and apply their knowledge effectively.",
      "url": "https://giki.edu.pk/FME/"
    },
    {
      "section": "Faculties",
      "title": "Faculty of Materials and Chemical Engineering",
      "content": "Programs here cover the development and application of advanced materials and chemical processes, emphasizing sustainable solutions and industry applications.",
      "url": "https://giki.edu.pk/FMCE/"
    },
    {
      "section": "Faculties",
      "title": "Faculty of Civil Engineering",
      "content": "The BS Civil Engineering program focuses on structural engineering, construction technology, materials science, and sustainable infrastructure development.",
      "url": "https://giki.edu.pk/FCE/"
    },
    {
      "section": "Faculties",
      "title": "Faculty of Management Sciences and Humanities",
      "content": "The faculty offers a BS in Management Sciences program that combines management theories with technical skills to equip students for leadership roles in various industries.",
      "url": "https://giki.edu.pk/FMSH/"
    },
    {
      "section": "Academic Resources",
      "title": "Library",
      "content": "The library supports academic and research activities with a comprehensive collection of books, scholarly journals, e-books, and digital resources for students and faculty.",
      "url": "https://giki.edu.pk/library/"
    },
    {
      "section": "Research Initiatives",
      "title": "Research and Development",
      "content": "GIKI promotes active research initiatives across faculties, collaborating with industry and international universities to advance technological knowledge and innovation.",
      "url": "https://giki.edu.pk/research/"
    },
    {
      "section": "Laboratories",
      "title": "State-of-the-Art Labs",
      "content": "GIKI is equipped with modern laboratories that provide hands-on experience to students in various engineering disciplines, enhancing practical knowledge and skill development.",
      "url": "https://giki.edu.pk/labs/"
    },
    {
      "section": "Academic Support",
      "title": "Student Support Services",
      "content": "GIKI offers robust student support services, including academic advising, career counseling, and mentoring programs to assist students throughout their academic journey.",
      "url": "https://giki.edu.pk/academics/student-support/"
    },
    {
      "section": "Academic Policies",
      "title": "Academic Calendar",
      "content": "The academic year includes two regular semesters and an optional summer session. The detailed academic calendar outlines key dates for the academic community.",
      "url": "https://giki.edu.pk/academics/academic-calendar/"
    },
    {
      "section": "Academic Policies",
      "title": "Grading and Examination Policies",
      "content": "GIKI maintains strict academic standards with clearly defined grading and examination policies to ensure academic integrity and fairness in student evaluations.",
      "url": "https://giki.edu.pk/academics/grading-policy/"
    },
    {
      "section": "Graduate Programs",
      "title": "MS and PhD Programs",
      "content": "Graduate programs are offered in various engineering and science disciplines, focusing on research, development, and contributing to cutting-edge advancements.",
      "url": "https://giki.edu.pk/graduate-programs/"
    },
    {
      "section": "Collaborations",
      "title": "International Partnerships",
      "content": "GIKI has formed collaborations with international universities and research centers to provide exchange opportunities and joint research projects, enhancing the global exposure of its students.",
      "url": "https://giki.edu.pk/collaborations/"
    },
 {
      "section": "Academic Calendar",
      "title": "Semester Structure",
      "content": "The academic year at GIKI comprises two regular semesters of sixteen weeks each, and an eight-week summer school. The duration of two regular semesters and summer school is as follows: Fall: August to December; Spring: January to May; Summer: June to July. The last week of a semester is allocated to final examinations.",
      "url": "https://giki.edu.pk/academics/academic-setup/"
    },
    {
      "section": "Credit Hours",
      "title": "Credit Hour Definition",
      "content": "A credit hour is defined as one lecture of 50 minutes per week over a 16-week semester. For laboratory courses, three lab hours constitute one credit hour.",
      "url": "https://giki.edu.pk/academics/academic-setup/"
    },
    {
      "section": "Course Load",
      "title": "Semester Course Load",
      "content": "The normal course load for undergraduate students is 15-18 credit hours per semester. Students may take additional credits with prior approval from the academic advisor.",
      "url": "https://giki.edu.pk/academics/academic-setup/"
    },
    {
      "section": "Grading System",
      "title": "Grading Scale",
      "content": "GIKI follows a letter grading system with corresponding grade points: A (4.0), A- (3.7), B+ (3.3), B (3.0), B- (2.7), C+ (2.3), C (2.0), C- (1.7), D+ (1.3), D (1.0), F (0.0).",
      "url": "https://giki.edu.pk/academics/academic-setup/"
    },
    {
      "section": "Attendance Policy",
      "title": "Class Attendance Requirements",
      "content": "Students are required to maintain a minimum of 75% attendance in each course to be eligible for final examinations.",
      "url": "https://giki.edu.pk/academics/academic-setup/"
    },
    {
      "section": "Examinations",
      "title": "Assessment Methods",
      "content": "Assessment includes quizzes, assignments, mid-term exams, and final exams. The weightage of each component varies by course and is communicated at the beginning of the semester.",
      "url": "https://giki.edu.pk/academics/academic-setup/"
    },
    {
      "section": "Academic Standing",
      "title": "GPA Requirements",
      "content": "Students must maintain a minimum cumulative GPA of 2.0 to remain in good academic standing. Falling below this may result in academic probation.",
      "url": "https://giki.edu.pk/academics/academic-setup/"
    },
    {
      "section": "Degree Requirements",
      "title": "Graduation Criteria",
      "content": "To graduate, students must complete the prescribed credit hours, maintain the required GPA, and fulfill all departmental requirements.",
      "url": "https://giki.edu.pk/academics/academic-setup/"
    },
    {
      "section": "Academic Calendar",
      "title": "Overview",
      "content": "The academic year at GIKI comprises two regular semesters of sixteen weeks each and an eight-week summer school. The schedule is as follows: Fall Semester: August to December; Spring Semester: January to May; Summer School: June to July. The last week of each semester is allocated for final examinations.",
      "url": "https://giki.edu.pk/academics/academic-calendar/"
    },
    {
      "section": "Fall Semester 2024",
      "title": "Key Dates",
      "content": "Fresh-person Orientation: September 1, 2024; Classes Begin: September 2, 2024; Midterm Examinations: October 28 - November 1, 2024; Mid-Semester Break: November 4 - November 8, 2024; Classes Resume: November 11, 2024; Final Examinations: December 30, 2024 - January 5, 2025; End of Semester Break: January 6 - January 17, 2025.",
      "url": "https://giki.edu.pk/wp-content/uploads/2024/07/Academic-Calendar-2024-2025.pdf"
    },
    {
      "section": "Spring Semester 2025",
      "title": "Key Dates",
      "content": "Classes Begin: January 20, 2025; Midterm Examinations: March 24 - March 28, 2025; Eid-ul-Fitr + Mid-Semester Break: March 29 - April 6, 2025; Classes Resume: April 7, 2025; Final Examinations: May 19 - May 26, 2025; Eid-ul-Adha + Semester End Break: May 27 - June 13, 2025.",
      "url": "https://giki.edu.pk/wp-content/uploads/2024/07/Academic-Calendar-2024-2025.pdf"
    },
    {
      "section": "Summer School 2025",
      "title": "Key Dates",
      "content": "Classes Begin: June 16, 2025; Final Examinations: August 11 - August 16, 2025; End of Summer Break: August 18 - August 30, 2025.",
      "url": "https://giki.edu.pk/wp-content/uploads/2024/07/Academic-Calendar-2024-2025.pdf"
    },
    {
      "section": "Fall Semester 2025",
      "title": "Key Dates",
      "content": "Orientation of Freshmen: August 31, 2025; Classes Begin: September 1, 2025.",
      "url": "https://giki.edu.pk/wp-content/uploads/2024/07/Academic-Calendar-2024-2025.pdf"
    },
    {
      "section": "Holidays and Observances",
      "title": "Important Dates",
      "content": "Eid Milad Un Nabi (Rabi ul Awal 12, 1446 A.H.): No classes or examinations if it falls on a weekday; Quaid-e-Azam Day: December 25, 2024 (Wednesday); Pakistan Day: March 23, 2025 (Sunday); Eid-ul-Fitr (Shawwal 01, 1446 A.H.): Expected on March 31, 2025 (Monday); Eid-ul-Adha (Dhul Hijjah 10, 1446 A.H.): Expected on June 7, 2025 (Saturday); Ashura Muharram (Muharram 10, 1447 A.H.): Expected on July 6, 2025 (Sunday); Independence Day: August 14, 2025 (Wednesday).",
      "url": "https://giki.edu.pk/wp-content/uploads/2024/07/Academic-Calendar-2024-2025.pdf"
    },
    {
      "section": "Convocation",
      "title": "Graduation Ceremony",
      "content": "Convocation 2025 is tentatively scheduled for June 24, 2025 (Tuesday).",
      "url": "https://giki.edu.pk/wp-content/uploads/2024/07/Academic-Calendar-2024-2025.pdf"
    },
    {
      "section": "Industrial Open House",
      "title": "Career Fair",
      "content": "The Industrial Open House & Careers’ Fair is tentatively scheduled for April 23-25, 2024.",
      "url": "https://giki.edu.pk/wp-content/uploads/2023/08/Academic-Calendar-2023-2024.pdf"
    },
 {
      "section": "Library Overview",
      "title": "Central Library",
      "content": "The Central Library at Ghulam Ishaq Khan Institute (GIKI) is a three-story building established in 1996, offering a vast collection of books, eBooks, journals, and audiovisual materials. It provides an intellectual sanctuary for students and faculty, fostering a conducive environment for study and research.",
      "url": "https://giki.edu.pk/library/"
    },
    {
      "section": "Facilities",
      "title": "Library Amenities",
      "content": "The library is fully air-conditioned and offers a Wi-Fi facility for internet access. It includes a furnished seminar room and provides 18 hours of access daily, extending to round-the-clock availability during examinations.",
      "url": "https://giki.edu.pk/library/"
    },
    {
      "section": "Digital Resources",
      "title": "Electronic Databases and Catalogs",
      "content": "GIKI's library provides desktop access to various e-databases, eBooks, and library catalogs to all campus readers. It is electronically linked with prominent institutions of science and technology in the country to facilitate resource sharing through inter-library loans and database information exchange.",
      "url": "https://giki.edu.pk/library/"
    },
    {
      "section": "Online Public Access Catalog (OPAC)",
      "title": "Library Search System",
      "content": "The Online Public Access Catalog (OPAC) allows users to search for books and other materials available in the GIKI library from their desktops. It includes a rich collection of books on subjects like electronics, computer science, materials science, mechanical engineering, engineering sciences, management sciences, social sciences, Islamic literature, Urdu and English literature, and reference books such as dictionaries and encyclopedias.",
      "url": "https://librarygiki.weebly.com/opac.html"
    },
    {
      "section": "E-Library",
      "title": "Digital Book Collection",
      "content": "GIKI's E-Library offers a rich collection of e-books accessible within the campus. These books cover a variety of subjects, including computer hardware and software engineering, engineering sciences, mechanical engineering, electronic engineering, and humanities/management sciences.",
      "url": "https://librarygiki.weebly.com/giki-e-library.html"
    },
    {
      "section": "Digital Library",
      "title": "Online Journals and Databases",
      "content": "The Digital Library provides access to a vast collection of industry-leading standards and technical engineering information, covering a broad range of engineering disciplines, including aerospace, biomedical, chemical, civil, environmental, geological, health and safety, industrial, materials science, mechanical, and nuclear engineering.",
      "url": "https://librarygiki.weebly.com/digital-library.html"
    },
    {
      "section": "Library Portal",
      "title": "Online Access",
      "content": "The GIKI Institute Library maintains its own portal where users can find the latest information about library collections, digital library access, and more.",
      "url": "https://librarygiki.weebly.com/"
    },
    {
      "section": "Contact Information",
      "title": "Library Staff",
      "content": "Assistant Librarian: Mr. Muhammad Riaz (mriaz@giki.edu.pk, Ext: 2457); Library Assistant: Mr. Hamid Iqbal (hamidiqbal@giki.edu.pk, Ext: 2644); Library Assistant: Mr. Lal Bahadar (lalbahadar@giki.edu.pk, Ext: 2645); Library Assistant: Mr. Nisar Ali (Nisar.ali@giki.edu.pk, Ext: 2645).",
      "url": "https://giki.edu.pk/library/"
    },
 {
      "section": "Student Affairs",
      "title": "Overview",
      "content": "The Student Affairs Office at GIKI serves as a liaison between students, faculty, and administration, aiming to enhance the quality of student life both inside and outside the classroom. It leads, directs, and administers functions such as student counseling, hostel residence, student societies, and discipline.",
      "url": "https://giki.edu.pk/academics/student-affairs/"
    },
    {
      "section": "Counseling Services",
      "title": "Student Counseling",
      "content": "The Student Affairs Office provides counseling services to assist students with academic, personal, or emotional challenges. A full-time Assistant Director of Student Affairs is readily available to help students address any problems they encounter on campus.",
      "url": "https://giki.edu.pk/academics/student-affairs/"
    },
    {
      "section": "Residential Life",
      "title": "Hostel Residence",
      "content": "The office manages hostel accommodations, ensuring a comfortable and conducive living environment for students. It oversees the allocation of rooms, maintenance of facilities, and addresses any residential concerns.",
      "url": "https://giki.edu.pk/academics/student-affairs/"
    },
    {
      "section": "Student Organizations",
      "title": "Student Societies",
      "content": "GIKI hosts a variety of student societies that cater to diverse interests, including technical, cultural, and recreational activities. The Student Affairs Office supports these societies in organizing events, workshops, and seminars to enrich the campus experience.",
      "url": "https://giki.edu.pk/campus-life/student-socities/"
    },
    {
      "section": "Disciplinary Matters",
      "title": "Student Discipline",
      "content": "The office is responsible for upholding the institute's code of conduct, addressing disciplinary issues, and ensuring a respectful and safe environment for all students.",
      "url": "https://giki.edu.pk/academics/student-affairs/"
    },
    {
      "section": "Health and Wellness",
      "title": "Health Services",
      "content": "GIKI provides health services to promote the well-being of students, including access to medical facilities and health awareness programs.",
      "url": "https://giki.edu.pk/academics/student-affairs/"
    },
    {
      "section": "Career Development",
      "title": "Career Counseling",
      "content": "The Student Affairs Office offers career counseling services to guide students in their professional development, including resume building, interview preparation, and job placement assistance.",
      "url": "https://giki.edu.pk/academics/student-affairs/"
    },
    {
      "section": "Events and Activities",
      "title": "Campus Events",
      "content": "The office coordinates various campus events, including cultural festivals, sports competitions, and academic seminars, fostering a vibrant campus life.",
      "url": "https://giki.edu.pk/events/"
    },
    {
      "section": "Alumni Relations",
      "title": "Alumni Engagement",
      "content": "Maintaining strong connections with alumni, the Student Affairs Office organizes reunions and networking events to build a supportive community for current students.",
      "url": "https://giki.edu.pk/academics/student-affairs/"
    },
    {
      "section": "Student Support",
      "title": "Support Services",
      "content": "The office provides various support services, including academic advising, mentorship programs, and assistance for students with disabilities, ensuring an inclusive environment.",
      "url": "https://giki.edu.pk/academics/student-affairs/"
    },
 {
      "section": "Office Overview",
      "title": "Admissions and Examinations Office",
      "content": "The Office of Admissions and Examinations at GIKI oversees the entire admissions process, from application to enrollment, and manages examination procedures, ensuring academic integrity and compliance with institutional policies.",
      "url": "https://giki.edu.pk/academics/office-of-admission-examination/"
    },
    {
      "section": "Admissions Process",
      "title": "Application Procedures",
      "content": "Prospective students can apply online through the admissions portal, providing necessary academic records and personal information. The office evaluates applications based on eligibility criteria and academic performance.",
      "url": "https://giki.edu.pk/admissions/"
    },
    {
      "section": "Examination Management",
      "title": "Scheduling and Coordination",
      "content": "The office is responsible for preparing semester timetables, date sheets, and coordinating the conduct of semester examinations, including midterms and finals.",
      "url": "https://giki.edu.pk/academics/academic-calendar/"
    },
    {
      "section": "Results Compilation",
      "title": "Grade Processing",
      "content": "Post-examination, the office compiles and processes results, ensuring accuracy before releasing them to students. It also handles the issuance of transcripts and result cards.",
      "url": "https://giki.edu.pk/academics/office-of-admission-examination/"
    },
    {
      "section": "Degree Issuance",
      "title": "Certification",
      "content": "Upon successful completion of programs, the office issues degrees and language proficiency certificates to graduates, maintaining records for verification purposes.",
      "url": "https://giki.edu.pk/academics/office-of-admission-examination/"
    },
    {
      "section": "Rechecking and Re-totaling",
      "title": "Grade Review Process",
      "content": "Students dissatisfied with their grades can apply for rechecking or re-totaling of their final exam papers by submitting a prescribed form and paying the requisite fee.",
      "url": "https://giki.edu.pk/academics/office-of-admission-examination/"
    },
    {
      "section": "Staff Directory",
      "title": "Key Personnel",
      "content": "The office comprises dedicated staff, including the Director of Admissions and Examinations, Deputy Director of Examinations, Assistant Director of Admissions and Examinations, Admission Officer, Examination Officer, and Office Assistants.",
      "url": "https://giki.edu.pk/academics/office-of-admission-examination/"
    },
    {
      "section": "Contact Information",
      "title": "Office Contacts",
      "content": "For inquiries, contact the office via email at faheem@giki.edu.pk or phone at (0938) 281026, extensions 2205, 2425, 2345, 2518, 2425, 2349, 2301, and 2342.",
      "url": "https://giki.edu.pk/academics/office-of-admission-examination/"
    },
    {
      "section": "Academic Policies",
      "title": "Regulations and Guidelines",
      "content": "The office ensures adherence to academic policies, including examination conduct, grading systems, and academic integrity standards.",
      "url": "https://giki.edu.pk/academics/academic-policy/"
    },
    {
      "section": "Student Support",
      "title": "Assistance Services",
      "content": "The office provides support services to students regarding admissions, examinations, and academic records, facilitating a smooth academic journey.",
      "url": "https://giki.edu.pk/academics/office-of-admission-examination/"
    }
 {
      "section": "Quality Enhancement Cell",
      "title": "Overview",
      "content": "The Quality Enhancement Cell (QEC) at Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) was established on February 20, 2008, within the Rector's Secretariat in the H.U. Beg Administration Building. Following the Higher Education Commission (HEC) guidelines, the QEC is integral to advancing and maintaining educational quality. Its primary function is to develop, implement, and monitor quality assurance policies that align with national and international standards.",
      "url": "https://giki.edu.pk/quality-enhancement-cell/"
    },
    {
      "section": "Functions and Activities",
      "title": "Core Responsibilities",
      "content": "The QEC is responsible for conducting internal evaluations of academic programs and faculty performance to ensure compliance with accreditation requirements and institutional goals. It systematically reviews curricula and teaching methodologies to reflect current industry standards and educational trends. Additionally, the QEC gathers and analyzes feedback from students, faculty, and other stakeholders to identify areas for improvement and implement action plans accordingly. It plays a crucial role in facilitating external audits and ensuring continuous alignment with HEC directives. The QEC also promotes faculty development through training workshops and fosters communication between all stakeholders to support quality enhancement initiatives across the institution.",
      "url": "https://giki.edu.pk/quality-enhancement-cell/"
    },
    {
      "section": "Self-Assessment Review Cycle",
      "title": "Continuous Improvement Process",
      "content": "The self-assessment program review process at GIKI is a critical component of its commitment to maintaining high educational standards and fostering continuous improvement. This process involves a comprehensive internal evaluation where faculty, staff, and stakeholders collaboratively assess the effectiveness of academic programs against predefined criteria. Through detailed analyses of curriculum content, teaching methodologies, student outcomes, and resource utilization, the self-assessment aims to identify strengths, areas for improvement, and potential innovations. The findings from these reviews guide strategic planning and decision-making, ensuring that the Institute’s programs remain aligned with industry standards and evolving educational trends, ultimately enhancing the quality of education and student experience.",
      "url": "https://giki.edu.pk/quality-enhancement-cell/self-assessment-review-cycle/"
    },
    {
      "section": "Program Self-Assessments",
      "title": "Evaluating Academic Programs",
      "content": "The Self-Assessment Review Process, as outlined by the Quality Assurance Agency (QAA) of the Higher Education Commission (HEC), serves as a critical mechanism for ensuring the excellence and accountability of higher education institutions. This process is designed to facilitate a thorough and reflective evaluation of academic programs and institutional practices, promoting continuous improvement and adherence to established quality standards. By engaging in a comprehensive self-assessment, institutions can identify strengths, address areas for development, and enhance their overall educational offerings. This review supports the institution’s commitment to delivering high-quality education and reinforces its dedication to maintaining transparency and responsiveness in a dynamic academic landscape.",
      "url": "https://giki.edu.pk/quality-enhancement-cell/program-self-assessments/"
    },
    {
      "section": "Training and Seminars",
      "title": "Faculty Development Initiatives",
      "content": "The QEC organizes various training sessions and seminars to promote quality awareness and enhance faculty development. Notable events include workshops on Continuous Professional Development Programs, Quality Awareness Seminars, and international workshops on Outcome-Based Education (OBE). These initiatives aim to equip faculty members with the necessary skills and knowledge to maintain and improve educational quality.",
      "url": "https://giki.edu.pk/quality-enhancement-cell/training-and-seminars/"
    },
    {
      "section": "International Rankings",
      "title": "Global Academic Standing",
      "content": "GIKI actively participates in international rankings, demonstrating its commitment to achieving and showcasing global academic excellence. By engaging with various renowned ranking systems, the Institute highlights its strengths in research, teaching quality, and overall institutional performance on an international platform. This participation provides valuable insights into its comparative standing among leading global institutions and drives continuous improvement and strategic enhancements. The recognition gained through these rankings underscores GIKI’s dedication to maintaining high standards and its role as a significant contributor to the global higher education landscape.",
      "url": "https://giki.edu.pk/quality-enhancement-cell/international-rankings/"
    },
    {
      "section": "Surveys",
      "title": "Stakeholder Feedback Mechanisms",
      "content": "The QEC conducts various surveys to gather feedback from different stakeholders, including students, alumni, and employers. These surveys are conducted online, with appropriate time given to participants to provide their responses. Regular reminders are issued to improve response rates, and most surveys are anonymous to protect respondent identities. Upon closure, survey reports are prepared, containing necessary details such as survey statistics, results, and comments. These reports are reviewed by the highest-level management to gain insights into stakeholders' perceptions and address any issues, facilitating timely and necessary changes within the institute.",
      "url": "https://giki.edu.pk/quality-enhancement-cell/surveys/"
    },
{
      "section": "Office Overview",
      "title": "Office of Research, Innovation, and Commercialization (ORIC)",
      "content": "The Office of Research, Innovation, and Commercialization (ORIC) at Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) serves as a pivotal entity in fostering research excellence, innovation, and industry collaboration. Established to bridge the gap between academia and industry, ORIC aims to enhance the quality and impact of research activities, promote commercialization of research outcomes, and strengthen relationships with industrial partners.",
      "url": "https://giki.edu.pk/oric/"
    },
    {
      "section": "Vision and Mission",
      "title": "Strategic Objectives",
      "content": "ORIC envisions positioning GIKI as a leading institution in research and innovation, contributing significantly to technological advancements and societal development. Its mission encompasses facilitating high-quality research, encouraging innovation and entrepreneurship, and ensuring the effective commercialization of research outputs.",
      "url": "https://giki.edu.pk/oric/"
    },
    {
      "section": "Research Facilitation",
      "title": "Support for Research Activities",
      "content": "ORIC provides comprehensive support to faculty and students in initiating and conducting research projects. This includes assistance in proposal development, securing funding, and managing research grants. The office ensures adherence to ethical standards and compliance with institutional and regulatory guidelines throughout the research process.",
      "url": "https://giki.edu.pk/oric/"
    },
    {
      "section": "Innovation and Entrepreneurship",
      "title": "Promoting Startups and Spin-offs",
      "content": "To cultivate an entrepreneurial culture, ORIC offers resources and mentorship to students and faculty interested in transforming innovative ideas into viable startups. The office organizes workshops, seminars, and training sessions on entrepreneurship, intellectual property rights, and business development.",
      "url": "https://giki.edu.pk/oric/"
    },
    {
      "section": "Industry Collaboration",
      "title": "Partnerships and Linkages",
      "content": "ORIC actively seeks to establish and strengthen partnerships with industry stakeholders. These collaborations facilitate joint research projects, internships, and employment opportunities for students, and ensure that academic programs align with industry needs. Notably, ORIC organized an event where Atlas Honda gifted their latest electric vehicle bike, the Honda BENLY e:, to GIKI, marking a significant step in joint research and innovation in Pakistan's electric mobility sector.",
      "url": "https://giki.edu.pk/2024/06/03/giki-partners-with-atlas-honda-for-joint-research-innovation-in-pakistans-electric-mobility-sector-atlas-honda-gifted-their-latest-electric-vehicle-bike-the-honda-benly-e-to-giki/"
    },
    {
      "section": "Commercialization of Research",
      "title": "Technology Transfer and Licensing",
      "content": "ORIC oversees the commercialization of research outputs by facilitating technology transfer and licensing agreements. The office assists in identifying marketable research, protecting intellectual property, and negotiating with potential commercial partners to bring innovations to market.",
      "url": "https://giki.edu.pk/oric/"
    },
    {
      "section": "Career Services",
      "title": "Student Placement and Development",
      "content": "The Career Services Office, operating under ORIC, plays a vital role in connecting students, graduates, and alumni with leading employers. It offers career counseling, organizes job fairs, and maintains ties with industry to facilitate internships and job placements. The office is dedicated to the success of students and alumni in their professional endeavors.",
      "url": "https://giki.edu.pk/oric/career-services/"
    },
    {
      "section": "Alumni Relations",
      "title": "Engagement and Networking",
      "content": "ORIC is committed to fostering enduring relationships with GIKI alumni. It organizes events, reunions, and networking opportunities to strengthen connections between the institute and its graduates, encouraging their involvement in academic and research activities.",
      "url": "https://giki.edu.pk/oric/alumni-relations/"
    },
    {
      "section": "Industrial Open House",
      "title": "Showcasing Talent and Research",
      "content": "To establish liaison between the institute and industry, ORIC organizes the annual Industrial Open House and Careers Fair. This event provides a platform for students to showcase their projects and for industries to explore potential collaborations and recruit talent.",
      "url": "https://giki.edu.pk/2024/03/12/industrial-open-house-2024/"
    },
    {
      "section": "Contact Information",
      "title": "Reach Out to ORIC",
      "content": "Office of Research, Innovation, and Commercialization (ORIC), G-17, Admin Block, GIK Institute of Engineering Sciences & Technology, Topi, District Swabi, Khyber Pakhtunkhwa, Pakistan. Tel: +92-938-271858 Ext. 2289, 2530. Email: oric@giki.edu.pk.",
      "url": "https://giki.edu.pk/oric-contact-us/"
    },
    {
      "section": "Undergraduate Programs",
      "title": "Tuition and Accommodation Fees",
      "content": "For the academic year 2024-25, the semester fee for Engineering programs is PKR 427,500, totaling PKR 855,000 annually. For Management Sciences, the semester fee is PKR 375,000, totaling PKR 750,000 annually. These fees cover tuition and accommodation charges. A 5% administrative charge applies per semester unless the entire annual fee is paid in a lump sum. The semester fee is non-refundable, except in cases where an applicant becomes ineligible upon result declaration, in which case a refund is provided.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-fees-and-expenses/"
    },
    {
      "section": "Graduate Programs",
      "title": "Tuition Fees and Additional Charges",
      "content": "The annual tuition fee for graduate programs is subject to periodic revisions. A non-refundable admission fee of PKR 65,000 is required at the time of admission. Additionally, a refundable security deposit of PKR 30,000 is charged, which is refundable upon clearance from relevant departments upon leaving the institute. Final-year students are charged a convocation fee of PKR 17,500. An advance of PKR 8,000 is to be deposited by each student as mess security, with actual charges deducted monthly.",
      "url": "https://giki.edu.pk/admissions/admissions-graduate/grad-fees-and-expenses/"
    },
    {
      "section": "Payment Methods",
      "title": "Fee Submission Channels",
      "content": "Students can pay their semester or annual fees through various channels: over the counter at any branch of Habib Bank Limited (HBL), HBL Internet Banking or Mobile App (HBL network only), and 1-Bill Top-up for all banks. Detailed procedures for each payment method are provided on the institute's website.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-fees-and-expenses/"
    },
    {
      "section": "Refund Policy",
      "title": "Tuition Fee Refund Guidelines",
      "content": "If a newly admitted student withdraws their admission, the following refund policy applies: 100% refund before joining the institute; 100% refund minus 10% administrative charges within the first seven days of class commencement; 50% refund from the 8th to the 15th day after classes begin; no refund from the 16th day onward. In cases where an applicant becomes ineligible upon result declaration, a 100% tuition fee refund is provided if applied for within 10 days of result declaration, along with proof of ineligibility.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/fees-and-expenses/"
    },
    {
      "section": "Withholding Tax",
      "title": "Tax Deduction on Fees",
      "content": "A withholding tax under section 236I of the Income Tax Ordinance 2001 is applicable at a rate of 5% on tuition fees, admission fees, and administrative charges.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/fees-and-expenses/"
    },
    {
      "section": "Additional Charges",
      "title": "Miscellaneous Fees",
      "content": "Final-year students are charged a convocation fee of PKR 17,000. An advance of PKR 15,000 is to be deposited by each student as mess security, with actual charges deducted monthly. A refundable security deposit of PKR 30,000 is also required at the time of admission, subject to clearance from relevant departments upon leaving the institute.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-fees-and-expenses/"
    },
    {
      "section": "Foreign Students",
      "title": "Tuition Fees for International Students",
      "content": "The annual tuition fee for foreign students is USD 3,000. Additional charges, including administrative fees and security deposits, apply as per the institute's policies.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-fees-and-expenses/"
    },
    {
      "section": "Bench Fee for Overstaying Graduate Students",
      "title": "Charges for Extended Study Periods",
      "content": "Graduate students availing GIK Institute scholarships are allowed a normal duration without additional charges and stipend. For MS students, the normal duration is 2 years with a 6-month grace period; for PhD students, it is 3 years with a 1-year grace period. Beyond the grace period, a bench fee of PKR 100,000 per semester is charged, up to the maximum duration of 2 years for MS and 2 years for PhD students. Beyond this, students must pay the full fee.",
      "url": "https://giki.edu.pk/admissions/admissions-graduate/grad-fees-and-expenses/"
    },
    {
      "section": "Free Electricity Units",
      "title": "Electricity Allowance for Hostel Residents",
      "content": "The institute provides free electricity units to hostel residents: 93 units per month for male students and 100 units per month for female students during summer; 70 units per month for both male and female students during winter. Additional free units are allocated for common areas per hostel. Any excess consumption is charged to the students.",
      "url": "https://giki.edu.pk/admissions/admissions-graduate/grad-fees-and-expenses/"
    },
 {
      "section": "Overview",
      "title": "Faculty of Electrical Engineering",
      "content": "The Faculty of Electrical Engineering (FEE) at Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) is dedicated to delivering comprehensive and state-of-the-art electrical engineering education. Aligning with national requirements and international best practices, FEE aims to enhance student learning and prepare graduates for the evolving technological landscape.",
      "url": "https://giki.edu.pk/fee/"
    },
    {
      "section": "Undergraduate Programs",
      "title": "Bachelor of Science in Electrical Engineering",
      "content": "FEE offers a four-year Bachelor of Science (BS) degree in Electrical Engineering with specializations in Electronic Engineering and Power Engineering. The curriculum is designed to equip students with the knowledge and skills necessary to lead future engineering teams and realize innovative ideas.",
      "url": "https://giki.edu.pk/fee/fee-undergraduate/"
    },
    {
      "section": "Graduate Programs",
      "title": "Master of Science and Doctor of Philosophy in Electrical Engineering",
      "content": "FEE provides graduate programs leading to Master of Science (MS) and Doctor of Philosophy (PhD) degrees in Electrical Engineering. Specializations include Microelectronics, MEMS and ASIC Design; Power and Control Systems; and Communication and Digital Signal Processing.",
      "url": "https://giki.edu.pk/fee/fee-graduate/"
    },
    {
      "section": "Research Thrust Areas",
      "title": "Focused Research Domains",
      "content": "FEE emphasizes research in key areas such as Communication and Digital Signal Processing, Microelectronics and ASIC Design, and Electric Power and Control Systems. These thrust areas align with industry needs and technological advancements.",
      "url": "https://giki.edu.pk/fee/"
    },
    {
      "section": "Laboratories and Facilities",
      "title": "State-of-the-Art Labs",
      "content": "FEE houses advanced laboratories, including the Microwave Laboratory, Microelectronics Laboratory, Electric Machines Laboratory, Signals & Image Processing Laboratory, and Telecommunications Laboratory. These facilities provide students with hands-on experience to understand and apply electrical engineering concepts.",
      "url": "https://giki.edu.pk/fee/fee-labs-and-facilities/"
    },
    {
      "section": "Faculty Profiles",
      "title": "Experienced Academic Staff",
      "content": "FEE boasts a team of qualified faculty members with diverse research interests. Notable faculty include Dr. Hadeed Ahmed Sher, specializing in photovoltaic applications and power electronics; Dr. Waleed Tariq Sethi, focusing on 5G and 6G sub-THz communication and applied electromagnetics; and Dr. Zia ul Haq Abbas, with expertise in stochastic processes and performance analysis of computer and communication networks.",
      "url": "https://giki.edu.pk/fee/fee-faculty-profile/"
    },
    {
      "section": "Course Offerings",
      "title": "Comprehensive Curriculum",
      "content": "FEE offers a wide range of courses covering fundamental and advanced topics in electrical engineering. Courses include Linear Circuit Analysis, Electronic Devices & Circuits, Communication Systems, Digital Signal Processing, and Antenna Theory & Design.",
      "url": "https://giki.edu.pk/course-search/"
    },
    {
      "section": "Accreditation",
      "title": "Quality Assurance",
      "content": "The undergraduate programs in Electrical Engineering at GIKI are accredited by the Pakistan Engineering Council (PEC), ensuring adherence to national educational standards and quality benchmarks.",
      "url": "https://giki.edu.pk/quality-enhancement-cell/accreditation-of-undergraduate-programs/"
    },
    {
      "section": "Contact Information",
      "title": "Get in Touch",
      "content": "For more information about the Faculty of Electrical Engineering, its programs, requirements, scholarships, and career options, please contact the faculty office via email at fee@giki.edu.pk or phone at +92-938-271858.",
      "url": "https://giki.edu.pk/fee/"
    },
    {
      "section": "Overview",
      "title": "Faculty of Computer Science and Engineering (FCSE)",
      "content": "The Faculty of Computer Science and Engineering (FCSE) at Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) is dedicated to nurturing skilled scientists and engineers who demonstrate excellence in both practical applications and research within the field of computing. The faculty leverages cutting-edge technologies to enrich learning experiences and provides a dynamic environment conducive to student growth.",
      "url": "https://giki.edu.pk/fcse/"
    },
    {
      "section": "Undergraduate Programs",
      "title": "Bachelor of Science Degrees",
      "content": "FCSE offers a range of Bachelor of Science (BS) programs designed to equip students with the requisite skills and knowledge essential for thriving in today’s rapidly evolving technology landscape. The programs include:\n\n- **BS in Computer Engineering**: Focuses on a blend of computer science and electrical engineering topics, preparing students for various career opportunities in the computing industry.\n- **BS in Computer Science**: Provides a broad understanding of the field through intensive education in core areas such as databases, graphics, software engineering, and computer systems development.\n- **BS in Artificial Intelligence**: Partnered with Huawei, this program aims to impart in-depth knowledge required to transform data into intelligent decisions, focusing on machine-based decision-making from complex inputs.\n- **BS in Cyber Security**: Covers core computing and cybersecurity courses, industrial labs, internships, and social sciences to prepare graduates for the future economy.\n- **BS in Data Science**: Combines mathematical, statistical, and computing principles with electives in various areas of computer science to develop a professional approach to designing computer-based systems.\n- **BS in Software Engineering**: Emphasizes software and systems engineering, software project management, and software requirements engineering.",
      "url": "https://giki.edu.pk/fcse/fcs-undergraduate/"
    },
    {
      "section": "Graduate Programs",
      "title": "Master and Doctoral Degrees",
      "content": "FCSE offers Master of Science (MS) and Doctor of Philosophy (PhD) degrees in both Computer Science and Computer Engineering. These programs are meticulously designed to equip students with advanced knowledge and research skills, addressing the evolving needs of industry, academia, and society.",
      "url": "https://giki.edu.pk/fcse/fcs-graduate/"
    },
    {
      "section": "Research Thrust Areas",
      "title": "Focused Research Domains",
      "content": "FCSE emphasizes research in key areas to address the evolving needs of industry, academia, and society. The thrust areas include:\n\n- Artificial Intelligence and Robotics\n- Algorithms and Computational Theory\n- High Performance Computing\n- Machine Learning & Data Mining\n- Network Communications and Distributed Systems\n- Signal and Image Processing\n- Software and Systems Engineering\n- Software Project Management\n- Software Requirements Engineering\n- UI/UX Design\n- Data Science & Data Mining\n- Data Warehousing\n- Data Visualization\n- Big Data Analytics\n- Cyber Security\n- Penetration Testing\n- Cryptography",
      "url": "https://giki.edu.pk/fcse/"
    },
    {
      "section": "Faculty Profiles",
      "title": "Experienced Academic Staff",
      "content": "FCSE boasts a team of qualified faculty members with diverse research interests. Notable faculty include:\n\n- **Prof. Dr. Qadeer Ul Hasan**: Dean of FCSE, with research interests in Machine Learning, Energy Management Systems, Adaptive Signal Processing, and Cognitive Radio.\n- **Prof. Dr. Zahid Halim**: Dean of Open Distance Learning, specializing in Data Science, Machine Learning and Data Mining, Intelligent Transportation Systems, and Computational Intelligence.\n- **Prof. Dr. Ghulam Abbas**: Head of Software Engineering & Cyber Security, focusing on computer networks, wireless communications, and distributed systems.\n- **Prof. Dr. Masroor Hussain**: Head of Computer Engineering & Data Science, with expertise in High Performance Computing, Computational Science, Data Mining, Neural Networks, Image Processing, and Video Mining.",
      "url": "https://giki.edu.pk/fcse/faculty-profiles/"
    },
    {
      "section": "Laboratories and Facilities",
      "title": "State-of-the-Art Labs",
      "content": "FCSE is well-equipped with state-of-the-art computer systems running a wide range of applications and specialized software supporting the courses. The faculty provides well-equipped research laboratories for the use of faculty, graduate students, and senior undergraduate students. Notable facilities include:\n\n- **Programming and Computing (PC) Lab**: The central computing laboratory of the Institute, providing general-purpose computing facilities to all students, as well as internet and printing facilities.",
      "url": "https://giki.edu.pk/fcse/fcs-labs-and-facilities/"
    },
    {
      "section": "Accreditation",
      "title": "Quality Assurance",
      "content": "The undergraduate programs in Computer Engineering at GIKI are accredited by the Pakistan Engineering Council (PEC) under level-II, i.e., Outcome-Based Education (OBE). Other programs are accredited by the National Computing Education Accreditation Council (NCEAC), ensuring adherence to national educational standards and quality benchmarks.",
      "url": "https://giki.edu.pk/quality-enhancement-cell/accreditation-of-undergraduate-programs/"
    },
    {
      "section": "Career Opportunities",
      "title": "Employment Prospects",
      "content": "Graduates of FCSE have secured employment in renowned national and international organizations, including Microsoft, Google, IBM, and Amazon, among others. The comprehensive programs equip students with the requisite skills and knowledge essential for thriving in today’s rapidly evolving technology landscape.",
      "url": "https://giki.edu.pk/fcse/"
    },
    {
      "section": "Contact Information",
      "title": "Get in Touch",
      "content": "For more information about the Faculty of Computer Science and Engineering, its programs, requirements, scholarships, and career options, please contact the faculty office via email at fcse@giki.edu.pk or phone at +92-938-271858.",
      "url": "https://giki.edu.pk/fcse/"
    },
 {
      "section": "Overview",
      "title": "Faculty of Engineering Sciences (FES)",
      "content": "The Faculty of Engineering Sciences (FES) at Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) offers a unique interdisciplinary program that integrates various engineering disciplines with applied physics and mathematics. Established to produce future-ready engineers, FES emphasizes flexibility and adaptability in its curriculum, preparing graduates to excel in diverse industrial, research, business, and academic ventures.",
      "url": "https://giki.edu.pk/fes/"
    },
    {
      "section": "Undergraduate Program",
      "title": "Bachelor of Science in Engineering Sciences",
      "content": "FES offers a four-year Bachelor of Science (BS) degree in Engineering Sciences. The program is accredited by the Pakistan Engineering Council (PEC) under the Washington Accord Level-II category of Outcome-Based Education (OBE) system. Students are required to complete 19 credit hours in one of the following specialization fields:\n\n- **Photonics and Semiconductor Devices**\n- **Applied Mathematics and Computational Science**\n- **Energy Systems Engineering**\n\nThe curriculum includes advanced elective courses and projects tailored to develop expertise in the chosen specialization.",
      "url": "https://giki.edu.pk/fes/fes-undergraduate/"
    },
    {
      "section": "Graduate Programs",
      "title": "Master of Science and Doctor of Philosophy in Engineering Sciences",
      "content": "FES offers graduate programs leading to Master of Science (MS) and Doctor of Philosophy (PhD) degrees in Engineering Sciences. These programs focus on emerging fields of engineering science and technology, aiming to produce effective practicing engineers and researchers. The graduate curriculum is designed to meet the industrial needs of the new millennium, emphasizing research and development in various engineering sciences and technology domains.",
      "url": "https://giki.edu.pk/fes/fes-graduate/"
    },
    {
      "section": "Research Thrust Areas",
      "title": "Focused Research Domains",
      "content": "FES emphasizes research in key areas to address the evolving needs of industry, academia, and society. The thrust areas include:\n\n- **Photonics and Semiconductor Devices**: Research in lasers, electro-optics, and semiconductor devices.\n- **Applied Mathematics and Computational Science**: Focus on mathematical modeling, simulations, and computational techniques.\n- **Energy Systems Engineering**: Studies in renewable energy systems, energy efficiency, and sustainable technologies.",
      "url": "https://giki.edu.pk/fes/"
    },
    {
      "section": "Faculty Profiles",
      "title": "Experienced Academic Staff",
      "content": "FES boasts a team of qualified faculty members with diverse research interests. Notable faculty include:\n\n- **Dr. Fahd Sikandar Khan**: Director/PI - HBL Center for Blockchain & Applied Research, OGDCL Clean Energy Research Center / Assistant Professor.\n- **Dr. Farhan Khan**: Assistant Professor with research interests in Machine Learning, Deep Neural Networks, and Image Processing.\n- **Dr. Hadeed Ahmed Sher**: Associate Professor specializing in Control Systems and Adaptive Neural Networks.",
      "url": "https://giki.edu.pk/fes/es-faculty-profile/"
    },
    {
      "section": "Laboratories and Facilities",
      "title": "State-of-the-Art Labs",
      "content": "FES is equipped with state-of-the-art laboratories that provide students with hands-on experience to understand and apply engineering concepts. Notable facilities include:\n\n- **Photonics Laboratory**: Equipped for research in lasers and electro-optics.\n- **Semiconductor Devices Laboratory**: Facilities for studying semiconductor and superconducting devices.\n- **Computational Science Laboratory**: Resources for modeling and simulations.",
      "url": "https://giki.edu.pk/fes/"
    },
    {
      "section": "Accreditation",
      "title": "Quality Assurance",
      "content": "The undergraduate program in Engineering Sciences at GIKI is accredited by the Pakistan Engineering Council (PEC) under the Washington Accord Level-II category of Outcome-Based Education (OBE) system, ensuring adherence to national educational standards and quality benchmarks.",
      "url": "https://giki.edu.pk/quality-enhancement-cell/accreditation-of-undergraduate-programs/"
    },
    {
      "section": "Career Opportunities",
      "title": "Employment Prospects",
      "content": "Graduates of FES have secured employment in renowned national and international organizations. The comprehensive programs equip students with the requisite skills and knowledge essential for thriving in today’s rapidly evolving technology landscape.",
      "url": "https://giki.edu.pk/fes/"
    },
    {
      "section": "Contact Information",
      "title": "Get in Touch",
      "content": "For more information about the Faculty of Engineering Sciences, its programs, requirements, scholarships, and career options, please contact the faculty office via email at fes@giki.edu.pk or phone at +92-938-271858.",
      "url": "https://giki.edu.pk/fes/"
    },
 {
      "section": "Overview",
      "title": "Faculty of Mechanical Engineering (FME)",
      "content": "The Faculty of Mechanical Engineering (FME) at Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) is dedicated to producing professionals with a solid knowledge base, leadership qualities, and social rectitude. FME offers a comprehensive curriculum that combines theoretical knowledge with practical experience, preparing students to excel in the dynamic field of mechanical engineering.",
      "url": "https://giki.edu.pk/fme/"
    },
    {
      "section": "Undergraduate Program",
      "title": "Bachelor of Science in Mechanical Engineering",
      "content": "FME offers a well-structured 4-year Bachelor of Science (BS) degree program in Mechanical Engineering. The program provides a sound foundation of engineering principles and promotes communication and practical skills essential for the modern industry. Students can specialize in one of the following streams:\n\n- **Thermo-fluids**\n- **Design & Manufacturing**\n- **System Dynamics & Controls**\n\nThe curriculum includes extensive laboratory work, problem-based learning, and complex engineering problem-solving to reinforce classroom theory.",
      "url": "https://giki.edu.pk/fme/fme-undergraduate/"
    },
    {
      "section": "Graduate Programs",
      "title": "Master of Science and Doctor of Philosophy in Mechanical Engineering",
      "content": "FME offers graduate programs leading to Master of Science (MS) and Doctor of Philosophy (PhD) degrees in Mechanical Engineering. Students can specialize in the following areas:\n\n- **Design and Manufacturing**\n- **Thermo-fluid Engineering**\n- **Dynamics and Control Systems Engineering**\n\nThe graduate curriculum is designed to meet the industrial needs of the new millennium, emphasizing research and development in various mechanical engineering domains.",
      "url": "https://giki.edu.pk/fme/fme-graduate/"
    },
    {
      "section": "Research Thrust Areas",
      "title": "Focused Research Domains",
      "content": "FME emphasizes research in key areas to address the evolving needs of industry, academia, and society. The thrust areas include:\n\n- **Renewable Energy and Sustainable Engineering**\n- **HVAC Systems Using Natural Refrigerants**\n- **Microhydro Turbines**\n- **Advanced Materials and Manufacturing**\n- **Robotics and Automation**\n- **Computational Mechanics and CFD**\n- **Microfluidics Systems and Devices**\n- **Design and Optimization of Engineering Systems**\n- **Mechatronics and Systems Integration**\n- **Artificial Intelligence and Machine Learning in Mechanical Engineering**",
      "url": "https://giki.edu.pk/fme/"
    },
    {
      "section": "Faculty Profiles",
      "title": "Experienced Academic Staff",
      "content": "FME boasts a team of qualified faculty members with diverse research interests. Notable faculty include:\n\n- **Prof. Dr. Wasim Ahmed Khan**: Specializes in Virtual Reality, Virtual Manufacturing, Operations Research, and Education Management. :contentReference[oaicite:0]{index=0}\n- **Dr. Khalid Rahman**: Focuses on Electrohydrodynamic Inkjet Printing, Direct Write Technologies, Printed and Flexible Devices, and Wearable Devices. :contentReference[oaicite:1]{index=1}\n- **Dr. Massab Junaid**: Researches Metal Joining, Laser and Wire-Arc Metal Deposition, Residual Stresses in Structures, and Thermo-Mechanical Processing.",
      "url": "https://giki.edu.pk/fme/fme-faculty-profile/"
    },
    {
      "section": "Laboratories and Facilities",
      "title": "State-of-the-Art Labs",
      "content": "FME is equipped with state-of-the-art laboratories that provide students with hands-on experience to understand and apply mechanical engineering concepts. Notable facilities include:\n\n- **Thermo-Fluids Laboratory**: Equipped for research in heat transfer, fluid dynamics, and thermodynamics.\n- **Design and Manufacturing Laboratory**: Facilities for studying manufacturing processes, materials science, and mechanical design.\n- **Dynamics and Control Systems Laboratory**: Resources for modeling, simulation, and control of dynamic systems.",
      "url": "https://giki.edu.pk/fme/"
    },
    {
      "section": "Accreditation",
      "title": "Quality Assurance",
      "content": "The undergraduate program in Mechanical Engineering at GIKI is accredited by the Pakistan Engineering Council (PEC) under the Washington Accord Level-II category of Outcome-Based Education (OBE) system, ensuring adherence to national educational standards and quality benchmarks.",
      "url": "https://giki.edu.pk/quality-enhancement-cell/accreditation-of-undergraduate-programs/"
    },
    {
      "section": "Career Opportunities",
      "title": "Employment Prospects",
      "content": "Graduates of FME have secured employment in renowned national and international organizations. The comprehensive programs equip students with the requisite skills and knowledge essential for thriving in today’s rapidly evolving technology landscape.",
      "url": "https://giki.edu.pk/fme/"
    },
    {
      "section": "Contact Information",
      "title": "Get in Touch",
      "content": "For more information about the Faculty of Mechanical Engineering, its programs, requirements, scholarships, and career options, please contact the faculty office via email at fme@giki.edu.pk or phone at +92-938-271858.",
      "url": "https://giki.edu.pk/fme/"
    },
 {
      "section": "Overview",
      "title": "Faculty of Materials and Chemical Engineering (FMCE)",
      "content": "The Faculty of Materials and Chemical Engineering (FMCE) at Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) offers comprehensive programs in Materials Engineering and Chemical Engineering at both undergraduate and graduate levels. FMCE is committed to excellence in teaching and high-quality research, addressing multidisciplinary challenges in the fields of materials science and chemical engineering. :contentReference[oaicite:0]{index=0}",
      "url": "https://giki.edu.pk/fmce/"
    },
    {
      "section": "Departments",
      "title": "Academic Departments",
      "content": "FMCE comprises two main departments:\n\n- **Department of Materials Science and Engineering (DMSE)**: Offers programs focused on the understanding and application of materials science, preparing students for careers in academia, research, business, and industry. :contentReference[oaicite:1]{index=1}\n- **Department of Chemical Engineering (DCHE)**: Provides education and training in chemical engineering, emphasizing innovation, sustainability, and a positive impact on society. :contentReference[oaicite:2]{index=2}",
      "url": "https://giki.edu.pk/fmce/"
    },
    {
      "section": "Undergraduate Programs",
      "title": "Bachelor of Science Degrees",
      "content": "FMCE offers four-year Bachelor of Science (BS) degree programs in:\n\n- **Materials Engineering**: Specializations include Manufacturing and Nanotechnology. :contentReference[oaicite:3]{index=3}\n- **Chemical Engineering**: Focuses on designing, process dynamics, synthesizing energy sectors, and materials production. :contentReference[oaicite:4]{index=4}",
      "url": "https://giki.edu.pk/fmce/"
    },
    {
      "section": "Graduate Programs",
      "title": "Master of Science and Doctor of Philosophy Degrees",
      "content": "FMCE offers graduate programs leading to Master of Science (MS) and Doctor of Philosophy (PhD) degrees in both Materials Engineering and Chemical Engineering. These programs are designed to provide in-depth knowledge and enhance analytical skills and research capabilities. :contentReference[oaicite:5]{index=5}",
      "url": "https://giki.edu.pk/fmce/"
    },
    {
      "section": "Research Thrust Areas",
      "title": "Focused Research Domains",
      "content": "FMCE emphasizes research in key areas to address the evolving needs of industry, academia, and society. The thrust areas include:\n\n- **Materials Processing, Manufacturing, and Characterization**\n- **Nanotechnology and Nanomaterials**\n- **Ceramics, Polymers, and Composites**\n- **Surface Engineering and Coating Technology**\n- **Computational Materials Science**\n- **Corrosion and Oxidation**",
      "url": "https://giki.edu.pk/fmce/"
    },
    {
      "section": "Faculty Profiles",
      "title": "Experienced Academic Staff",
      "content": "FMCE boasts a team of qualified faculty members with diverse research interests. Notable faculty include:\n\n- **Prof. Dr. F. Ahmad Khalid, SI**: Rector and Professor with research interests in nanotechnology and materials engineering. :contentReference[oaicite:6]{index=6}\n- **Prof. Dr. Fahd Nawaz Khan**: Dean and Professor specializing in machining and joining of high-performance alloys. :contentReference[oaicite:7]{index=7}\n- **Dr. Muhammad Imran Khan**: Dean (Student Affairs) and Associate Professor focusing on smart materials for engineering and biomedical applications.",
      "url": "https://giki.edu.pk/fmce/"
    },
    {
      "section": "Laboratories and Facilities",
      "title": "State-of-the-Art Labs",
      "content": "FMCE is equipped with state-of-the-art laboratories that provide students with hands-on experience to understand and apply materials and chemical engineering concepts. Notable facilities include:\n\n- **Materials Characterization Laboratory**: Equipped for research in materials processing and characterization.\n- **Chemical Engineering Laboratory**: Facilities for studying chemical processes and reaction engineering.",
      "url": "https://giki.edu.pk/fmce/"
    },
    {
      "section": "Accreditation",
      "title": "Quality Assurance",
      "content": "The undergraduate programs in Materials Engineering and Chemical Engineering at GIKI are accredited by the Pakistan Engineering Council (PEC), ensuring adherence to national educational standards and quality benchmarks.",
      "url": "https://giki.edu.pk/quality-enhancement-cell/accreditation-of-undergraduate-programs/"
    },
    {
      "section": "Career Opportunities",
      "title": "Employment Prospects",
      "content": "Graduates of FMCE have secured employment in renowned national and international organizations. The comprehensive programs equip students with the requisite skills and knowledge essential for thriving in today’s rapidly evolving technology landscape.",
      "url": "https://giki.edu.pk/fmce/"
    },
    {
      "section": "Contact Information",
      "title": "Get in Touch",
      "content": "For more information about the Faculty of Materials and Chemical Engineering, its programs, requirements, scholarships, and career options, please contact the faculty office via email at fmce@giki.edu.pk or phone at +92-938-271858.",
      "url": "https://giki.edu.pk/fmce/"
    },
 {
      "section": "Overview",
      "title": "Department of Civil Engineering (DCE)",
      "content": "The Department of Civil Engineering (DCE) at Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) is committed to providing high-quality academic programs supported by state-of-the-art laboratory facilities. The department aims to produce competent engineers capable of addressing contemporary challenges in the construction industry by integrating theoretical knowledge with practical applications. :contentReference[oaicite:0]{index=0}",
      "url": "https://giki.edu.pk/dce/"
    },
    {
      "section": "Undergraduate Program",
      "title": "Bachelor of Science in Civil Engineering",
      "content": "DCE offers a four-year Bachelor of Science (BS) degree in Civil Engineering. The curriculum encompasses all sub-disciplines of civil engineering, including structural, transportation, water resources, environmental, geotechnical engineering, geomatics, and construction management. The program emphasizes hands-on learning through fully equipped laboratories and well-furnished classrooms with high-quality digital tools. :contentReference[oaicite:1]{index=1}",
      "url": "https://giki.edu.pk/dce/dce-undergraduate/"
    },
    {
      "section": "Graduate Programs",
      "title": "Master of Science and Doctor of Philosophy in Civil Engineering",
      "content": "Recognizing the importance of advanced studies, DCE offers graduate programs leading to Master of Science (MS) and Doctor of Philosophy (PhD) degrees in Civil Engineering. These programs focus on addressing design and construction issues, coping with modern construction trends, and fostering research in various civil engineering domains. :contentReference[oaicite:2]{index=2}",
      "url": "https://giki.edu.pk/dce/dce-graduate/"
    },
    {
      "section": "Research Thrust Areas",
      "title": "Focused Research Domains",
      "content": "DCE emphasizes research in key areas to address the evolving needs of industry, academia, and society. The thrust areas include:\n\n- **Structural Engineering**\n- **Transportation Engineering**\n- **Water Resources Engineering**\n- **Environmental Engineering**\n- **Geotechnical Engineering**\n- **Geomatics**\n- **Construction Management**",
      "url": "https://giki.edu.pk/dce/"
    },
    {
      "section": "Faculty Profiles",
      "title": "Experienced Academic Staff",
      "content": "DCE boasts a team of qualified faculty members with diverse research interests. Notable faculty include:\n\n- **Prof. Dr. Muhammad Ashraf Tanoli**: Head of Department, specializing in structural engineering and construction management. :contentReference[oaicite:3]{index=3}\n- **Dr. Numan Khan**: Assistant Professor with research interests in AI and machine learning for data analysis, building information modeling, and construction safety monitoring. :contentReference[oaicite:4]{index=4}\n- **Dr. Muhammad Waseem**: Assistant Professor focusing on hydrology and water resources engineering. :contentReference[oaicite:5]{index=5}",
      "url": "https://giki.edu.pk/dce/dce-faculty-profile/"
    },
    {
      "section": "Laboratories and Facilities",
      "title": "State-of-the-Art Labs",
      "content": "DCE is equipped with state-of-the-art laboratories that provide students with hands-on experience to understand and apply civil engineering concepts. The laboratories are fully equipped to carry out academic and research work, as well as commercial testing. :contentReference[oaicite:6]{index=6}",
      "url": "https://giki.edu.pk/dce/"
    },
    {
      "section": "Accreditation",
      "title": "Quality Assurance",
      "content": "The undergraduate program in Civil Engineering at GIKI is accredited by the Pakistan Engineering Council (PEC) under the Level II schedule of the Washington Accord, ensuring adherence to national educational standards and quality benchmarks. :contentReference[oaicite:7]{index=7}",
      "url": "https://giki.edu.pk/quality-enhancement-cell/accreditation-of-undergraduate-programs/"
    },
    {
      "section": "Career Opportunities",
      "title": "Employment Prospects",
      "content": "Graduates of DCE have secured employment in renowned national and international organizations. The comprehensive programs equip students with the requisite skills and knowledge essential for thriving in today’s rapidly evolving technology landscape. :contentReference[oaicite:8]{index=8}",
      "url": "https://giki.edu.pk/dce/"
    },
    {
      "section": "Contact Information",
      "title": "Get in Touch",
      "content": "For more information about the Department of Civil Engineering, its programs, requirements, scholarships, and career options, please contact the department office via email at dce@giki.edu.pk or phone at +92-938-271858.",
      "url": "https://giki.edu.pk/dce/"
    },
 {
      "section": "Overview",
      "title": "School of Management Sciences (SMS)",
      "content": "The School of Management Sciences (SMS) at Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) is dedicated to educating and developing business graduates who create value for their stakeholders and society at large. SMS aims to build a conducive environment for faculty and students that is diverse and inclusive, led by learning, entrepreneurial, and research orientation. :contentReference[oaicite:0]{index=0}",
      "url": "https://giki.edu.pk/mgs/"
    },
    {
      "section": "Vision and Mission",
      "title": "Strategic Objectives",
      "content": "SMS envisions being among the top business schools in the country and playing a leadership role in the field of management sciences education. The mission includes educating and developing business graduates who create value for their stakeholders and society at large, and building a conducive environment for faculty and students that is diverse and inclusive, led by learning, entrepreneurial, and research orientation. :contentReference[oaicite:1]{index=1}",
      "url": "https://giki.edu.pk/mgs/"
    },
    {
      "section": "Undergraduate Program",
      "title": "Bachelor of Science in Management Sciences",
      "content": "SMS offers a four-year Bachelor of Science (BS) degree in Management Sciences. The program is designed to provide students with a comprehensive understanding of business principles and practices, preparing them for leadership roles in various industries. The curriculum includes courses in marketing, finance, human resource management, and entrepreneurship, among others. :contentReference[oaicite:2]{index=2}",
      "url": "https://giki.edu.pk/mgs/mgs-undergraduate/"
    },
    {
      "section": "Graduate Program",
      "title": "Master of Science in Engineering Management",
      "content": "SMS offers a Master of Science (MS) degree in Engineering Management. This program is geared towards helping engineers and technologists develop planning, decision-making, and managerial skills alongside advanced technical knowledge. The curriculum bridges accredited engineering programs with the managerial skills needed to provide engineering leadership in today’s multidisciplinary business environments. :contentReference[oaicite:3]{index=3}",
      "url": "https://giki.edu.pk/mgs/mgs-graduate/"
    },
    {
      "section": "Faculty Profiles",
      "title": "Experienced Academic Staff",
      "content": "SMS boasts a team of qualified faculty members with diverse research interests. Notable faculty include:\n\n- **Prof. Dr. Sami Farooq**: Dean and Professor with research interests in Operations and Supply Chain Management. :contentReference[oaicite:4]{index=4}\n- **Dr. Yousaf Ali Khan**: Associate Professor specializing in Operations Management and Quantitative Methods. :contentReference[oaicite:5]{index=5}\n- **Dr. Muhammad Zeshan**: Assistant Professor focusing on Digitalization, Organizational Behavior, and Human Resource Management. :contentReference[oaicite:6]{index=6}",
      "url": "https://giki.edu.pk/mgs/mgs-faculty-profile/"
    },
    {
      "section": "Research Officers and Staff",
      "title": "Supportive Research Environment",
      "content": "SMS is supported by a team of research officers and staff who contribute to the school's research initiatives and academic activities. The team includes individuals with advanced degrees in management sciences and related fields, providing valuable assistance in research projects and academic endeavors. :contentReference[oaicite:7]{index=7}",
      "url": "https://giki.edu.pk/mgs/mgs-research-officers-and-staff/"
    },
    {
      "section": "Research Thrust Areas",
      "title": "Focused Research Domains",
      "content": "SMS emphasizes research in key areas to address the evolving needs of industry, academia, and society. The thrust areas include:\n\n- **Operations and Supply Chain Management**\n- **Digitalization and Organizational Behavior**\n- **Entrepreneurship and Innovation**\n- **Marketing and Consumer Behavior**\n- **Finance and Accounting**",
      "url": "https://giki.edu.pk/mgs/"
    },
    {
      "section": "Laboratories and Facilities",
      "title": "State-of-the-Art Labs",
      "content": "SMS is equipped with state-of-the-art facilities that provide students with hands-on experience to understand and apply management concepts. The facilities include modern classrooms, computer labs with the latest software, and access to a comprehensive library with a vast collection of books, journals, and online resources. :contentReference[oaicite:8]{index=8}",
      "url": "https://giki.edu.pk/mgs/"
    },
    {
      "section": "Accreditation",
      "title": "Quality Assurance",
      "content": "The programs offered by SMS adhere to national educational standards and quality benchmarks, ensuring that graduates are well-prepared to meet the demands of the industry and academia. The school continuously updates its curriculum and teaching methodologies to maintain high standards of education. :contentReference[oaicite:9]{index=9}",
      "url": "https://giki.edu.pk/mgs/"
    },
    {
      "section": "Career Opportunities",
      "title": "Employment Prospects",
      "content": "Graduates of SMS have secured employment in renowned national and international organizations. The comprehensive programs equip students with the requisite skills and knowledge essential for thriving in today’s rapidly evolving business landscape. The school's strong industry connections and emphasis on practical learning enhance students' employability. :contentReference[oaicite:10]{index=10}",
      "url": "https://giki.edu.pk/mgs/"
    },
    {
      "section": "Contact Information",
      "title": "Get in Touch",
      "content": "For more information about the School of Management Sciences, its programs, requirements, scholarships, and career options, please contact the school office via email at mgs@giki.edu.pk or phone at +92-938-271858. The administrative staff is available to assist with inquiries and provide detailed information about the school's offerings. :contentReference[oaicite:11]{index=11}",
      "url": "https://giki.edu.pk/mgs/"
    },
  {
      "section": "Institute Overview",
      "title": "About GIK Institute",
      "content": "GIKI is a premier institution in Pakistan known for engineering, sciences, and technology, focusing on excellence and innovation.",
      "url": "https://giki.edu.pk/institute/"
    },
    {
      "section": "History",
      "title": "Genesis and Vision",
      "content": "Established in 1993 with the vision of Mr. Ghulam Ishaq Khan, aiming to reduce dependency on foreign expertise through local talent cultivation.",
      "url": "https://giki.edu.pk/institute/"
    },
    {
      "section": "Academic Excellence",
      "title": "Programs Offered",
      "content": "Comprehensive programs in engineering, computer sciences, and management are provided, coupled with state-of-the-art labs.",
      "url": "https://giki.edu.pk/institute/"
    },
    {
      "section": "Student Life",
      "title": "Campus and Extracurriculars",
      "content": "GIKI offers a vibrant campus life with over 24 active student societies, promoting leadership and holistic development.",
      "url": "https://giki.edu.pk/institute/"
    },
    {
      "section": "Accreditations",
      "title": "Recognition",
      "content": "GIKI is accredited by the HEC and PEC, receiving national and international acclaim for educational quality.",
      "url": "https://giki.edu.pk/institute/"
    },
 {
      "section": "Governance",
      "title": "Board of Governors",
      "content": "The Board of Governors is the highest authority at GIKI, overseeing the institute's strategic direction and ensuring adherence to its mission and vision.",
      "url": "https://giki.edu.pk/board-of-governors/"
    },
    {
      "section": "Leadership",
      "title": "President of the Board",
      "content": "Engr. Salim Saifullah Khan serves as the President of the Board of Governors, bringing extensive experience and leadership to the institute.",
      "url": "https://giki.edu.pk/board-of-governors/"
    },
    {
      "section": "Founding Members",
      "title": "Founding Members of the Board",
      "content": "The founding members include Engr. Salim Saifullah Khan, Mr. M. Adil Khattak, Mr. Iftikhar H. Shirazi, Mr. Kh. Zaheer Ahmad, and Mr. Osman Saifullah Khan.",
      "url": "https://giki.edu.pk/board-of-governors/"
    },
    {
      "section": "Current Members",
      "title": "Board Members",
      "content": "The Board comprises distinguished individuals such as Mr. Tariq Iqbal Khan, Dr. Muhammad Zubair Khan, Dr. Samia Altaf, Mr. Shah Faisal Afridi, Ms. Khadija Jamal Shahban, and Ms. Nargis Ali Akbar Ghaloo.",
      "url": "https://giki.edu.pk/board-of-governors/"
    },
    {
      "section": "Executive Director",
      "title": "Executive Director SOPREST",
      "content": "Mr. Shakil Durrani, a Pakistan Administrative Service officer, serves as the Executive Director of SOPREST, contributing his vast administrative experience.",
      "url": "https://giki.edu.pk/board-of-governors/"
    },
    {
      "section": "Ex-officio Members",
      "title": "Ex-officio Members of the Board",
      "content": "The Board includes ex-officio members such as the Chairman of the Higher Education Commission, Chairman of WAPDA, Executive Director of SOPREST, Secretary of Finance Division, Chief Secretary of Khyber Pakhtunkhwa, Secretary of Science and Information Technology of Khyber Pakhtunkhwa, Director General of National Information Technology Board, Rector of GIK Institute, Pro-Rector (A&F) of GIK Institute, and Pro-Rector (A) of GIK Institute.",
      "url": "https://giki.edu.pk/board-of-governors/"
    },
    {
      "section": "Secretary",
      "title": "Acting Secretary of the Board",
      "content": "Mr. Irfan Ahmad serves as the Acting Secretary of the Board of Governors, facilitating communication and coordination among board members.",
      "url": "https://giki.edu.pk/board-of-governors/"
    },
 {
      "section": "Leadership",
      "title": "President's Message",
      "content": "The President of GIKI expresses satisfaction with the institute's strides in education and research, highlighting its leading position in engineering fields and expansion into innovative areas. Emphasis is placed on the institute's commitment to excellence in the digital age, with plans for an Artificial Intelligence center and partnerships with foreign universities and corporations.",
      "url": "https://giki.edu.pk/presidents-message/"
    },
    {
      "section": "Academic Excellence",
      "title": "Commitment to Quality Education",
      "content": "GIKI maintains its leading position in various engineering disciplines and has expanded its activities to provide quality education in new and innovative areas at the cutting edge of technological research, innovation, and development worldwide.",
      "url": "https://giki.edu.pk/presidents-message/"
    },
    {
      "section": "Future Initiatives",
      "title": "Artificial Intelligence Center",
      "content": "Plans for setting up a Center for work on Artificial Intelligence (AI) and its applications to National Development are under active consideration. GIKI has forged important partnerships for faculty and student exchange with a number of well-known foreign universities and a well-known international corporation.",
      "url": "https://giki.edu.pk/presidents-message/"
    },
    {
      "section": "Entrepreneurship",
      "title": "Business and Management Program",
      "content": "The Business and Management program offers opportunities to students to couple their technical knowledge and skills with the practical know-how of entrepreneurship and enterprise development.",
      "url": "https://giki.edu.pk/presidents-message/"
    },
    {
      "section": "Student Selection",
      "title": "Merit-Based Enrollment",
      "content": "GIKI has always striven to select the best and the most motivated students. Selection on merit has always been the only criterion for enrollment.",
      "url": "https://giki.edu.pk/presidents-message/"
    },
    {
      "section": "Gender Diversity",
      "title": "Increase in Female Enrollment",
      "content": "There has been a significant increase in the number of female students excelling in every field, with hopes for larger female enrollment in the future.",
      "url": "https://giki.edu.pk/presidents-message/"
    },
    {
      "section": "Faculty and Management",
      "title": "Dedicated Leadership",
      "content": "The capable management, under the leadership of the Rector and supported by distinguished faculty members, is recognized as a body of competent and dedicated supervisors, teachers, and support staff, and an asset to the institution.",
      "url": "https://giki.edu.pk/presidents-message/"
    },
    {
      "section": "Campus Facilities",
      "title": "Supportive Environment",
      "content": "The expanding GIKI facilities, with spacious grounds, elegant classrooms and hostels, state-of-the-art equipment and laboratories, offer a fully supportive environment for study, research, creative activities, and sports.",
      "url": "https://giki.edu.pk/presidents-message/"
    },
 {
      "section": "Leadership",
      "title": "Rector's Message",
      "content": "The Rector emphasizes GIKI's reputation built on the quality of its faculty, students, and facilities, particularly laboratories. Faculty members with outstanding academic credentials have been publishing research in high-repute journals, often collaborating with international universities.",
      "url": "https://giki.edu.pk/rectors-message/"
    },
    {
      "section": "Research Excellence",
      "title": "Faculty Achievements",
      "content": "Faculty members have won numerous awards, including 'Outstanding Research' and 'Best Research Paper' by the Higher Education Commission (HEC) of Pakistan. A record number of research projects were funded by external agencies.",
      "url": "https://giki.edu.pk/rectors-message/"
    },
    {
      "section": "Global Recognition",
      "title": "Times Higher Education Ranking",
      "content": "GIKI was ranked by Times Higher Education (THE) at Number 24 in the world (and Number one in Pakistan) for 'Quality Education' in its University Impact Rankings related to the United Nations Sustainable Development Goals.",
      "url": "https://giki.edu.pk/rectors-message/"
    },
    {
      "section": "Growth and Expansion",
      "title": "Program and Enrollment Growth",
      "content": "Starting with just 120 students in 1993, GIKI now has over 2,000 students. Initially offering five disciplines without a graduate program, it now offers 11 disciplines, with the graduate program introduced in 2001 and over 200 students enrolled.",
      "url": "https://giki.edu.pk/rectors-message/"
    },
    {
      "section": "Alumni and Support",
      "title": "Community Contributions",
      "content": "The growth has been possible due to the strong support of alumni, Board of Governors members, and other friends and well-wishers.",
      "url": "https://giki.edu.pk/rectors-message/"
    },
    {
      "section": "New Initiatives",
      "title": "BS in Artificial Intelligence",
      "content": "From Fall 2020, GIKI introduced a BS in Artificial Intelligence program with the support of Huawei. This 'BS in AI – Partnered by Huawei' program is unique outside of China, reflecting GIKI's stature.",
      "url": "https://giki.edu.pk/rectors-message/"
    },
    {
      "section": "Administration Overview",
      "title": "Administrative Structure",
      "content": "The Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) maintains a comprehensive administrative framework to support its academic and operational functions. The administration encompasses various departments, each dedicated to specific aspects of the institute's operations, ensuring a cohesive and efficient environment for students, faculty, and staff. :contentReference[oaicite:0]{index=0}",
      "url": "https://giki.edu.pk/administration/"
    },
    {
      "section": "Departments and Functions",
      "title": "Key Administrative Departments",
      "content": "- **Marketing**: Manages the institute's public relations, branding, and outreach initiatives to enhance visibility and engagement.\n- **Finance**: Oversees budgeting, financial planning, and resource allocation to ensure fiscal responsibility and sustainability.\n- **Procurement**: Handles the acquisition of goods and services necessary for the institute's operations, maintaining transparency and efficiency.\n- **Information Technology (IT)**: Provides technological support, infrastructure maintenance, and cybersecurity measures to facilitate academic and administrative activities.\n- **Facilitation**: Coordinates logistical aspects, including event management and campus services, to support the institute's functions.\n- **Human Resources (HR)**: Manages recruitment, employee relations, and professional development programs for faculty and staff.\n- **Medical**: Ensures the health and well-being of the campus community through medical services and health awareness programs.\n- **Security**: Maintains a safe and secure campus environment through vigilant security measures and protocols.\n- **Protocol**: Oversees official ceremonies, visits, and events, ensuring adherence to institutional protocols and decorum.",
      "url": "https://giki.edu.pk/administration/"
    },
    {
      "section": "Key Personnel",
      "title": "Administrative Leadership",
      "content": "- **Deputy Director (HR)**: Khushal Sardar\n- **Pro-Rector (Academics)**: Prof. Dr. Wasim Ahmed Khan\n- **Coordinators Open House & Careers Fair**: Officers Incharge of the Career Office, responsible for liaising with national and multinational companies to secure job opportunities, internships, and event sponsorships. :contentReference[oaicite:1]{index=1}",
      "url": "https://giki.edu.pk/administration/"
    },
    {
      "section": "Career Office",
      "title": "Student Career Support",
      "content": "The Career Office, under the supervision of the Pro-Rector (Academics), serves as a bridge between students and potential employers. It offers services such as career advising, information on various companies, assistance in CV preparation, and facilitation of internships. :contentReference[oaicite:2]{index=2}",
      "url": "https://giki.edu.pk/administration/career-office/"
    },
    {
      "section": "Student Affairs",
      "title": "Student Support Services",
      "content": "The Student Affairs Office acts as a liaison between students, faculty, and administration. It provides assistance in student counseling, hostel residence, student societies, and discipline, aiming to enhance the quality of student life both inside and outside the classroom. :contentReference[oaicite:3]{index=3}",
      "url": "https://giki.edu.pk/academics/student-affairs/"
    },
    {
      "section": "Contact Information",
      "title": "Administrative Contact Details",
      "content": "For inquiries related to administration and finance departments, contact:\n- **Address**: GIK Institute of Engineering Sciences and Technology, Topi 23460, Khyber Pakhtunkhwa, Pakistan.\n- **Phone**: (0938) 281026\n- **Fax**: (098) 281032",
      "url": "https://giki.edu.pk/contact-us/"
    },
   {
      "section": "Undergraduate Admissions",
      "title": "Overview",
      "content": "The Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) offers a comprehensive undergraduate admissions process for prospective students aiming to pursue Bachelor of Science (BS) degrees in various engineering and management disciplines. The institute emphasizes a merit-based selection system, ensuring equal opportunities for all applicants. :contentReference[oaicite:0]{index=0}",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/"
    },
    {
      "section": "Programs Offered",
      "title": "Undergraduate Degree Programs",
      "content": "GIKI provides the following BS programs:\n\n- **Engineering Programs**:\n  - Mechanical Engineering\n  - Electrical Engineering\n  - Computer Engineering\n  - Chemical Engineering\n  - Materials Engineering\n  - Civil Engineering\n  - Software Engineering\n  - Artificial Intelligence\n  - Cyber Security\n  - Data Science\n- **Management Sciences**:\n  - BS in Management Sciences",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/"
    },
    {
      "section": "Eligibility Criteria",
      "title": "Basic Eligibility Requirements",
      "content": "Candidates must meet one of the following criteria:\n\n- **Engineering Programs**:\n  - HSSC (Pre-Engineering) with at least 60% marks in Mathematics, Physics, and overall.\n  - HSSC (ICS) with at least 60% marks in Mathematics, Physics, and overall.\n  - A-Level with D or above grades in Mathematics, Physics, and Chemistry.\n  - American or Canadian High School Diploma with Mathematics (with Calculus), Physics, and Chemistry, achieving 60% or above marks as per IBCC equivalence formula.\n  - Three-year Diploma of Associate Engineering (DAE) in a relevant technology with at least 60% marks.\n- **Management Sciences Program**:\n  - HSSC in any discipline with at least 60% overall marks.\n  - A-Level with Ds or above grades in two principal subjects.\n  - American or Canadian High School Diploma with overall 60% or above marks as per IBCC equivalence formula.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/eligibility-criteria/"
    },
    {
      "section": "Admission Test",
      "title": "GIKI Common Admissions Test (GCAT)",
      "content": "The admission test comprises multiple-choice questions based on Pakistani intermediate-level Physics, Mathematics, and English. For the BS Management Sciences program, the GCAT assesses reading, writing, and mathematical skills. The test is conducted online, and applicants can choose their preferred test center. :contentReference[oaicite:1]{index=1}",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugradhow-to-apply/"
    },
    {
      "section": "Application Procedure",
      "title": "Steps to Apply",
      "content": "1. **Online Application**: Visit the [GIKI Admissions Portal](https://admissions.giki.edu.pk/) to fill out and submit the online application form.\n2. **Upload Documents**: Provide a recent color photograph and any other required documents.\n3. **Processing Fee**: Pay the application processing fee (Rs. 5,000 for a single test; Rs. 6,000 for both tests; add Rs. 500 if applying for financial assistance) via the provided bank challan.\n4. **Admit Card**: Download the admit card from the admissions portal.\n5. **Admission Test**: Appear for the admission test at the selected center with the admit card, original Matric/O-Level certificate, and paid bank challan.\n6. **Result and Documentation**: Check the test results online and, if offered admission, submit the required documents to the admission office.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/application-procedure/"
    },
    {
      "section": "Financial Assistance",
      "title": "Aid and Scholarships",
      "content": "GIKI offers financial assistance to deserving students through scholarships and interest-free loans. Applicants can apply for financial aid during the admission process by submitting the financial assistance form along with the admission form and an additional processing fee of Rs. 1,000. Scholarships such as the Punjab Educational Endowment Fund (PEEF) and Chief Minister KP Scholarship are also available, each with specific eligibility criteria. :contentReference[oaicite:2]{index=2}",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-aid-scholarships/"
    },
    {
      "section": "Important Dates",
      "title": "Admission Timeline",
      "content": "- **Application Start**: April 4, 2024\n- **Application Deadline (Extended)**: June 12, 2024\n- **Last Date for Receipt of Financial Assistance Documents**: June 12, 2024\n- **Admission Test**: July 4 – 10, 2024\n- **Result Announcement**: July 16, 2024\n- **Merit List**: July 16, 2024\n- **Joining & Orientation**: September 1, 2024\n- **Commencement of Classes**: September 4, 2024",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/"
    },
    {
      "section": "Contact Information",
      "title": "Undergraduate Admission Office",
      "content": "- **Address**: GIK Institute of Engineering Sciences and Technology, Topi, District Swabi, Khyber Pakhtunkhwa, Pakistan\n- **Phone**: (0938) 281026, 281014, 281017\n- **Email**: ugadmissions@giki.edu.pk",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/"
    },
 {
      "section": "GIKI Admission 2025 Alerts",
      "title": "Stay Informed About Admission Updates",
      "content": "The Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) offers a subscription service for prospective students to receive timely updates on admission dates, entry/admission test schedules, and other relevant information via SMS, WhatsApp, and email. :contentReference[oaicite:0]{index=0}",
      "url": "https://giki.edu.pk/subscribe"
    },
    {
      "section": "Subscription Process",
      "title": "How to Subscribe",
      "content": "To subscribe to GIKI Admission 2025 Alerts, follow these steps:\n\n1. **Visit the Subscription Page**: Go to the [GIKI Admission Alerts 2025 page](https://giki.edu.pk/subscribe).\n2. **Fill Out the Form**: Provide your name, select your area of interest (BS Admissions or MS/PhD Admissions), enter your email address, and provide your mobile number in the format +92 300 12345678.\n3. **Consent**: Agree to the privacy policy and terms and conditions by checking the consent box.\n4. **Subscribe**: Click the 'Subscribe' button to complete the process.",
      "url": "https://giki.edu.pk/subscribe"
    },
    {
      "section": "Privacy Policy and Terms",
      "title": "User Data Protection",
      "content": "By subscribing, you consent to GIKI's privacy policy and terms and conditions, ensuring that your personal information is handled securely and used solely for the purpose of providing admission-related updates.",
      "url": "https://giki.edu.pk/subscribe"
    },
    {
      "section": "Contact Information",
      "title": "Get in Touch",
      "content": "For further inquiries regarding the subscription service or admission process, you can contact GIKI at:\n\n- **Phone**: (0938) 281026\n- **Fax**: (098) 281032\n- **Address**: GIK Institute of Engineering Sciences and Technology, Topi 23460, Khyber Pakhtunkhwa, Pakistan.",
      "url": "https://giki.edu.pk/subscribe"
    },
 {
      "section": "Scholarships and Financial Assistance",
      "title": "Overview",
      "content": "The Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) is committed to supporting deserving and talented students through a variety of scholarships and financial assistance programs. For the academic year 2024-25, GIKI has allocated over Rs. 200 million to assist undergraduate students, ensuring that financial constraints do not hinder access to quality education. :contentReference[oaicite:0]{index=0}",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-aid-scholarships/"
    },
    {
      "section": "Merit-Based Scholarships",
      "title": "GIK Merit Scholarship",
      "content": "Awarded to the top 20 candidates based on admission merit. This scholarship covers full tuition fees. All top merit applicants are automatically considered; no separate application is required. :contentReference[oaicite:1]{index=1}",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-aid-scholarships/"
    },
    {
      "section": "Need-Based Financial Assistance",
      "title": "Financial Assistance by GIK Institute",
      "content": "Available to 40 students on a need-cum-merit basis, offering full or partial tuition fee coverage. Applicants must apply through the admissions portal during the application process. :contentReference[oaicite:2]{index=2}",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-aid-scholarships/"
    },
    {
      "section": "Female Student Scholarships",
      "title": "Financial Assistance for Top Female Students",
      "content": "Ten fully funded scholarships are awarded to top female applicants based on merit. All top merit female applicants are automatically considered without the need for a separate application. :contentReference[oaicite:3]{index=3}",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-aid-scholarships/"
    },
    {
      "section": "Provincial Scholarships",
      "title": "Punjab Educational Endowment Fund (PEEF) Scholarship",
      "content": "Offered to Punjab-domiciled students with an annual family income less than Rs. 720,000. Ten partially funded scholarships are available. Applicants should apply through the admissions portal. :contentReference[oaicite:4]{index=4}",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-aid-scholarships/"
    },
    {
      "section": "Provincial Scholarships",
      "title": "Chief Minister Khyber Pakhtunkhwa Scholarship",
      "content": "Available to KP-domiciled students, including those from ex-FATA regions, with an annual family income less than Rs. 600,000. Twenty fully funded scholarships are offered. Applications are accepted through the admissions portal. :contentReference[oaicite:5]{index=5}",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-aid-scholarships/"
    },
    {
      "section": "Foundation Scholarships",
      "title": "BARD Foundation Scholarship",
      "content": "One fully funded scholarship is available for students eligible for GIKI's financial assistance and hailing from rural areas. Applicants who apply for GIKI's financial assistance will be considered for this scholarship. :contentReference[oaicite:6]{index=6}",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-aid-scholarships/"
    },
    {
      "section": "Post-Admission Scholarships",
      "title": "GIK Alumni Association Scholarships",
      "content": "Fifty-five fully or partially funded scholarships are available for needy students from the second year onwards. Applications can be submitted after the first year of study. :contentReference[oaicite:7]{index=7}",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-aid-scholarships/"
    },
    {
      "section": "Loan Programs",
      "title": "Ihsan Trust Loan",
      "content": "Twenty partially funded, need-based, interest-free loans are available. Applications can be submitted after receiving an admission offer from GIKI. :contentReference[oaicite:8]{index=8}",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-aid-scholarships/"
    },
    {
      "section": "Provincial Scholarships",
      "title": "Sindh Scholarship",
      "content": "Five fully funded scholarships are available for Sindh-domiciled students with an annual family income less than Rs. 1,200,000. Applications can be submitted after joining GIKI. :contentReference[oaicite:9]{index=9}",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-aid-scholarships/"
    },
    {
      "section": "Provincial Scholarships",
      "title": "Chief Minister Educational Endowment Fund Scholarship (CMEEF)",
      "content": "Four fully funded scholarships are available for KP-domiciled students, including those from ex-FATA regions, with an annual family income less than Rs. 1,200,000. These scholarships are specifically for the Faculty of Engineering Sciences with a specialization in photonics. Applications can be submitted after joining GIKI. :contentReference[oaicite:10]{index=10}",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-aid-scholarships/"
    },
    {
      "section": "Provincial Scholarships",
      "title": "Balochistan Scholarship (BEEF)",
      "content": "Four fully funded scholarships are available for Balochistan-domiciled students. Applications can be submitted after joining GIKI. :contentReference[oaicite:11]{index=11}",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-aid-scholarships/"
    },
 {
      "section": "Scholarships and Financial Assistance",
      "title": "Overview",
      "content": "The Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) is committed to supporting talented and deserving students through various scholarships and financial assistance programs. For the academic year 2024-25, GIKI has allocated over Rs. 200 million to assist undergraduate students, ensuring that financial challenges do not impede access to quality education.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-aid-scholarships/"
    },
    {
      "section": "Merit-Based Scholarships",
      "title": "GIK Merit Scholarship",
      "content": "This scholarship is awarded to the top 20 candidates based on admission merit. It covers full tuition fees, and top merit applicants are automatically considered without needing a separate application.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-aid-scholarships/"
    },
    {
      "section": "Need-Based Financial Assistance",
      "title": "GIKI Financial Assistance",
      "content": "GIKI provides need-based financial assistance to 40 students on a merit-cum-need basis, which can include full or partial tuition fee coverage. Students must apply through the admissions portal as part of the application process.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-aid-scholarships/"
    },
    {
      "section": "Female Student Scholarships",
      "title": "Top Female Students Scholarships",
      "content": "Ten fully funded scholarships are available for top-performing female applicants based on merit. All top merit female candidates are automatically considered for these scholarships.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-aid-scholarships/"
    },
    {
      "section": "Provincial Scholarships",
      "title": "PEEF Scholarship for Punjab Students",
      "content": "The Punjab Educational Endowment Fund (PEEF) offers scholarships for Punjab-domiciled students with an annual family income of less than Rs. 720,000. Ten partially funded scholarships are provided. Applicants must apply through the admissions portal.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-aid-scholarships/"
    },
    {
      "section": "Provincial Scholarships",
      "title": "Chief Minister KP Scholarship",
      "content": "This scholarship is available to KP-domiciled students, including those from ex-FATA, with an annual family income of less than Rs. 600,000. Twenty fully funded scholarships are offered, and applications should be made via the admissions portal.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-aid-scholarships/"
    },
    {
      "section": "Foundation Scholarships",
      "title": "BARD Foundation Scholarship",
      "content": "A fully funded scholarship available for students eligible for GIKI's financial assistance and hailing from rural areas. This scholarship considers students who have already applied for GIKI's financial aid.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-aid-scholarships/"
    },
    {
      "section": "Post-Admission Scholarships",
      "title": "GIK Alumni Association Scholarships",
      "content": "Fifty-five fully or partially funded scholarships are offered to students in their second year or beyond based on need. Applications for these scholarships can be made after the first year of study.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-aid-scholarships/"
    },
    {
      "section": "Loan Programs",
      "title": "Ihsan Trust Loan",
      "content": "This program provides twenty need-based, interest-free loans. Applications for these loans can be made after receiving an admission offer from GIKI.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-aid-scholarships/"
    },
    {
      "section": "Provincial Scholarships",
      "title": "Sindh Scholarship",
      "content": "Five fully funded scholarships are available for students domiciled in Sindh, with an annual family income of less than Rs. 1,200,000. Applications for this scholarship can be submitted after joining GIKI.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-aid-scholarships/"
    },
    {
      "section": "Provincial Scholarships",
      "title": "CMEEF Scholarship for KP Students",
      "content": "The Chief Minister Educational Endowment Fund (CMEEF) offers four fully funded scholarships for KP-domiciled students, including ex-FATA residents, with an annual family income of less than Rs. 1,200,000. These scholarships are available specifically for students in the Faculty of Engineering Sciences with a specialization in photonics.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-aid-scholarships/"
    },
    {
      "section": "Provincial Scholarships",
      "title": "Balochistan Scholarship (BEEF)",
      "content": "Four fully funded scholarships are available for students domiciled in Balochistan. Applications for this scholarship can be submitted after joining GIKI.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-aid-scholarships/"
    },
    {
      "section": "Loan Programs",
      "title": "Habbah Scholarship Fund",
      "content": "This scholarship is designed to provide financial relief for students who require additional support to continue their studies at GIKI. Applications and eligibility criteria are outlined in the admissions portal.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/ugrad-aid-scholarships/"
    },
  {
      "section": "Application Procedure",
      "title": "Overview",
      "content": "The Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) offers a structured application process for prospective students aiming to join its esteemed programs. The application process is conducted online, ensuring accessibility and convenience for all applicants. :contentReference[oaicite:0]{index=0}",
      "url": "https://giki.edu.pk/how-to-apply"
    },
    {
      "section": "Undergraduate Admissions",
      "title": "Application Steps",
      "content": "1. **Online Application**: Visit the [GIKI Admissions Portal](https://admissions.giki.edu.pk/) to create an account or log in if you already have one.\n2. **Form Submission**: Complete the application form with accurate personal and academic information.\n3. **Photograph Upload**: Upload a recent color photograph as per the specified guidelines.\n4. **Scholarship Application**: Optionally, apply online for scholarships or financial assistance during the application process.\n5. **Processing Fee Payment**:\n   - **Print Bank Challan**: Available on the admissions portal.\n   - **Fee Details**: Rs. 3,000 for a single test and Rs. 4,500 for both tests; add Rs. 1,000 if applying for financial assistance.\n   - **Payment Methods**:\n     - **Method 1**: Pay the challan at any Habib Bank Limited (HBL) branch.\n     - **Method 2 (Online)**: Use the 1-Bill Top-Up option available through various banks, EasyPaisa, or ATMs.\n     - **Method 3**: Use HBL Mobile App or Internet Banking.\n   - **Payment Confirmation**: After payment, enter the paid bank challan details into your online profile.\n6. **Admit Card**: Download your Admit Card from the admissions portal.\n7. **Admission Test**: On the test day, bring the Admit Card, original Matric/O-Level Certificate, and the paid bank challan (GIK copy).\n8. **Result and Documentation**: Check your entry test results online through the admissions portal. If offered admission, send the required documents to the admission office as specified.",
      "url": "https://giki.edu.pk/how-to-apply"
    },
    {
      "section": "Graduate Admissions",
      "title": "Application Steps",
      "content": "1. **Online Application**: Access the [GIKI Admissions Portal](https://admissions.giki.edu.pk/) to fill out and submit the online application form.\n2. **Document Submission**: Provide attested copies of the following:\n   - SSC and HSSC Certificates and Detailed Marks Certificates (DMCs).\n   - Bachelor's and Master's Degrees and Transcripts.\n   - National Identity Card (CNIC) and Domicile.\n3. **Recommendation Letters**: Obtain two letters of recommendation from previous instructors or professionals familiar with your academic performance.\n4. **Statement of Purpose**: Write a statement outlining your research interests and career goals.\n5. **Research Proposal**: For PhD applicants, include a detailed research proposal.\n6. **Processing Fee Payment**:\n   - **Fee Details**: Rs. 5,000, payable via a bank challan at any HBL branch.\n   - **Payment Confirmation**: After payment, enter the paid bank challan details into your online profile.\n7. **Admission Test and Interview**:\n   - **Tests Accepted**:\n     - ETS GRE (General).\n     - HEC-ETC HAT Test.\n     - GIKI Admission Test (conducted at GIKI).\n   - **Interview**: Shortlisted candidates will be invited for an online interview via Zoom or Skype.",
      "url": "https://giki.edu.pk/how-to-apply"
    },
    {
      "section": "Payment Methods",
      "title": "Processing Fee Payment Options",
      "content": "- **Method 1**: Print and pay the challan at any HBL branch.\n- **Method 2 (Online)**: Use the 1-Bill Top-Up option available through various banks, EasyPaisa, or ATMs.\n   - **Steps**:\n     - Select '1 Bill Top-Up'.\n     - Enter the Challan No. as the unique bill/invoice/challan/consumer number.\n     - Input the total amount.\n     - Verify the payment details and confirm the transaction.\n- **Method 3**: Using HBL Mobile App or Internet Banking:\n   - Open the HBL App or Internet Banking portal.\n   - Click on 'Pay' or 'More'.\n   - Select 'Education'.\n   - Choose 'GIKI New Admission'.\n   - Fill in the required details (Admit Card number, Name, Guardian/Father's Name, Amount) and submit.\n- **Payment Confirmation**: After payment, enter the paid bank challan details into your online profile.",
      "url": "https://giki.edu.pk/how-to-apply"
    },
  {
      "section": "Graduate Admissions/Assistantship Schemes",
      "title": "Overview",
      "content": "The Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) offers a range of graduate assistantships across all disciplines. These assistantships are awarded based on merit, considering the candidate's performance in admission tests and interviews, academic credentials, and prior educational achievements. :contentReference[oaicite:0]{index=0}",
      "url": "https://giki.edu.pk/admissions/admissions-graduate/grad-aid-scholarships/"
    },
    {
      "section": "MS Degree Program (2 Years)",
      "title": "Graduate Assistantship Scheme (GA-1)",
      "content": "- **Benefits**:\n  - Full tuition fee waiver\n  - Monthly stipend of Rs. 20,000\n  - Free bachelor accommodation\n- **Eligibility Criteria**:\n  - HSSC (or equivalent): Minimum 60% marks\n  - BS (Engineering): Minimum CGPA of 2.70 or 70% marks",
      "url": "https://giki.edu.pk/admissions/admissions-graduate/grad-aid-scholarships/"
    },
    {
      "section": "MS Degree Program (2 Years)",
      "title": "Graduate Assistantship Scheme (GA-2)",
      "content": "- **Benefits**:\n  - Full tuition fee waiver\n  - Monthly stipend of Rs. 15,000\n- **Eligibility Criteria**:\n  - HSSC (or equivalent): Minimum 60% marks\n  - BS (Engineering): Minimum CGPA of 2.70 or 70% marks",
      "url": "https://giki.edu.pk/admissions/admissions-graduate/grad-aid-scholarships/"
    },
    {
      "section": "MS Degree Program (2 Years)",
      "title": "Graduate Assistantship Scheme (GA-3)",
      "content": "- **Benefits**:\n  - 50% tuition fee waiver\n  - Monthly stipend of Rs. 10,000\n- **Eligibility Criteria**:\n  - HSSC (or equivalent): Minimum 60% marks\n  - BS (Engineering): Minimum CGPA of 2.70 or 70% marks",
      "url": "https://giki.edu.pk/admissions/admissions-graduate/grad-aid-scholarships/"
    },
    {
      "section": "MS Degree Program (2 Years)",
      "title": "Graduate Assistantship Scheme (GA-4)",
      "content": "- **Benefits**:\n  - 50% tuition fee waiver\n- **Eligibility Criteria**:\n  - HSSC (or equivalent): Minimum 60% marks\n  - BS (Engineering): Minimum CGPA of 2.70 or 70% marks",
      "url": "https://giki.edu.pk/admissions/admissions-graduate/grad-aid-scholarships/"
    },
    {
      "section": "PhD Degree Program",
      "title": "Graduate Assistantship Scheme (GA-1)",
      "content": "- **Benefits**:\n  - Full tuition fee waiver\n  - Monthly stipend of Rs. 40,000\n  - Free bachelor accommodation\n- **Eligibility Criteria**:\n  - HSSC (or equivalent): Minimum 60% marks\n  - BS (Engineering): Minimum CGPA of 2.70 or 70% marks\n  - MS: Minimum CGPA of 3.00 or 75% marks",
      "url": "https://giki.edu.pk/admissions/admissions-graduate/grad-aid-scholarships/"
    },
    {
      "section": "PhD Degree Program",
      "title": "Graduate Assistantship Scheme (GA-2)",
      "content": "- **Benefits**:\n  - Full tuition fee waiver\n  - Monthly stipend of Rs. 35,000\n- **Eligibility Criteria**:\n  - HSSC (or equivalent): Minimum 60% marks\n  - BS (Engineering): Minimum CGPA of 2.70 or 70% marks\n  - MS: Minimum CGPA of 3.00 or 75% marks",
      "url": "https://giki.edu.pk/admissions/admissions-graduate/grad-aid-scholarships/"
    },
    {
      "section": "PhD Degree Program",
      "title": "Graduate Assistantship Scheme (GA-3)",
      "content": "- **Benefits**:\n  - 50% tuition fee waiver\n  - Monthly stipend of Rs. 30,000\n- **Eligibility Criteria**:\n  - HSSC (or equivalent): Minimum 60% marks\n  - BS (Engineering): Minimum CGPA of 2.70 or 70% marks\n  - MS: Minimum CGPA of 3.00 or 75% marks",
      "url": "https://giki.edu.pk/admissions/admissions-graduate/grad-aid-scholarships/"
    },
{
      "section": "Graduate Financial Assistance",
      "title": "Overview",
      "content": "The Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) offers various assistantships and financial aid programs for graduate students across all disciplines. These assistantships are awarded based on merit, taking into account the candidate's performance in admission tests and interviews, academic records, and previous educational achievements.",
      "url": "https://giki.edu.pk/admissions/admissions-graduate/grad-aid-scholarships/"
    },
    {
      "section": "MS Degree Program (2 Years)",
      "title": "Graduate Assistantship Scheme (GA-1)",
      "content": "Benefits include a full tuition fee waiver, a monthly stipend of Rs. 20,000, and free bachelor accommodation. Eligibility requires candidates to have a minimum of 60% marks in HSSC (or equivalent) and a minimum CGPA of 2.70 or 70% marks in BS (Engineering).",
      "url": "https://giki.edu.pk/admissions/admissions-graduate/grad-aid-scholarships/"
    },
    {
      "section": "MS Degree Program (2 Years)",
      "title": "Graduate Assistantship Scheme (GA-2)",
      "content": "This scheme offers a full tuition fee waiver and a monthly stipend of Rs. 15,000. To qualify, candidates must have a minimum of 60% marks in HSSC (or equivalent) and a minimum CGPA of 2.70 or 70% in BS (Engineering).",
      "url": "https://giki.edu.pk/admissions/admissions-graduate/grad-aid-scholarships/"
    },
    {
      "section": "MS Degree Program (2 Years)",
      "title": "Graduate Assistantship Scheme (GA-3)",
      "content": "The GA-3 scheme provides a 50% tuition fee waiver and a monthly stipend of Rs. 10,000. Eligibility criteria include a minimum of 60% marks in HSSC (or equivalent) and a minimum CGPA of 2.70 or 70% in BS (Engineering).",
      "url": "https://giki.edu.pk/admissions/admissions-graduate/grad-aid-scholarships/"
    },
    {
      "section": "MS Degree Program (2 Years)",
      "title": "Graduate Assistantship Scheme (GA-4)",
      "content": "This scheme offers a 50% tuition fee waiver. To qualify, candidates must have a minimum of 60% marks in HSSC (or equivalent) and a minimum CGPA of 2.70 or 70% in BS (Engineering).",
      "url": "https://giki.edu.pk/admissions/admissions-graduate/grad-aid-scholarships/"
    },
    {
      "section": "PhD Degree Program",
      "title": "Graduate Assistantship Scheme (GA-1)",
      "content": "For PhD students, the GA-1 scheme includes a full tuition fee waiver, a monthly stipend of Rs. 40,000, and free bachelor accommodation. Eligibility requires a minimum of 60% marks in HSSC (or equivalent), a minimum CGPA of 2.70 or 70% in BS (Engineering), and a minimum CGPA of 3.00 or 75% in MS.",
      "url": "https://giki.edu.pk/admissions/admissions-graduate/grad-aid-scholarships/"
    },
    {
      "section": "PhD Degree Program",
      "title": "Graduate Assistantship Scheme (GA-2)",
      "content": "This scheme provides a full tuition fee waiver and a monthly stipend of Rs. 35,000. Eligibility criteria include a minimum of 60% marks in HSSC (or equivalent), a minimum CGPA of 2.70 or 70% in BS (Engineering), and a minimum CGPA of 3.00 or 75% in MS.",
      "url": "https://giki.edu.pk/admissions/admissions-graduate/grad-aid-scholarships/"
    },
    {
      "section": "PhD Degree Program",
      "title": "Graduate Assistantship Scheme (GA-3)",
      "content": "The GA-3 scheme for PhD students offers a 50% tuition fee waiver and a monthly stipend of Rs. 30,000. Eligibility requires a minimum of 60% marks in HSSC (or equivalent), a minimum CGPA of 2.70 or 70% in BS (Engineering), and a minimum CGPA of 3.00 or 75% in MS.",
      "url": "https://giki.edu.pk/admissions/admissions-graduate/grad-aid-scholarships/"
    },
    {
      "section": "PhD Degree Program",
      "title": "Graduate Assistantship Scheme (GA-4)",
      "content": "The GA-4 scheme provides a 50% tuition fee waiver for PhD students. To qualify, candidates must have a minimum of 60% marks in HSSC (or equivalent), a minimum CGPA of 2.70 or 70% in BS (Engineering), and a minimum CGPA of 3.00 or 75% in MS.",
      "url": "https://giki.edu.pk/admissions/admissions-graduate/grad-aid-scholarships/"
    },
    {
      "section": "Eligibility Notes",
      "title": "General Eligibility Requirements",
      "content": "Applicants must meet specific academic and merit-based criteria for each graduate assistantship scheme. These include maintaining the required CGPA, passing the admission tests, and demonstrating academic potential through past achievements and interview performance.",
      "url": "https://giki.edu.pk/admissions/admissions-graduate/grad-aid-scholarships/"
    },
 {
      "section": "Overview",
      "title": "GIKI Alumni Association",
      "content": "The Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) Alumni Association is an independent, worldwide organization dedicated to fostering lifelong relationships among current and future GIKI alumni and the university. :contentReference[oaicite:0]{index=0}",
      "url": "https://gikialumni.org/"
    },
    {
      "section": "Mission and Vision",
      "title": "Core Objectives",
      "content": "The association aims to mobilize and energize the GIKI alumni network to create value for both the institute and its alumni. Core values include promoting an active and value-generating network, encouraging volunteerism and generosity, and upholding high ethical and professional standards. :contentReference[oaicite:1]{index=1}",
      "url": "https://gikialumni.org/vision-and-mission/"
    },
    {
      "section": "Leadership",
      "title": "Executive Council",
      "content": "The association is led by an Executive Council comprising dedicated alumni committed to serving the GIKI community. The current president, Barrister (Engr.) Habil Ahmed Khan, emphasizes the importance of giving back to GIKI and its alumni, reflecting on his formative years at the institute. :contentReference[oaicite:2]{index=2}",
      "url": "https://gikialumni.org/executive-council/"
    },
    {
      "section": "Global Presence",
      "title": "Alumni Network",
      "content": "With over 6,100 members spanning 26 batches across more than 70 countries, the GIKI Alumni Association boasts a vibrant and diverse community. Alumni are encouraged to join regional, departmental, or association-wide groups to foster connections and collaborations. :contentReference[oaicite:3]{index=3}",
      "url": "https://gikialumni.org/discover/"
    },
    {
      "section": "Giving Back",
      "title": "Financial Assistance Programs",
      "content": "The association offers various programs to support current students, including financial assistance, batch seat scholarships, and an endowment fund. These initiatives aim to provide deserving students with the opportunity to pursue quality education at GIKI. :contentReference[oaicite:4]{index=4}",
      "url": "https://gikialumni.org/scholarships/"
    },
    {
      "section": "Activities and Programs",
      "title": "Engagement Initiatives",
      "content": "The association organizes a range of activities and programs, including annual reports, vision and mission goal setting, and adherence to the GIKIAA Article of Association. These efforts are designed to keep alumni engaged and informed about the association's objectives and progress. :contentReference[oaicite:5]{index=5}",
      "url": "https://gikialumni.org/activities-programs/"
    },
    {
      "section": "Events",
      "title": "Alumni Reunions",
      "content": "The association hosts annual reunions, such as the 2022 event attended by over 400 alumni, including more than 150 CEOs, founders, directors, and managers of prominent tech companies worldwide. These gatherings celebrate the achievements and global impact of GIKI's talented alumni. :contentReference[oaicite:6]{index=6}",
      "url": "https://gikialumni.org/gikreunion2022/"
    },
    {
      "section": "Communication",
      "title": "Stay Connected",
      "content": "Alumni can stay updated through monthly newsletters containing global alumni updates. The association also maintains an active presence on social media platforms, including Facebook, LinkedIn, and YouTube, to facilitate communication and engagement. :contentReference[oaicite:7]{index=7}",
      "url": "https://gikialumni.org/"
    },
    {
      "section": "Merchandise",
      "title": "GIKIAA Shop",
      "content": "The association offers a range of merchandise through the GIKIAA Shop, allowing alumni to showcase their pride and support for the institute. Proceeds from merchandise sales contribute to various alumni initiatives and programs. :contentReference[oaicite:8]{index=8}",
      "url": "https://gikialumni.org/"
    },
    {
      "section": "Contact Information",
      "title": "Get in Touch",
      "content": "Alumni and interested parties can contact the association via the hotline at (+92) 311 044 – 5422 or through social media channels. The association encourages feedback and suggestions to better serve the GIKI community. :contentReference[oaicite:9]{index=9}",
      "url": "https://gikialumni.org/"
    },
 {
      "section": "Annual Report 2023",
      "title": "Comprehensive Overview",
      "content": "The Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) published its Annual Report for 2023 on May 10, 2024. This report provides an in-depth analysis of the institute's academic achievements, research advancements, and strategic initiatives undertaken throughout the year.",
      "url": "https://giki.edu.pk/2024/05/10/annual-report-2023/"
    },
    {
      "section": "Academic Achievements",
      "title": "Educational Excellence",
      "content": "The report highlights significant academic milestones, including curriculum enhancements, faculty accomplishments, and student successes. It underscores GIKI's commitment to providing quality education and fostering an environment conducive to learning and innovation.",
      "url": "https://giki.edu.pk/2024/05/10/annual-report-2023/"
    },
    {
      "section": "Research and Development",
      "title": "Innovative Research Initiatives",
      "content": "GIKI's dedication to research is evident through various projects and collaborations detailed in the report. It showcases advancements in engineering and technology, contributions to scientific knowledge, and partnerships with industry and academic institutions.",
      "url": "https://giki.edu.pk/2024/05/10/annual-report-2023/"
    },
    {
      "section": "Strategic Initiatives",
      "title": "Future-Oriented Projects",
      "content": "The report outlines strategic initiatives aimed at institutional growth, infrastructure development, and community engagement. These initiatives reflect GIKI's vision to remain at the forefront of engineering education and research.",
      "url": "https://giki.edu.pk/2024/05/10/annual-report-2023/"
    },
    {
      "section": "Financial Overview",
      "title": "Fiscal Responsibility",
      "content": "An overview of the institute's financial performance is provided, detailing revenue sources, expenditures, and financial planning. This section emphasizes GIKI's commitment to transparency and fiscal responsibility.",
      "url": "https://giki.edu.pk/2024/05/10/annual-report-2023/"
    },
  {
      "section": "How to Apply",
      "title": "Overview of Application Process",
      "content": "The Ghulam Ishaq Khan Institute (GIKI) provides a structured process for students applying for both undergraduate and graduate programs. Applicants need to submit their information via the online admissions portal, ensuring accuracy and completeness in their details.",
      "url": "https://giki.edu.pk/how-to-apply"
    },
    {
      "section": "Undergraduate Admissions",
      "title": "Application Steps",
      "content": "Prospective undergraduate students must create an account on the [GIKI Admissions Portal](https://admissions.giki.edu.pk/). The application form should be completed with personal and academic details, and a recent color photograph must be uploaded. A non-refundable processing fee of Rs. 3,000 for a single test or Rs. 4,500 for both tests must be paid at any HBL branch. Additional Rs. 1,000 applies if applying for financial assistance. The admit card for the admission test can be downloaded from the portal.",
      "url": "https://giki.edu.pk/how-to-apply"
    },
    {
      "section": "Graduate Admissions",
      "title": "Graduate Application Details",
      "content": "Graduate applicants must submit detailed academic and professional records through the online admissions form, which requires attested copies of all previous degrees and transcripts, a CNIC, and a statement of purpose. PhD applicants must also provide a research proposal. The application fee of Rs. 5,000 is payable at any HBL branch.",
      "url": "https://giki.edu.pk/how-to-apply"
    },
    {
      "section": "Admission Test Requirements",
      "title": "Test and Examination Details",
      "content": "Undergraduate students must take the GIKI Admission Test, which includes MCQs in Physics, Mathematics, and English. Graduate applicants must pass the GIKI Admission Test, ETS GRE (General), or HEC-ETC HAT Test. Shortlisted graduate candidates will participate in an online interview.",
      "url": "https://giki.edu.pk/how-to-apply"
    },
    {
      "section": "Payment Procedures",
      "title": "Fee Payment Methods",
      "content": "Payments can be made via printed bank challan at HBL branches or through online options like HBL Mobile App or 1-Bill Top-Up from various banking channels. Applicants must enter paid challan details in their profile for verification.",
      "url": "https://giki.edu.pk/how-to-apply"
    },
    {
      "section": "Required Documentation",
      "title": "Supporting Documents",
      "content": "Applicants need to provide attested copies of academic certificates, CNIC, domicile, and recommendation letters. Graduate applicants must submit a statement of purpose, while PhD candidates must include a research proposal.",
      "url": "https://giki.edu.pk/how-to-apply"
    },
    {
      "section": "Important Notes",
      "title": "Guidelines and Reminders",
      "content": "Ensure all submitted information is accurate. Retain copies of documents and payment receipts for records. Regularly check email and the portal for updates.",
      "url": "https://giki.edu.pk/how-to-apply"
    },
    {
      "section": "Admission Test Details",
      "title": "Admit Card and Test Day Requirements",
      "content": "Applicants must download the Admit Card and bring it, along with the original Matric/O-Level Certificate and the paid bank challan (GIKI copy), to the test venue. Graduate applicants must prepare for their interview, conducted via Zoom or Skype.",
      "url": "https://giki.edu.pk/how-to-apply"
    },
 {
      "section": "Campus Overview",
      "title": "Campus Life at GIKI",
      "content": "The Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) offers a vibrant campus life that balances academic rigor with extracurricular engagement. The institute provides state-of-the-art facilities, diverse student societies, and comprehensive support services to foster personal and professional growth.",
      "url": "https://giki.edu.pk/campus-life/"
    },
    {
      "section": "Buildings and Facilities",
      "title": "Infrastructure and Amenities",
      "content": "GIKI's campus features modern buildings designed to support various academic and extracurricular activities:\n- **Auditorium**: A central auditorium with a seating capacity of 535, hosting conferences, seminars, and cultural events. :contentReference[oaicite:0]{index=0}\n- **Administration Block**: Houses offices of the Rector, Pro-Rector (Academic), Dean (Student Affairs), and other administrative departments. :contentReference[oaicite:1]{index=1}\n- **Sports Complex**: Includes facilities for indoor and outdoor sports, such as badminton, squash, tennis, basketball, volleyball, football, cricket, a swimming pool, and a gymnasium. :contentReference[oaicite:2]{index=2}",
      "url": "https://giki.edu.pk/campus-life/buildings/"
    },
    {
      "section": "Student Societies",
      "title": "Extracurricular Engagement",
      "content": "GIKI hosts a variety of student societies that cater to diverse interests:\n- **Cultural Dramatics & Entertainment Society (CDES)**: Organizes musical concerts, drama competitions, and cultural trips. :contentReference[oaicite:3]{index=3}\n- **American Society of Mechanical Engineers (ASME) GIK Chapter**: Focuses on the professional development of mechanical engineering students. :contentReference[oaicite:4]{index=4}\n- **GIK Sports Society (GSS)**: Promotes physical fitness and organizes various sports events for both male and female students. :contentReference[oaicite:5]{index=5}",
      "url": "https://giki.edu.pk/campus-life/student-socities/"
    },
    {
      "section": "Sports and Recreation",
      "title": "Athletic Opportunities",
      "content": "GIKI encourages students to participate in sports through well-maintained facilities and organized leagues:\n- **Sports Leagues**: Structured leagues for cricket and football, with matches often held at night under floodlights to accommodate academic schedules. :contentReference[oaicite:6]{index=6}\n- **Facilities**: Courts and grounds for various sports, including tennis, basketball, volleyball, football, cricket, badminton, squash, a swimming pool, and a gymnasium. :contentReference[oaicite:7]{index=7}",
      "url": "https://giki.edu.pk/campus-life/sports/"
    },
    {
      "section": "Student Affairs",
      "title": "Support Services",
      "content": "The Student Affairs Office enhances the quality of student life by providing support in academic, personal, and emotional matters. Services include counseling, guidance, and assistance with hostel residence and student societies. :contentReference[oaicite:8]{index=8}",
      "url": "https://giki.edu.pk/academics/student-affairs/"
    },
    {
      "section": "Transportation",
      "title": "Campus Accessibility",
      "content": "GIKI offers transportation services for students and employees, including shuttle services to and from Peshawar and Islamabad on weekends. Parking is available 24 hours with round-the-clock security. :contentReference[oaicite:9]{index=9}",
      "url": "https://giki.edu.pk/campus-life/"
    },
  {
      "section": "Career Opportunities",
      "title": "Join GIK Institute",
      "content": "The Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) offers various career opportunities for qualified individuals. The institute regularly updates its career portal with job openings across different departments and faculties.",
      "url": "https://giki.edu.pk/careers/"
    },
    {
      "section": "Recent Job Postings",
      "title": "Current Openings",
      "content": "As of October 30, 2024, GIKI has announced job opportunities for positions such as Professor, Associate Professor, Assistant Professor, Lecturer, and Lab Engineer in fields including Artificial Intelligence, Data Science, Cyber Security, and Software Engineering. :contentReference[oaicite:0]{index=0}",
      "url": "https://giki.edu.pk/2024/10/30/job-opportunities-23/"
    },
    {
      "section": "Application Process",
      "title": "How to Apply",
      "content": "Interested candidates are encouraged to apply online through the GIKI careers portal. Applications should include a detailed CV, copies of academic credentials, and any other relevant documents. Incomplete applications will not be entertained. :contentReference[oaicite:1]{index=1}",
      "url": "https://giki.edu.pk/careers/"
    },
    {
      "section": "Selection Procedure",
      "title": "Interview Process",
      "content": "Only shortlisted applicants will be called for an interview. No TA/DA will be paid for the interviews. The selected candidates will become part of one of the Centers of Excellence in the country in the field of engineering sciences, technology, and management. :contentReference[oaicite:2]{index=2}",
      "url": "https://giki.edu.pk/careers/"
    },
    {
      "section": "Contact Information",
      "title": "HR Department",
      "content": "For further inquiries, candidates can contact the HR department at GIK Institute, Topi-23640, Swabi, Khyber Pakhtunkhwa. Phone: 0938-281026 Ext: 2442. :contentReference[oaicite:3]{index=3}",
      "url": "https://giki.edu.pk/careers/"
    },
  {
      "section": "General Contact Information",
      "title": "Main Contact Details",
      "content": "- **Address**: Ghulam Ishaq Khan Institute of Engineering Sciences and Technology, Topi 23460, Khyber Pakhtunkhwa, Pakistan.\n- **Phone**: +92 (0)938 281026\n- **Fax**: +92 (0)938 281032",
      "url": "https://giki.edu.pk/contact-us-main/"
    },
    {
      "section": "Admissions Office",
      "title": "Undergraduate and Graduate Admissions",
      "content": "- **Undergraduate Admissions**:\n  - **Email**: ugadmissions@giki.edu.pk\n  - **Phone**: +92 (0)938 281026 Ext: 2301, 2342, 2354\n  - **Fax**: +92 (0)938 281052\n- **Graduate Admissions**:\n  - **Email**: gadmissions@giki.edu.pk\n  - **Phone**: +92 (0)938 281026 Ext: 2450\n  - **Fax**: +92 (0)938 281004",
      "url": "https://giki.edu.pk/contact-us-main/"
    },
    {
      "section": "Academic Departments",
      "title": "Faculty Contact Information",
      "content": "- **Faculty of Computer Science and Engineering**:\n  - **Phone**: +92 (0)938 281026 Ext: 2400\n- **Faculty of Electrical Engineering**:\n  - **Phone**: +92 (0)938 281026 Ext: 2500\n- **Faculty of Mechanical Engineering**:\n  - **Phone**: +92 (0)938 281026 Ext: 2600\n- **Faculty of Materials Science and Chemical Engineering**:\n  - **Phone**: +92 (0)938 281026 Ext: 2700\n- **Faculty of Engineering Sciences**:\n  - **Phone**: +92 (0)938 281026 Ext: 2800\n- **Faculty of Management Sciences**:\n  - **Phone**: +92 (0)938 281026 Ext: 2900",
      "url": "https://giki.edu.pk/contact-us-main/"
    },
    {
      "section": "Administrative Departments",
      "title": "Key Administrative Contacts",
      "content": "- **Human Resources Department**:\n  - **Phone**: +92 (0)938 281026 Ext: 2442, 2642\n- **General Administration**:\n  - **Phone**: +92 (0)938 281026 Ext: 2330\n- **Admissions/Student Affairs Department**:\n  - **Phone**: +92 (0)938 281026 Ext: 2301\n- **Admissions and Examinations**:\n  - **Phone**: +92 (0)938 281026 Ext: 2205\n- **Transport Section**:\n  - **Phone**: +92 (0)938 281026 Ext: 2334, 2664\n- **GIKafe**:\n  - **Phone**: +92 (0)938 281026 Ext: 2620, 2494\n- **Medical Centre**:\n  - **Phone**: +92 (0)938 281026 Ext: 2434, 2634\n- **Library**:\n  - **Phone**: +92 (0)938 281026 Ext: 2261, 2457\n- **IT Helpdesk**:\n  - **Phone**: +92 (0)938 281026 Ext: 2010, 2110\n- **Fire Section**:\n  - **Phone**: +92 (0)938 281026 Ext: 2333\n- **Habib Bank Branch**:\n  - **Phone**: +92 (0)938 281026 Ext: 2357, 2658\n- **Sports Officer**:\n  - **Phone**: +92 (0)938 281026 Ext: 2328, 2631\n- **Exchange Operator (External callers)**:\n  - **Phone**: +92 (0)938 281026\n- **Complaint Office (Maintenance)**:\n  - **Phone**: +92 (0)938 281026 Ext: 2633, 2733\n- **Mail Section**:\n  - **Phone**: +92 (0)938 281026 Ext: 2303\n- **Main Gate**:\n  - **Phone**: +92 (0)938 281026 Ext: 2666, 2525",
      "url": "https://giki.edu.pk/contact-us-main/"
    },
 {
      "section": "Undergraduate Internship Program",
      "title": "Overview",
      "content": "The Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) mandates that all undergraduate students complete a minimum of 8 weeks of industrial training as part of their degree requirements. This program is designed to enhance students' professional development by providing practical industry experience during their summer break.",
      "url": "https://giki.edu.pk/internship/"
    },
    {
      "section": "Role of Partner Companies",
      "title": "Industry Collaboration",
      "content": "GIKI collaborates with various companies to offer internship opportunities that are crucial for students' professional growth. Organizations interested in participating in the Summer Internship Program, whether offering paid or unpaid positions, are encouraged to fill out the internship offer form available on the GIKI website.",
      "url": "https://giki.edu.pk/internship/"
    },
    {
      "section": "Application Process",
      "title": "How to Apply",
      "content": "Students seeking internship placements should consult the Career Services Office at GIKI. The office provides guidance on application procedures, resume building, and interview preparation to help students secure suitable internship positions.",
      "url": "https://giki.edu.pk/oric/career-services/"
    },
    {
      "section": "Contact Information",
      "title": "Career Services Office",
      "content": "For further details regarding internships, students and companies can contact the Career Services Office at GIKI. Contact information is available on the GIKI website under the Careers section.",
      "url": "https://giki.edu.pk/administration/career-office/"
    },
    {
      "section": "Industrial Open House and Careers Fair",
      "title": "Overview",
      "content": "The Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) annually hosts the Industrial Open House and Careers Fair. This event serves as a platform for graduating students to showcase their Final Year Projects, engage with industry professionals, and explore employment and internship opportunities.",
      "url": "https://giki.edu.pk/industrial-open-house-and-careers-fair/"
    },
    {
      "section": "Purpose and Objectives",
      "title": "Bridging Academia and Industry",
      "content": "The primary objectives of the Industrial Open House and Careers Fair are:\n- **Facilitating Interaction**: Providing a meeting place for senior students and prospective employers.\n- **Enhancing Collaboration**: Establishing an effective platform for industry-university interaction.\n- **Showcasing Academic Environment**: Offering industry representatives an opportunity to acquaint themselves with the academic environment provided to the students.",
      "url": "https://giki.edu.pk/industrial-open-house-and-careers-fair/"
    },
    {
      "section": "Event Highlights",
      "title": "Key Features",
      "content": "During the event, industry representatives:\n- **Project Evaluations**: Review and assess Final Year Projects presented by graduating students.\n- **Recruitment Activities**: Conduct interviews for job placements and internships.\n- **Presentations**: Deliver presentations to share industry insights and expectations.\n- **Networking**: Engage in one-on-one interactions with the student body to discuss potential collaborations and career opportunities.",
      "url": "https://giki.edu.pk/industrial-open-house-and-careers-fair/"
    },
    {
      "section": "Publications and Resources",
      "title": "Event Materials",
      "content": "In conjunction with the event, GIKI develops several publications, including:\n- **Graduate Directory**: A comprehensive list of the graduating batch.\n- **Final Year Projects Details**: Information on projects exhibited during the event.\n- **Labs and Research Facilities**: An overview of the technical and research facilities available at GIKI.\n- **Faculty Profiles**: Detailed profiles of faculty members, highlighting their expertise and research interests.",
      "url": "https://giki.edu.pk/industrial-open-house-and-careers-fair/"
    },
    {
      "section": "Participation and Sponsorship",
      "title": "Engaging with the Event",
      "content": "Companies interested in participating or sponsoring the Industrial Open House and Careers Fair can contact the Office of Research, Innovation, and Commercialization (ORIC) at GIKI for more information on registration and sponsorship packages.",
      "url": "https://giki.edu.pk/industrial-open-house-and-careers-fair/"
    },
    {
      "section": "Transcript Request Procedure",
      "title": "Steps to Obtain Official Transcripts",
      "content": "To request official transcripts from Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI), follow these steps:\n1. **Download and Complete the Transcript Request Form**: Obtain the form from the GIKI website, print it, and fill in the required details.\n2. **Financial Clearance**:\n   - **On-Campus Students**: Obtain clearance from Room No. G09, Finance Department.\n   - **Off-Campus Students**: The Admissions & Examinations (A&E) Department will arrange the necessary clearance.\n3. **Attach Proof of Payment**: Include proof of payment for the transcript fee with your request form.\n4. **Submit the Request**: Send the completed form and payment proof to the Office of Director Admissions & Examinations at GIKI.",
      "url": "https://giki.edu.pk/order-a-transcript/"
    },
    {
      "section": "Processing Time",
      "title": "Anticipated Duration for Transcript Processing",
      "content": "It is advised to submit the transcript request at least three days (72 hours) in advance to ensure timely processing.",
      "url": "https://giki.edu.pk/order-a-transcript/"
    },
    {
      "section": "Fee Structure",
      "title": "Transcript Fees and Additional Charges",
      "content": "- **First Copy**: Rs. 1,200 (US $10 for international requests).\n- **Additional Copies**: Rs. 700 (US $8 for international requests) per copy if ordered simultaneously. A maximum of three copies can be provided per order, with the name of the university or organization printed on each.\n- **International Courier Delivery**: An additional Rs. 2,300 (US $20) is required for international delivery by courier.",
      "url": "https://giki.edu.pk/order-a-transcript/"
    },
    {
      "section": "Payment Methods",
      "title": "Accepted Payment Options",
      "content": "Attach original proof of payment in any of the following formats:\n- **Cash Payment**: Receipt from the account office, Room No. G12, Administration Block.\n- **Online Payment in Pakistan Rupees**: Transfer to HBL A/C No. 19790000085901.\n- **Swift Transfer of US Dollars**: Transfer to HBL A/C No. 19790002044611, SWIFT Code HABB PKK AXXX.\n- **Bank Draft**: Draft in favor of G.I.K. Institute, drawable at HBL GIK Branch.",
      "url": "https://giki.edu.pk/order-a-transcript/"
    },
    {
      "section": "Mailing Instructions",
      "title": "Guidelines for Transcript Delivery",
      "content": "- **Domestic Delivery**: Transcripts are sent within Pakistan through registered mail at no extra charge.\n- **International Delivery**: For overseas delivery via courier, an additional payment of Rs. 2,300 (US $20) is required.\n- **Envelope Specifications**: Clearly mention the name of the graduate school and the total number of transcripts per envelope (e.g., '2' for two transcripts in one envelope, '1+1' for two transcripts in separate envelopes). Provide the complete address of the recipient institution or organization.",
      "url": "https://giki.edu.pk/order-a-transcript/"
    },
    {
      "section": "Contact Information",
      "title": "Office of Director Admissions & Examinations",
      "content": "For further assistance, contact:\n- **Address**: G05, Administration Building, G.I.K. Institute of Engineering Sciences and Technology, Topi 23640, District Swabi, Khyber Pakhtunkhwa, Pakistan.\n- **Phone**: +92-938-271858-61 Ext. 2205, 2425, 2518.\n- **Fax**: +92-938-272951.",
      "url": "https://giki.edu.pk/order-a-transcript/"
    },
   {
      "section": "General Information",
      "title": "Location and Contact",
      "content": "GIKI is located near Tarbela Dam in Khyber Pakhtunkhwa, approximately a 1.5-hour drive from Islamabad. For general inquiries, contact the Admissions Office at ugadmissions@giki.edu.pk or +92 (0)938 281026.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/faqs/"
    },
    {
      "section": "Application Process",
      "title": "Correcting Application Details",
      "content": "To correct your application details, log into your profile on the GIK Admission Portal and use the 'Contact Us' option. You can also email the corrections to ugadmissions@giki.edu.pk with relevant details.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/faqs/"
    },
    {
      "section": "Entry Test",
      "title": "Entry Test and Format",
      "content": "The GIKI entry test is required for all applicants, covering intermediate-level Physics, Mathematics, and English. Applicants should review the syllabus and pattern available on the GIKI website under the admissions section.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/faqs/"
    },
    {
      "section": "Eligibility Criteria",
      "title": "Minimum Requirements",
      "content": "Applicants need to have passed HSSC or equivalent with at least 60% in relevant subjects for engineering disciplines. International qualifications should be certified by the IBCC.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/faqs/"
    },
    {
      "section": "Transfer Admissions",
      "title": "Advanced Standing for Transfer Students",
      "content": "Students enrolled in relevant programs at other accredited universities can apply for transfer with a minimum of 15 transferable credits and a CGPA of 2.5/4.0. Admission is subject to available seats and passing the GIKI entry test or equivalent SAT-II score.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/faqs/"
    },
    {
      "section": "Financial Assistance",
      "title": "Scholarships and Aid",
      "content": "GIKI offers various financial aid and scholarships based on merit and need. Students are encouraged to apply for aid through the admissions portal. Specific details can be found in the financial assistance section of the GIKI website.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/faqs/"
    },
    {
      "section": "Important Links",
      "title": "Resources for Applicants",
      "content": "Essential resources include:\n- Complete Undergraduate Admissions Guide: [https://giki.edu.pk/bs-info](https://giki.edu.pk/bs-info)\n- Key Admissions Dates: [https://giki.edu.pk/dates](https://giki.edu.pk/dates)\n- Fee Details: [https://giki.edu.pk/fees](https://giki.edu.pk/fees)\n- Entry Test Syllabus: [https://giki.edu.pk/syllabus](https://giki.edu.pk/syllabus)\n- Scholarships Info: [https://giki.edu.pk/aid](https://giki.edu.pk/aid)\n- Application Portal: [https://giki.edu.pk/apply](https://giki.edu.pk/apply)",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/faqs/"
    },
    {
      "section": "Admissions Group",
      "title": "Join the Admissions Community",
      "content": "Applicants can join the GIKI Admissions Group to receive timely updates and guidance. Visit [https://giki.edu.pk/giki](https://giki.edu.pk/giki) for more information.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/faqs/"
    },
    {
      "section": "Technical Support",
      "title": "Portal and Submission Issues",
      "content": "For technical difficulties related to the admissions portal or document submission, contact the IT helpdesk at it.support@giki.edu.pk.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/faqs/"
    },
    {
      "section": "Campus Visits",
      "title": "Visiting GIKI Campus",
      "content": "Prospective students and parents can schedule campus visits through the Admissions Office. This provides an opportunity to experience GIKI's academic environment and facilities firsthand.",
      "url": "https://giki.edu.pk/admissions/admissions-undergraduates/faqs/"
    },
 {
      "section": "Information Technology Department",
      "title": "Overview",
      "content": "The Information Technology (IT) Department at Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) is dedicated to providing comprehensive technological resources to support the institute's vision of delivering high-quality education and fostering an excellent teaching and research environment.",
      "url": "https://giki.edu.pk/it/"
    },
    {
      "section": "Services Offered",
      "title": "IT Infrastructure and Support",
      "content": "The IT Department offers a range of services to facilitate teaching, learning, and research:\n- **Data Center**: GIKI maintains its own IT infrastructure through an on-campus Data Center, providing essential IT facilities to faculty, staff, students, and residents.\n- **Round-the-Clock Connectivity**: Ensures continuous access to digital resources and computing services across the fully residential campus.\n- **Digital Resources**: Provides access to various digital tools and platforms to enhance the educational experience.",
      "url": "https://giki.edu.pk/it/"
    },
    {
      "section": "IT Training Center",
      "title": "Skill Development Initiatives",
      "content": "In collaboration with the Ministry of Federal Education and Professional Training and the National Vocational and Technical Training Commission (NAVTTC), GIKI has established an IT Training Center in Islamabad. This initiative, part of the Prime Minister's High Impact Technology Initiative, aims to offer IT courses to unemployed youth, enhancing their employability and technical skills.",
      "url": "https://giki.edu.pk/2024/08/08/it-training-centre/"
    },
    {
      "section": "Contact Information",
      "title": "Reach Out to IT Support",
      "content": "For assistance or inquiries related to IT services, please contact the IT Department through the following channels:\n- **IT Helpdesk**: [gikhelpdesk.atlassian.net](https://gikhelpdesk.atlassian.net)\n- **Phone**: +92 (0)938 281026 Ext: 2010, 2110",
      "url": "https://giki.edu.pk/it/"
    },
   {
      "section": "Newsletter Overview",
      "title": "GIK Newsletter Spring 2022 Volume 45",
      "content": "The Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) released its Spring 2022 Newsletter, Volume 45, on September 6, 2022. This edition highlights the institute's achievements, events, and initiatives, showcasing GIKI's dedication to academic excellence and innovation.",
      "url": "https://giki.edu.pk/2022/09/06/gik-newsletter-spring-2022-volume-45/"
    },
    {
      "section": "Academic Achievements",
      "title": "Faculty and Student Accomplishments",
      "content": "The newsletter highlights significant academic accomplishments, including impactful faculty research publications and notable student projects that received recognition during the semester.",
      "url": "https://giki.edu.pk/2022/09/06/gik-newsletter-spring-2022-volume-45/"
    },
    {
      "section": "Events and Workshops",
      "title": "Conferences and Knowledge Sharing",
      "content": "This edition covers various seminars, workshops, and conferences organized by GIKI, showcasing the institute's commitment to knowledge dissemination and active engagement with the academic and professional community.",
      "url": "https://giki.edu.pk/2022/09/06/gik-newsletter-spring-2022-volume-45/"
    },
    {
      "section": "Student Activities",
      "title": "Campus Life and Extracurricular Engagement",
      "content": "The newsletter features reports on student-led initiatives, competitions, and extracurricular activities that contribute to the vibrant and dynamic campus life at GIKI.",
      "url": "https://giki.edu.pk/2022/09/06/gik-newsletter-spring-2022-volume-45/"
    },
    {
      "section": "Collaborations and Partnerships",
      "title": "New Academic and Industrial Collaborations",
      "content": "Details on new partnerships and collaborations with industry and academic institutions are included, highlighting GIKI's continuous efforts to expand educational and research opportunities for its students and faculty.",
      "url": "https://giki.edu.pk/2022/09/06/gik-newsletter-spring-2022-volume-45/"
    },
  {
      "section": "SDGIKI",
      "title": "Sustainability at GIK Institute",
      "content": "The Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) is committed to promoting sustainability through its SDGIKI initiative. This program aligns with the United Nations Sustainable Development Goals (SDGs) to achieve a better and more sustainable future for all.",
      "url": "https://giki.edu.pk/sdgiki"
    },
    {
      "section": "Introduction",
      "title": "Understanding Sustainable Development",
      "content": "Sustainable development is defined as development that meets the needs of the present without compromising the ability of future generations to meet their own needs. GIKI embraces this concept by integrating sustainability into its academic and operational frameworks.",
      "url": "https://giki.edu.pk/sdgiki"
    },
    {
      "section": "Research and Publications",
      "title": "Advancing Knowledge",
      "content": "GIKI actively engages in research that contributes to sustainability. The institute publishes findings and reports that address various aspects of sustainable development, fostering a culture of knowledge sharing and innovation.",
      "url": "https://giki.edu.pk/sdgiki"
    },
    {
      "section": "Sustainability Reports",
      "title": "Transparency and Accountability",
      "content": "The institute regularly publishes sustainability reports detailing its progress and initiatives related to the SDGs. These reports provide insights into GIKI's efforts to promote environmental stewardship, social responsibility, and economic viability.",
      "url": "https://giki.edu.pk/sdgiki"
    },
    {
      "section": "Facilities",
      "title": "Infrastructure Supporting Sustainability",
      "content": "GIKI has developed facilities that support sustainable practices, including energy-efficient buildings, waste management systems, and green spaces. These facilities serve as practical examples of the institute's commitment to sustainability.",
      "url": "https://giki.edu.pk/sdgiki"
    },
    {
      "section": "Societies at GIK",
      "title": "Student Engagement",
      "content": "Various student societies at GIKI are dedicated to promoting sustainability through projects, events, and awareness campaigns. These societies play a crucial role in fostering a culture of environmental consciousness within the campus community.",
      "url": "https://giki.edu.pk/sdgiki"
    },
    {
      "section": "Collaboration",
      "title": "Partnerships for Sustainable Development",
      "content": "GIKI collaborates with national and international organizations to advance sustainability initiatives. These partnerships enhance the institute's capacity to address complex sustainability challenges through shared knowledge and resources.",
      "url": "https://giki.edu.pk/sdgiki"
    },
    {
      "section": "Policies",
      "title": "Guiding Principles",
      "content": "The institute has established policies that guide its sustainability efforts, ensuring that all activities and operations align with the principles of sustainable development. These policies cover areas such as energy use, waste management, and community engagement.",
      "url": "https://giki.edu.pk/sdgiki"
    },
  {
      "section": "Student Societies",
      "title": "Overview",
      "content": "Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) offers a vibrant campus life enriched by various student societies. These societies provide platforms for students to engage in extracurricular activities, develop leadership skills, and pursue interests beyond academics.",
      "url": "https://giki.edu.pk/campus-life/student-socities/"
    },
    {
      "section": "Technical Societies",
      "title": "Professional Development",
      "content": "GIKI hosts several technical societies affiliated with international organizations, aiming to advance students' knowledge and skills in specific engineering and scientific fields.",
      "subsections": [
        {
          "title": "ACM – Association for Computing Machinery",
          "content": "The ACM student chapter at GIKI is involved in activities ranging from arranging student workshops, special courses, and introductory seminars to holding software and computer game competitions."
        },
        {
          "title": "AIAA – American Institute of Aeronautics and Astronautics",
          "content": "Formerly known as the GIK Aerotech Club, AIAA provides a platform for aerospace enthusiasts, conducting various events, seminars, and workshops each semester. The society also maintains a fleet of radio-controlled aircraft for technical and recreational purposes."
        },
        {
          "title": "ASHRAE – American Society of Heating, Refrigerating and Air Conditioning Engineers",
          "content": "The GIKI chapter of ASHRAE organizes conferences, workshops, and seminars on careers in HVAC, aiming to attract students to the field by exposing them to industry opportunities."
        },
        {
          "title": "ASME – American Society of Mechanical Engineers",
          "content": "GIKI's ASME student chapter focuses on the professional development of students, equipping them to meet modern engineering challenges. Members receive monthly magazines and newsletters published by ASME International."
        },
        {
          "title": "ASM/TMS – American Society for Materials/The Minerals, Metals & Materials Society",
          "content": "The ASM/TMS society at GIKI is a student-run organization registered with the international forum of materials engineering, promoting advancements in the field."
        }
      ],
      "url": "https://giki.edu.pk/campus-life/student-socities/"
    },
    {
      "section": "Cultural and Arts Societies",
      "title": "Promoting Arts and Culture",
      "content": "These societies aim to foster cultural awareness and artistic expression among students.",
      "subsections": [
        {
          "title": "CDES – Cultural, Dramatic & Entertainment Society",
          "content": "As one of the oldest and most prestigious student societies at GIKI, CDES provides a platform for youth to discover and utilize their talents in practical life, promoting cultures, bridging social and ethnic gaps, and creating awareness about intricate issues."
        },
        {
          "title": "Naqsh – Art Society",
          "content": "Naqsh Art Society has been promoting both fine and performing arts for over a decade, hosting events like Color Festival, Mimes, Art Night, and the All Pakistan Arts & Fashion Festival, providing a platform for art lovers to pursue their passions."
        }
      ],
      "url": "https://giki.edu.pk/campus-life/student-socities/"
    },
    {
      "section": "Literary and Debating Societies",
      "title": "Enhancing Communication Skills",
      "content": "These societies focus on developing students' literary talents and public speaking abilities.",
      "subsections": [
        {
          "title": "LDS – Literary and Debating Society",
          "content": "LDS organizes events such as the All-Pakistan British Parliamentary Debating Tournament, providing a platform for students to engage in intellectual discourse and enhance their debating skills."
        }
      ],
      "url": "https://giki.edu.pk/campus-life/student-socities/"
    },
    {
      "section": "Sports and Adventure Societies",
      "title": "Promoting Physical Activities",
      "content": "These societies encourage students to participate in sports and adventure activities, promoting a healthy lifestyle.",
      "subsections": [
        {
          "title": "GSS – GIK Sports Society",
          "content": "GSS organizes various sports events and maintains teams for cricket, hockey, badminton, and other sports, fostering a spirit of teamwork and competition among students."
        },
        {
          "title": "Adventure Club",
          "content": "The Adventure Club offers activities like sailing, hiking, and adventure trips, providing students with opportunities to explore and appreciate nature."
        }
      ],
      "url": "https://giki.edu.pk/campus-life/student-socities/"
    },
    {
      "section": "Science and Technology Societies",
      "title": "Fostering Scientific Inquiry",
      "content": "These societies aim to promote scientific knowledge and innovation among students.",
      "subsections": [
        {
          "title": "Science Society",
          "content": "The Science Society organizes events like Science Day, encouraging students to engage in scientific exploration and research beyond the formal curriculum."
        },
        {
          "title": "SPIE – Society for Photo-optical Instrumentation Engineers",
          "content": "SPIE focuses on the advancement of light-based technologies, providing a platform for students interested in optics and photonics."
        }
      ],
      "url": "https://giki.edu.pk/campus-life/student-socities/"
    },
    {
      "section": "Media and Publication Societies",
      "title": "Encouraging Creative Expression",
      "content": "These societies provide platforms for students to express their creativity through various media.",
      "subsections": [
        {
          "title": "Media Club",
          "content": "The Media Club engages in activities like movie making, photography, desktop publishing, and event coverage, allowing students to explore and develop their media skills."
        },
        {
          "title": "Horizon – GIK Student Publication Society",
          "content": "Horizon publishes the annual Horizon Magazine, providing students with an outlet for literary and journalistic expression."
        }
      ],
      "url": "https://giki.edu.pk/campus-life/student-socities/"
    },
    {
      "section": "Environmental and Social Societies",
      "title": "Promoting Social Responsibility",
      "content": "These societies focus on environmental awareness and social causes.",
      "subsections": [
        {
          "title": "GEAS – GIKI Environment and Sustainability Society",
          "content": "GEAS works to raise awareness about environmental issues and sustainability practices through initiatives and workshops."
        },
        {
          "title": "Community Service Society (CSS)",
          "content": "CSS focuses on community outreach and social welfare projects, encouraging students to give back to society through volunteer work."
        }
      ],
      "url": "https://giki.edu.pk/campus-life/student-socities/"
    },
   {
      "section": "Overview",
      "title": "Society for the Promotion of Engineering Sciences and Technology (SOPREST)",
      "content": "The Society for the Promotion of Engineering Sciences and Technology (SOPREST) is the parent body of the Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI). Established in 1988, SOPREST was founded to advance engineering sciences and technology education in Pakistan. :contentReference[oaicite:0]{index=0}",
      "url": "https://giki.edu.pk/soprest/"
    },
    {
      "section": "Founding and Leadership",
      "title": "Establishment and Leadership",
      "content": "SOPREST was registered in 1988, with Ghulam Ishaq Khan, then President of Pakistan, elected as its president for life. Mr. H. U. Beg was appointed as the honorary executive director. The institute's ordinance was promulgated by the Khyber-Pakhtunkhwa Government in March 1993, leading to the induction of the first batch of students in October 1993. :contentReference[oaicite:1]{index=1}",
      "url": "https://giki.edu.pk/soprest/"
    },
    {
      "section": "Board of Governors",
      "title": "Governance Structure",
      "content": "The Board of Governors sits at the apex of the statutory pyramid of the Institute, with its composition mirroring that of the General Council of SOPREST. This structure ensures cohesive governance and strategic direction for both SOPREST and GIKI. :contentReference[oaicite:2]{index=2}",
      "url": "https://giki.edu.pk/soprest/"
    },
    {
      "section": "Recent Activities",
      "title": "Engagements and Initiatives",
      "content": "In December 2022, Mr. Salim Saifullah Khan, Acting President of SOPREST, and Mr. Shakil Durrani, Executive Director of SOPREST, visited GIKI. They held meetings with the Rector, Pro-Rectors, Deans, and Directors to discuss the institute's progress and future plans. :contentReference[oaicite:3]{index=3}",
      "url": "https://giki.edu.pk/2022/12/22/mr-salim-saifullah-khan-acting-president-soprest-and-mr-shakil-durrani-executive-director-soprest-visit-gik-and-hold-meeting-with-the-rector-pro-rectors-deans-and-directors/"
    },
    {
      "section": "Leadership Messages",
      "title": "President's Message",
      "content": "Engr. Salim Saifullah Khan, President of SOPREST, emphasizes the institute's commitment to excellence in education and research. He highlights GIKI's leading position in various engineering fields and its expansion into new and innovative areas at the forefront of technological research and development. :contentReference[oaicite:4]{index=4}",
      "url": "https://giki.edu.pk/presidents-message/"
    },
 {
      "section": "IT Training Program Islamabad",
      "title": "Overview",
      "content": "The Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI), in collaboration with the Ministry of Federal Education and Professional Training and the National Vocational and Technical Training Commission (NAVTTC), has initiated a six-month IT Training Program in Islamabad. This initiative is part of the Prime Minister's High Impact Technology Initiative, aiming to equip unemployed youth with advanced IT skills.",
      "url": "https://giki.edu.pk/it-trainingprogram-isb/"
    },
    {
      "section": "Program Details",
      "title": "Course Focus Areas",
      "content": "The training program focuses on cutting-edge IT domains, including:\n- Artificial Intelligence (AI)\n- Data Science\n- Blockchain Technology\nThese areas are selected to enhance participants' employability in the rapidly evolving tech industry.",
      "url": "https://giki.edu.pk/it-trainingprogram-isb/"
    },
    {
      "section": "Eligibility Criteria",
      "title": "Who Can Apply",
      "content": "Prospective candidates should meet the following criteria:\n- Possess a bachelor's degree in Computer Science, IT, Engineering, MBA, or other sciences with a basic understanding of computer programming.\n- Students who have completed two years (four semesters) of a bachelor's degree program in the aforementioned fields are also eligible.",
      "url": "https://giki.edu.pk/it-trainingprogram-isb/"
    },
    {
      "section": "Entrance Test",
      "title": "Assessment Process",
      "content": "Applicants are required to undergo a one-hour aptitude test comprising multiple-choice questions. The test evaluates:\n- Basic computer science knowledge\n- Analytical skills\n- Communication skills\nSuccessful candidates will be invited for interviews for final selection.",
      "url": "https://giki.edu.pk/it-trainingprogram-isb/"
    },
    {
      "section": "Training Venue",
      "title": "Location",
      "content": "The training sessions are conducted at the Islamabad Model College for Girls, F-7/4 (Margalla Campus), Islamabad. This location provides a conducive learning environment equipped with necessary facilities.",
      "url": "https://giki.edu.pk/it-trainingprogram-isb/"
    },
    {
      "section": "Application Process",
      "title": "How to Apply",
      "content": "Interested individuals are encouraged to apply through the official GIKI website. Detailed information regarding application deadlines, required documents, and other pertinent details are available on the program's webpage.",
      "url": "https://giki.edu.pk/it-trainingprogram-isb/"
    },
    {
      "section": "Contact Information",
      "title": "Inquiries",
      "content": "For further information or queries, applicants can contact the program coordinators via the contact details provided on the official GIKI website.",
      "url": "https://giki.edu.pk/it-trainingprogram-isb/"
    },
 {
      "section": "Tenders & Notices",
      "title": "Overview",
      "content": "The Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) regularly publishes tenders and notices for various procurement and project requirements. These announcements are aimed at inviting qualified vendors and contractors to participate in the institute's procurement processes.",
      "url": "https://giki.edu.pk/tenders-notices/"
    },
    {
      "section": "Recent Tenders",
      "title": "Latest Announcements",
      "content": "- **Request for Quotation for Printer (GIKI/PD/RFQ-32/2024-2025)**: Published on November 12, 2024.\n- **Tender Notice for Supply, Installation, Configuration, and Commissioning of All-in-One Desktop PC (GIKI/PD/SMGS-1049/24)**: Published on November 12, 2024.\n- **Purchase of Plumbing Items for Day-to-Day Maintenance**: Published on November 12, 2024.\n- **Tender Notice for Supply of IT Supplies (GIKI/PD/FES-1049/24)**: Published on November 12, 2024.\n- **Request for Quotation (GIKI/PD/RFQ-31/2024-2025)**: Published on November 11, 2024.\n- **Tender Notice for Supply and Fixation of Tyres**: Published on November 9, 2024.\n- **Request for Quotation for Steel Waiting Chairs**: Published on November 7, 2024.\n- **Tender Notice No. GIKI/WD/516**: Published on November 6, 2024.\n- **Tender Notice**: Published on November 6, 2024.",
      "url": "https://giki.edu.pk/tenders-notices/"
    },
    {
      "section": "Submission Guidelines",
      "title": "How to Participate",
      "content": "Interested parties are advised to visit the official GIKI website to access detailed tender documents and submission guidelines. Each tender notice includes specific instructions regarding eligibility criteria, submission deadlines, and required documentation.",
      "url": "https://giki.edu.pk/tenders-notices/"
    },
    {
      "section": "Contact Information",
      "title": "Inquiries",
      "content": "For further information or clarification regarding tenders and notices, please contact the Procurement Department at GIKI.",
      "url": "https://giki.edu.pk/tenders-notices/"
    },
 {
      "section": "Vision",
      "title": "GIKI Vision",
      "content": "GIKI aims to be a leading institution in the field of engineering, sciences, and technology education with a focus on excellence and innovation...",
      "url": "https://giki.edu.pk/vision-and-mission/"
    },
    {
      "section": "Mission",
      "title": "GIKI Mission",
      "content": "GIKI’s mission is to educate and train individuals to contribute to society through cutting-edge technological knowledge, leadership, and ethical practices...",
      "url": "https://giki.edu.pk/vision-and-mission/"
    }
  ]
}
