[
    {
        "heading": "NOTICE TO STUDENTS:",
        "content": "Congratulations on your well-deserved entry to the GIK Institute, where the aim is to pursue the  highest standards in education and research. The educational philosophy of the Institute emphasizes  the training of mind rather than stuffing it with an inert body of facts and on expanding the scientific  imagination rather than making them tread the well-worn and outmoded grooves of thought. Guided  by such convictions, students are educated by confronting them with real-life problems and  inculcating in them a problem-solving approach. You are encouraged to explore, to solve problems,  to break new grounds and to develop leadership qualities.  This Handbook is a very important document. Students are advised to read it very carefully and keep  it with them for the entire duration of their study in this Institute. The rules and regulations are subject  to change any time and in that case, students will be notified accordingly.  This Handbook addresses expectations concerning student conduct and performance and provides  information on the various student support systems available on the campus. A careful study of this  will help you in settling down and will provide you with the essential guidelines needed to  successfully pursue your studies at this Institute.  It is understood that your sole purpose of coming here is to acquire knowledge. You will find that  faculty and staff of the Institute are fully committed to helping you achieve your cherished goal.  Excellence in academics and upholding of the valued traditions of its heritage and culture are the  hallmarks of the policy followed by the Institute. Some important information, which is of direct  concern to the students, has been collected in this Handbook."
    },
    {
        "heading": "2",
        "content": "Accommodation:   Single room will be only allotted to the senior students on its availability and merit set by the  Department of Student Affairs. You are expected to meet the hostel warden who will help you in  solving all your hostel-related problems. You are not permitted to change or swap the allotted room  on your own. Please check the room thoroughly and record deficiency/discrepancy or breakage, if  any. You will find the rules about the hostel and the mess later in this handbook.   Tuition Fee:   GIK Institute collects a fee on a semester basis. 5% of semester tuition fee will be collected as  administrative charges against each semester. No administrative charges will be charged if students  pay the entire fee for two semesters in a lump sum. Tuition fee may be payable before the  commencement of academic session, failing which students are NOT allowed to register for the  courses. As per Institute policy, students can apply for Financial Assistance under “Changed  Circumstances” policy. However, grant of Financial Assistance would be subject to the availability  of budget. Fine of Rs. 50 per day will be charged on delayed payment.   Discipline:   The co-education system practiced at the Institute, places a heavy responsibility on the Institute  management and the students alike. The students are, therefore, expected to follow a code of conduct  that is in line with our culture, tradition, and values, particularly concerning ethics and moral  behaviour. Very serious view is taken of misconduct and immoral behaviour both inside and  outside the classrooms."
    },
    {
        "heading": "3",
        "content": "The Institute is fully residential, and the students are expected to realize that the interaction amongst  students and various faculty members and staff is much more than usual. It demands extra care on  part of the students while going about their daily routine.  Each faculty member, hostel wardens, library staff and management staff have certain authority to  impose the discipline. For serious matters, there is a STUDENT DISCIPLINARY COMMITTEE  consisting of senior faculty members which deals with all cases of indiscipline brought to its notice.  Counselling: The Dean Student Affairs and staff of Student Affairs Department are readily available  for sorting out your problems whether personal, social, or academic. In times of need, which may be  rather frequent, you must seek his advice. A student wellness counselor is also available for the  students in the Department of Student Affairs. The entire Department of Student Affairs acts as a  friend and guide to you."
    },
    {
        "heading": "2.1. Performance Evaluation: Institute follows the semester system in which continuous",
        "content": "evaluation and assessment of a student’s performance is carried out. It is earnestly desired that  you do well in your studies and remain well above the GPA of 2.00, as a GPA less than this  will put you on probation. If a probationer is unable to improve his GPA, he/she may not be  allowed to continue his/her studies in the Institute. To help a student avoid this unpleasant  situation the following measures are taken during the first year of studies:"
    },
    {
        "heading": "2.1.1 Results of quizzes and mid-terms will be closely monitored, and if found unsatisfactory,",
        "content": "a warning letter will be issued."
    },
    {
        "heading": "2.1.2 Tutorials will be arranged for students who receive such warnings and need extra",
        "content": "coaching."
    },
    {
        "heading": "2.1.3 If despite these measures the performance of a student remains unsatisfactory and he/she",
        "content": "does not show satisfactory results in the final exam, he/she will be issued another warning  letter."
    },
    {
        "heading": "2.2.1 Although the main emphasis is on academics, the Institute considers the participation of",
        "content": "students in games and other co-curricular activities equally important. Besides  professional clubs, which each faculty supports, there are many other different clubs and  societies, which you can join depending upon your interests and time you can spare. The"
    },
    {
        "heading": "5",
        "content": "students, therefore, have opportunities and communications/managerial skills to pursue  their hobbies and groom their personalities, while pursuing their academic programs."
    },
    {
        "heading": "2.2.2 The Institute, besides having a separate Gymnasium for boys and girls, offers a variety of",
        "content": "indoor and outdoor sports. There is a qualified Sports Officer who plans and co-ordinate  all such activities and maintain these facilities. For each game, there are certain laid down  instructions, which must be followed. For details, please consult the Sports Officer."
    },
    {
        "heading": "2.2.3 For efficient organization of various clubs/ societies, there is a coordinator/president,",
        "content": "usually a senior student and a society advisor. The activities of all the clubs/ societies are  co-coordinated by Dean Student Affairs. Each club/ society plans different activities,  which are usually well-publicized. You can find out more from the Department of Student  Affairs."
    },
    {
        "heading": "2.3.",
        "content": "Medical Facilities"
    },
    {
        "heading": "2.3.1 A 10-bed hospital equipped with modern facilities is available on the campus. Qualified",
        "content": "doctors supported by paramedical staff along with reasonable facilities for diagnosis and  treatment for normal ailments are available round the clock."
    },
    {
        "heading": "2.3.2. In case of need, the students are encouraged to seek professional help. For emergencies,",
        "content": "you may also avail the services of an ambulance by calling 'Duty Nurse' and asking for  the same."
    },
    {
        "heading": "2.3.3. It is students’ prerogative to get treatment from wherever they like but they are strongly",
        "content": "advised, in their interest, not to resort to self-medication. Similarly, it will be wise on"
    },
    {
        "heading": "6",
        "content": "their part to consult our doctors even if they get the prescription from outside the  Institute."
    },
    {
        "heading": "2.4.",
        "content": "Banking Facilities    There is a branch of Habib Bank at the campus, which offers the usual banking facilities  including foreign currency accounts/ATM. You are advised to open a bank account and  deposit your money in it. It is advisable not to keep large amounts of cash with you or in the  hostel rooms."
    },
    {
        "heading": "2.5.",
        "content": "Transport Facilities   Transport arrangements for the students and the staff to Rawalpindi, Islamabad and Peshawar  on weekends and holidays have been made. It leaves the Institute on Fridays in the evening  after the classes and returns on Sundays. The timings are notified by the Department of  Facilitation through a notice. This facility is available on payment of normal fare and to ensure  a seat, the tickets may be purchased from Transport Office in advance."
    },
    {
        "heading": "2.6.",
        "content": "Telephone Facilities  Each hostel has been provided with telephones by the exchange for the incoming calls in the  reception of the hostel. Some important telephone numbers (Ext.) that you may need are  available on the GIK Webpage."
    },
    {
        "heading": "2.7.",
        "content": "Other Facilities  For the convenience of the students, facilities like service center, souvenir shop,  fax/photocopying center, general stores, barbershop, laundry shop, cafeteria, barbecue  centers, vegetable shop, coffee/tea/juice corners and a stationary store are available on the"
    },
    {
        "heading": "7",
        "content": "campus. You may be able to get some of the books from the library, all inquiries regarding  books/Library may be referred to the Assistant Director Library."
    },
    {
        "heading": "3.1.",
        "content": "Introduction: This section provides a quick reference to the guidelines and procedures with  regard to the recurring academic activities such as advisory system, teaching system, registration  of courses, class rosters, examinations, grades, graduation etc for the students pursuing a  Bachelor's degree program of the Institute. Any exception to the normal guidelines needs a  recommendation from the Academic Council."
    },
    {
        "heading": "3.2.",
        "content": "Academic Calendar   An academic year at the Institute is divided into two semesters (Fall & Spring) of sixteen weeks  each and an eight-week summer school. The last week of a semester is allocated to the final  examinations. Normally, there is a one-week break in the middle of a regular semester. At the  start of each calendar year, a calendar of all the academic activities is issued by Director  Admissions & Examinations. Students must arrange their travels and other activities according  to the calendar to avoid any inconvenience. The semester timings are as follows:   Fall:   August to December  Spring:  January to May  Summer:  June to July"
    },
    {
        "heading": "3.3",
        "content": "Duration of Studies   Students have to complete their entire Bachelor’s degree program within the following time  limits:   Normal Duration:   04 years  Maximum Duration:  06 years"
    },
    {
        "heading": "3.4",
        "content": "Interruption of Studies  In case a student interrupts his/her study program at the Institute for a period longer than one  semester, his/her courses are evaluated by the concerned Dean to determine their relevance to  the changes made in the curriculum, if any, upon his/her return. In such a case, the student may  be required to modify the degree plan in order to ensure conformity to the recent curriculum."
    },
    {
        "heading": "3.5.",
        "content": "Academic Advisors   Each student is assigned an academic advisor who holds regular meetings, both formal and  informal, with the advisee. Before the start of a semester, each Faculty sends a list of advisors  with the advisee to Examination Section. This list does not include the first semester students.  Usually, the advisor for the first semester is the Dean of the concerned Faculty. The advisor  prepares the degree plan for his/her advisee and has a periodic audit of the student’s progress.  The Advisor maintains record files of his/her advisees containing his/her semester-wise progress  reports, courses completed, a list of courses to be completed, a record of co-curricular activities  and any other information that he/she deems relevant. Students are advised to consult their  Academic Advisor before registering courses in each semester. Each advisor has online access to  following information:   • A list of advisees   • Final result report of his/her advisees   • A recent copy of the Institute’ Prospectus   While signing the course registration form of a student, the advisor certifies that the courses  recommended by him/her are in accordance with the advisee degree plan, the prerequisite(s) are"
    },
    {
        "heading": "10",
        "content": "fulfilled, the course numbers, titles and the credit hours assigned are correct and according to  allowed limit. In case of registration at the beginning of the semester, or in case of endorsing  online ADD/DROP Form, the advisor ensures that the add course(s) can be taken by his advisee  without any alteration in the timetable."
    },
    {
        "heading": "3.6.",
        "content": "Credit System  The intensity/frequency of every course offered at the Institute is referred to in terms of credit  hours. A credit hour is Institute way of measuring work towards a degree. The credit hours  assigned to a theory course or a laboratory course are determined by the class hours allocated to  it per week throughout the semester. For a theory course, one credit hour is equivalent to one  class hour of lecture per week, and for a laboratory course, one credit hour is equal to three class  hours of practical work. A student is normally expected to put in 3 hours of work outside class  room for each credit hour of theory course and one hour of work outside laboratory course.  Similarly, a student is likely to spend 4 hours per week on independently conducted final year  project. No credits are assigned to the tutorial classes meant to help students understand the  subject covered during the class."
    },
    {
        "heading": "3.7.",
        "content": "Degree Requirements   To earn a bachelor degree in engineering from the Institute, a student must successfully complete"
    },
    {
        "heading": "135/136 credit hours of course work including six credit hours of the senior design project and",
        "content": "a summer internship (non-credit). These courses are grouped into General Education, Core  Courses, Specialization/Technical Electives, Management Electives, Inter-Faculty Electives and  Senior Year Design Project. The distribution varies from Faculty to Faculty but remains in line  with the Pakistan Engineering Council requirements. In order to obtain the exact degree plan,  for a particular Faculty, undergraduate Prospectus should be consulted."
    },
    {
        "heading": "3.7.1 Foundational Courses",
        "content": "Courses in chemistry, mathematics, physics and introductory engineering are common for  all students. The aim of these courses is to provide a thorough ground in the basic  principles and analytical skills needed for studies in specialized areas of engineering.  Relevant faculties offer these courses during the first year of the undergraduate program."
    },
    {
        "heading": "3.7.2. Management & Humanities Courses",
        "content": "Common courses in English language, Islamic and Pakistan studies, social sciences and  management are required for all students. They are meant to inculcate in the students an  awareness of our history & culture, to help them cultivate aesthetic and moral dimensions  of their personalities, and to equip them with communicational and managerial skills."
    },
    {
        "heading": "3.7.3 Faculty Courses",
        "content": "Students are required to take a number of core and elective courses of their own faculty.  A list of these courses is available from Dean's office and from the Prospectus of the  Institute."
    },
    {
        "heading": "3.7.4 Inter-Faculty Electives",
        "content": "Students are required to select some basic courses offered by other faculties with the  recommendations of their academic advisors. Such courses aim at providing a wider  spectrum of their studies."
    },
    {
        "heading": "3.7.5. Technical Electives",
        "content": "Students are also required to take a number of advanced technical courses. To fulfill this"
    },
    {
        "heading": "12",
        "content": "requirement, they may choose additional courses in their own area of specialization, select  a second area of specialization, or select advanced courses from some different fields in  consultation with their academic advisor. Each faculty offers a number of advanced  technical electives."
    },
    {
        "heading": "3.7.6. Senior Year Design Project",
        "content": "In the final year, students are required to do a project, which is assigned six credit hours  (CH), 3CH in one semester and 3CH in the next semester. In the first 3CH, a grade of I  (Incomplete) is awarded till the completion of the second part. Both the parts get the same  grade at the completion.   A list of available projects is notified in each faculty at the start of the academic year.  Students may consult their academic advisors/faculty members for the selection of a  project. They are encouraged to undertake projects that are of interest to industry or to  research organizations outside GIK. Students are required to complete their projects and  present their reports (and submit in a bounded form) before the end of the final  examination of their last semester. Projects are evaluated by a committee nominated by  the Dean and approved by the Pro-Rector (Academic)."
    },
    {
        "heading": "3.7.7. Summer Internship",
        "content": "Every student registered for a Bachelor degree program at the Institute is required to  participate in eight weeks practical training program during the summer of junior year and  submit a formal report to the concerned Dean. Though not-for-credit, the Summer  Internship appears on the transcript. Without a satisfactory report, the degree is not  awarded."
    },
    {
        "heading": "3.7.8. Double Degree",
        "content": "Graduates of the Institute desirous of obtaining a degree in a discipline other than the  previously earned degree may spend additional two to four semesters in the Institute to  complete the courses required for the double degree. In such cases, students have to do a  separate project (six credit hours) for the second degree. Details of the courses required  are worked out by Dean's office and communicated to the Examination Section. On the  successful completion of these courses, the student qualifies for a double degree."
    },
    {
        "heading": "3.8.",
        "content": "Registration   All the students who intend to continue their studies at the Institute are required to complete the  registration formalities well in time. The students are required to pay full tuition fees, first of two  instalment if allowed payment in instalments, at the start of the academic year. The fees are paid  for the full academic year against challan form issued by the Finance Department of the Institute.  For the registration of courses, the students have to consult their academic advisor and register  online. The Registration Office registers the student provisionally.   Finance Department clearance is obtained upon verification of payment of tuition fee etc. In case  a student has not paid his/her dues, only a provisional registration is accepted and he/she is  advised to clear all the dues outstanding against his/her name by a stipulated time. If the dues are  not paid in full by the stipulated time, he/she may not be allowed to attend the classes and to sit  in the examinations. It is the responsibility of the students concerned to clear all dues outstanding  against his/her name and submit a report to the Registration Office for the confirmation of the  registration."
    },
    {
        "heading": "14",
        "content": "Normally the week before start of classes or the first week of classes of each semester is  partly devoted to course registration. Students are required to complete the registration  formalities by 5.00 p.m. of the last working day of the first week of the semester (inclusive  of holidays, if any) or deadline communicated by Admissions and Examinations  Department. Registration by mail or proxy is not accepted. The registration office before  the start of the semester may notify any change(s) in registration deadline due to particular  circumstances.   Since the courses offered during the first semester are “core courses”, it is normal for a  student to register first semester courses as prescribed for their degree program in  prospectus. This constitutes the maximum load for the first semester."
    },
    {
        "heading": "3.8.2 Late Registration",
        "content": "In case a student could not submit the course registration form within the registration  period of the semester due to unavoidable and acceptable reasons, Pro-Rector (Academic)  may grant approval of the late registration on the following terms and conditions.    The registration shall not be late for more than two weeks of the normal registration  deadline, inclusive of holidays if any.    The Dean of the Faculty must approve and recommend the registration form and  forward it to the Pro-Rector Office."
    },
    {
        "heading": "15",
        "content": "If granted approval, the student deposits the late registration fee, per working day  exclusive of weekend and holidays, as notified by Admissions and Examination  Department. Registration later than the expiry of late registration deadline is not accepted  under any circumstances."
    },
    {
        "heading": "3.8.3. Course Load",
        "content": "Students can normally register for 15-18 credit hours in a semester. No exception to this  upper limit is allowed to freshmen. However, in later years, this limit may be relaxed with  the approval of the Dean. A student having a cumulative GPA of at least 3.00/4.00 can  request the advisor to allow registration up to 21 credit hours, in case the extra course is  relevant to his degree program or his research project.   In case of a probation♣ where the previous regular semester GPA of a student falls below"
    },
    {
        "heading": "2.00, the student is allowed to register for 10-13 credit hours. Only an exception to this",
        "content": "rule can be made for the senior year students after the approval of the Pro-Rector  (Academics). The students under probation are also allowed to register for one repeating  course above the restricted limit of 10-13 credit hours in which they have previously  obtained an F, D or a D+ grade provided their CGPA is above 2.00.   The maximum load for a Summer School is 8 credit hours. A pre-registration for summer  courses is advised at the end of the spring semester in order to help decide whether a  particular course is to be offered or not.   Students are not allowed to register for two Humanities or Management courses in a  semester. In addition, 6 credit hours of the project cannot be registered in a single"
    },
    {
        "heading": "16",
        "content": "semester."
    },
    {
        "heading": "3.8.4. Add/Drop Courses",
        "content": "Students who wish to add or drop a course (s), must do so before the end of the first three  weeks of the semester by submitting the course add and drop form. For adding a course,  the Academic Advisor checks the schedule of classes and determines if the requested  course is being offered and if it does not require any alteration in the timetable. A dropped  course does not appear in the final transcript."
    },
    {
        "heading": "3.8.5. Withdrawal from Courses",
        "content": "Students can withdraw from a course(s) during the period starting from the fourth week  of the semester till the end of the 10th week inclusive of holidays if any. In such a case, the  student has to submit a course withdrawal form. The advisor determines if the withdrawal  is crucial for the advisee’s academic performance and if the course is not a pre-requisite  for the next semester courses for the advisee. A “W” grade appears on the transcript in  this case. A student who gets a “W” grade does not require repeating this course at a later  stage if this course is not in his degree requirement. A “W” grade does not count in the  GPA calculations. A course in which a student gets an “F” grade has to be repeated in  any case."
    },
    {
        "heading": "3.8.6. Auditing Course(s)",
        "content": "A student can audit a course(s) subject to the following terms and conditions:   __________________________ ♣ Explained in the subsection 3"
    },
    {
        "heading": "17",
        "content": "The course is not needed by him/her to graduate.    The audit status of a course cannot be changed to credit.    Course once audited cannot be repeated as a credit course.   A student who wants to audit a course has to submit a Course Audit Form in the third  week of the semester through his Faculty to the Registration Office. An audited course  does not appear on the transcript."
    },
    {
        "heading": "3.8.7. Class Rosters",
        "content": "The class rosters for all courses are made available to the course instructors through their  account on CMS (Campus Management System) positively by the end of third week of  classes."
    },
    {
        "heading": "3.9.",
        "content": "Examinations   Students are evaluated by mid-semester tests, home assignments, quiz tests, case studies, oral  tests, class presentations & participation, and the end of semester final examination. The weight  allocated to each, except the final semester examination, remains at the discretion of the  instructor. Each instructor announces his/her evaluation policy during the first lecture of the  course. The final examination usually carries 50% weight of a course. The final semester exam  has a duration of three hours. Students failing to meet mandatory 80% attendance requirement  in any course, are not allowed to appear in final examination for the said course. Any formula  sheet or other helping documents, if deemed necessary, would be provided by the instructor at  the time of examination."
    },
    {
        "heading": "3.9.1. Grading System",
        "content": "Students are awarded grades A, A-, B+, B, B-, C+, C, C-, D+, D, F, I, and W for each  course. These grades indicate the following level of performance:"
    },
    {
        "heading": "A",
        "content": "Excellent"
    },
    {
        "heading": "B",
        "content": "Good"
    },
    {
        "heading": "C",
        "content": "Adequate"
    },
    {
        "heading": "D",
        "content": "Minimum acceptable"
    },
    {
        "heading": "F",
        "content": "Failure, the student must repeat the entire course to receive any credit"
    },
    {
        "heading": "W",
        "content": "Withdrawn from the course"
    },
    {
        "heading": "I",
        "content": "Incomplete, the student must complete within a specified time.  The student’s performance over a semester is judged by Grade Points Average (GPA) . Each  grade is assigned Grade Points per Credit Hour according to the following table. Total grade  points of a course are obtained by multiplying the GPC by the number of credit hours assigned  to the course.  Grade  GPC (Grade Points/Credit Hour)"
    },
    {
        "heading": "W",
        "content": "No  Credit,  not  counted  in  the  calculation  of"
    },
    {
        "heading": "I",
        "content": "No  Credit,  not  counted  in  the  calculation  of"
    },
    {
        "heading": "3.9.2. Grade Point Average",
        "content": "The academic standing of a student is referred to in terms of a Grade Point Average  (GPA). To calculate the GPA of a semester, also referred as SGPA, the total number of  grade points earned is divided by the total number of credit hours registered for a  semester. The maximum possible GPA is 4.00. To judge the performance of a student  over the total period of study, Cumulative Grade Point Average (CGPA) is calculated by  dividing the total number of grade points with the total number of credit hours for the  entire number of courses undertaken. In the case of repeating courses, only the most  recent grades are taken into consideration for the calculation of GPA but all courses  undertaken appear on the final transcript"
    },
    {
        "heading": "3.9.3. Academic Standing",
        "content": "At the end of each semester, students are awarded different academic standings based on  the academic performance. Each Faculty selects a number of students, according to  prescribed criteria, to be placed on Dean’s honors list. Following is the list of the standings  awarded to students."
    },
    {
        "heading": "20",
        "content": "a) Highest Distinction: The highest distinction is granted to a student with a normal  course load or above in the semester, whose semester GPA is between 3.90 and 4.00,  inclusive.   b) High Distinction: The high distinction is granted to a student with a normal course  load or above in the semester, whose semester GPA is between 3.75 and 3.89,  inclusive.  c) Distinction: Distinction is granted to a student with a normal course load or above  in the semester, whose semester GPA is between 3.50 and 3.74, inclusive.   d) Good: The academic performance of a student is considered good if his/her semester  GPA is between 3.00 and 3.49, inclusive.   e) Satisfactory: The academic performance of a student is considered satisfactory if  his/her semester GPA is between 2.00 and 2.99, inclusive.   f)  Caution: A cautionary letter is issued to a student whose semester GPA is 2.00 or  more but cumulative GPA is below 2.00.   g) Probation: The minimum semester GPA to remain in good academic standing is"
    },
    {
        "heading": "2.00. Students are placed on academic probation for the next semester if their",
        "content": "semester GPA falls below 2.00 at the end of a semester. A student on probation is  required to register for a lesser number of courses than the normal load during the  probation (between 10 to 13 credit hours).   h) Warning: A student who obtains a SGPA of less than 2.00 for two consecutive"
    },
    {
        "heading": "21",
        "content": "semesters receives a warning letter from the Examination Section. A copy of this  warning letter is also sent to the parents/guardians of the student.   i)  Expulsion: A student, who obtains the SGPA of less than 2.00 in two consecutive  regular semesters, is removed from the roll of the Institute.   j)  Passed: A student is declared passed if he/she successfully completes all the  requirements set for a degree from the Institute and attains a minimum CGPA of"
    },
    {
        "heading": "2.00. The course requirements for each Faculty are described in the Institute",
        "content": "prospectus. The following degree requirements are to be completed by the student:   a. The student has completed the total number of credit hours for a degree  requirement, as required by his/her Faculty.   b. The student has a CGPA of not less than 2.00 at the completion of the course  requirement.   c. The student has fulfilled the degree requirement between a period of 4 to 6 years.  The student is allowed a maximum of 6 years to fulfill his/her degree requirement."
    },
    {
        "heading": "3.9.4. Incomplete (I) Grade",
        "content": "An I grade is awarded to students in a course under the following circumstances:   o If a student does not complete all the requirements of a course within the semester  (some minor component is outstanding), and the concerned Dean and the Instructor  are satisfied that it was because of circumstances beyond the control of the student,  an “I” grade is awarded. In this case, the Instructor concerned communicates an “I”"
    },
    {
        "heading": "22",
        "content": "grade in the award list submitted to the Examination Section, with the approval of the  Pro-Rector (Academic).   o If a student is prescribed bed rest by a certified medical doctor (countersigned by the  MS of the Institute's Medical Center) on the day of the exam, then the Dean of faculty  forwards the case to the Pro-Rector (Academic) for approval along with the medical  certificate duly attested by the Medical Superintendent (MS) of GIK Institute. After  approval from the Pro-Rector (Academic), the case is sent to the Examination Section.  An “I” grade is awarded accordingly.   In both these cases, it is the responsibility of the student to complete the outstanding  requirements within one week of the beginning of the next semester. Failing this an  “I” grade is automatically converted to an F grade.   o Makeup Examinations: Makeup examinations and quizzes can only be undertaken  if you miss these while being sick or on Institute duty. For makeup examinations on  medical grounds, the recommendations of Medical Superintendent of GIK Medical  Center are mandatory. However, if fallen sick while being away from the campus, then  verification of disease by the Medical Superintendent of GIK Medical Center shall be  required."
    },
    {
        "heading": "3.9.5. Re-checking of Papers",
        "content": "If a student is not satisfied with his/her grade in a course, he/she can apply for the  rechecking of the final paper. In such cases, the student has to deposit prescribed paper  rechecking fee and has to fill in Rechecking/Retotaling Form. The receipt of money paid"
    },
    {
        "heading": "23",
        "content": "has to be submitted in Examination Section along with the filled Rechecking/Retotaling  Form on or before the deadline announced for rechecking/retotaling. After approval  from the office of the Pro-Rector, a panel of faculty members is constituted to recheck  the paper and the final decision is communicated to the Examination Section. If there is  a change in the grade, the new grade is communicated to the student, and the amount paid  for rechecking/retotaling is refunded. If there is no change in the grade, the decision is  communicated to the student, however, no refund is made."
    },
    {
        "heading": "3.9.6. Re-totaling of Marks",
        "content": "If a student is not satisfied with his/her grade in a course and he/she wants his/her marks  in the final examination and the semester performance to be re-totaled, the student has to  deposit prescribed retotaling fee per course and fill in Rechecking/Retotaling Form. The  receipt of money paid has to be submitted in original along with filled  Rechecking/Retotaling Form. The Examination Section processes the case and the  concerned Dean communicates the grade (changed or unchanged) to the Examination  Section office for correction of the record, if any. The result is communicated to the  student. In case of an error in the total results in change of grade, the retotaling fee paid  for particular course is refunded."
    },
    {
        "heading": "3.9.7. Repeating Course(s)",
        "content": "Courses in which a student receives an F or a W grade and which are a requirement for  the degree have to be repeated. They may opt for a substitute course only if there is a  provision of an alternative in the curriculum. Students may also repeat courses in which  they receive D+ or D grade provided they do so in the next three semesters after the  result of the course is announced. A student cannot repeat a course in which he/she"
    },
    {
        "heading": "24",
        "content": "previously earned a grade of C- (C minus) or better. If such an incident is discovered at  any time, the student will be dropped from the course or the latest grade earned in the  course will be cancelled.   In case of repeated courses, all grades earned by students appear on the transcripts;  however, only the latest grade is counted in calculating the CGPA, even if it is lower than  the earlier one."
    },
    {
        "heading": "3.9.8. Dropping of Semester",
        "content": "Prior permission of the competent authority must be obtained if a student has to drop the  semester(s) because of any reason. To obtain formal approval, please approach the  Admissions and Examinations Department, who will advise you how to proceed. Please  note that tuition fee is NOT refunded or carried forward and you may be asked to vacate  the room as well."
    },
    {
        "heading": "3.9.9. Conduction of Exams",
        "content": "The evaluation of a course is done through a number of exams. These exams can be in  the form of quizzes, mid-semester exams, or final semester exams. Assignments and  course projects/case studies also form part of the session evaluation of a student during  a course. The instructor can design an evaluation procedure within the course. A broader  guideline in this regard is as follows:    Final Semester Exam:"
    },
    {
        "heading": "50%",
        "content": "Mid Semester Exam:"
    },
    {
        "heading": "30%",
        "content": "Quizzes, assignments, class projects, case studies etc:    20%"
    },
    {
        "heading": "25",
        "content": "Final Semester Exams  The final semester exams are conducted in the 16th week of the semester. These exams  are of 3 hours duration and count for 50% of the total marks assigned to the course.  Open book exams are not allowed at the undergraduate level. If the instructor feels that a  data sheet or a formula sheet is necessary for solving certain problems, this data sheet or  formula sheet should be provided by the instructor. The students are not allowed to bring  their own data sheet or formula sheet to the examination hall. Use of unfair means in  exams may lead to failure of the course or even expulsion from the Institute.  Recommendations about the case will be made by the Disciplinary Committee and the  decision will be endorsed by the Rector. The students are not allowed to bring any helping  material or mobile phones to the examination hall.  The final exams are not retaken or rescheduled. In case of valid medical reasons, the  students should present the medical certificate duly endorsed by the Medical Officer of  the GIK Institute to the relevant Dean who will recommend his case to the Pro-Rector  (Academic). If approved, the student will be given an “I” (Incomplete) grade and will be  allowed to undertake the exam before the first week of the next semester. The result  should be provided to the Examination Section within this week."
    },
    {
        "heading": "3.9.10. Transcripts",
        "content": "Students can obtain their transcripts from the Examination Section at any stage of their  study, upon payment of prescribed fee charged per transcript."
    },
    {
        "heading": "26",
        "content": "The students who apply to foreign universities for higher education are charged single  transcript fee per university if the requirement is for a maximum of 3 transcripts per  university. The Examination Section, if requested, will seal the transcripts in an envelope  and send them to the desired university through registered mail."
    },
    {
        "heading": "4. STANDARDS OF CONDUCT FOR GIKI STUDENTS",
        "content": "Ghulam Ishaq Khan Institute of Engineering Sciences & Technology, as a community dedicated to  the advancement of knowledge, expects all students to behave in a manner consistent with the high  standards of conduct. Acceptance of admission to the Institute carries with it the obligation of  responsibility for the welfare of the community. Freedom to learn can be preserved only through  respect for the rights of others, for the free expression of ideas, and the law.  Under the terms of admission to GIK Institute, students accept its regulations and acknowledge the  right of the Institute to take disciplinary action, including expulsion, for conduct judged  unsatisfactory or disruptive to the educational process. When students violate the standards of  conduct (SC) established by the Institute, they are subject to the Institute’s disciplinary process. The  purpose of this process is to educate and to protect the welfare of the community."
    },
    {
        "heading": "4.1.1 Introduction: The registered students of GIK Institute must conduct themselves in a",
        "content": "manner, which is compatible with the Institute's function as an educational institution.  It is clear that in a community of learning, willful disruption of the educational process,  dishonesty, violation of the laws of the state, and interference with the rights of the  others cannot be tolerated. GIKI retains the right and the authority to maintain order  within the Institute and to exclude those who are disruptive to the educational process.  To that end, the Dean Student Affairs office has established the following rules,  regulations, and policies, which apply to all students and student organizations."
    },
    {
        "heading": "4.1.2. Terms of Enrollment",
        "content": "Ghulam Ishaq Khan Institute aims to create an environment that cultivates individual  virtues and institutional integrity in the Institute community. The mission of the  Institute is supported when students take responsibility for their conduct both in and  out of the classroom. Under the terms of enrollment, students acknowledge the  Institute’s authority to take disciplinary action for conduct on or off Institute property.   Off-campus conduct may be addressed when it is detrimental to the Institute’s mission."
    },
    {
        "heading": "29",
        "content": "i)  Ghulam Ishaq Khan Institute (GIKI)  The term “Institute” means all Ghulam Ishaq Khan Institute campus locations.  ii)  Definition of a Student (GIKI-SC-05) (SC = Standard of Conduct)  A student is any person who is enrolled at Ghulam Ishaq Khan Institute for the current  academic period. A student is also defined as one who has an ongoing relationship with the  Institute between academic periods at the time the misconduct occurred.  iii)  Good Standing (GIKI-SC-10)  The award of a degree is conditioned upon the student's good standing in the Institute and  satisfaction of all Institute graduation requirements. \"Good standing\" means the student has  resolved any unpaid fees or acts of academic or behavioral misconduct and complied with all  sanctions imposed as a result of the misconduct. The Institute shall deny an award of a degree,  transcript or both if the student is dismissed from the Institute based on his or her misconduct.  iv)  Responsibility for Student’s Guests (GIKI-SC-15)  A student or societies are responsible for the conduct of their guests on or in Institute property  and at functions sponsored by the Institute or sponsored by any registered institute or  organization.   v)  Academic Dishonesty (GIKI-SC-20)  Academic dishonesty, such as cheating, plagiarism, fabrication, and fraud, is prohibited. See Part  III for specific definitions of academic dishonesty.   ********************************"
    },
    {
        "heading": "30",
        "content": "vi)  Discrimination (GIKI-SC-25)  Discrimination based on race, national or ethnic origin, creed, age, sex, marital status, or  disability is prohibited.  vii)  Physical Abuse or Threatened Physical Abuse (GIKI-SC-30)  Attempting or causing injury to an individual is prohibited.  Causing or provoking physical  contact with another is prohibited when the person knows or should reasonably believe that  the other person will consider the contact offensive.   viii)  Harassment (GIKI-SC-35)  Conduct by physical, verbal, graphic, written, or electronic means that is sufficiently severe,  pervasive or persistent to threaten an individual or limit the individual's ability to work, study  or participate in the activities of the Institute is prohibited.   ix)  Abuse of Self or Others (GIKI-SC-40)  Prohibited behaviour includes but is not limited to:"
    },
    {
        "heading": "2. Engaging in any intentional or reckless action that may result in mental or bodily harm",
        "content": "(including to one's self)."
    },
    {
        "heading": "31",
        "content": "x)  Malicious Harassment (GIKI-SC-45)  Maliciously and intentionally committing one of the following acts (but is not limited to)  because of a perception of the victim's race, colour, religion, ancestry, national origin, gender,  or mental, physical, or sensory handicap, disability is prohibited:"
    },
    {
        "heading": "3. Threatening a specific person or group of persons and placing that person, or members of",
        "content": "the specific group of persons, in reasonable fear of harm to person or property.   xi)  Reckless Endangerment (GIKI-SC-50)  Engaging in conduct that creates a substantial risk of physical harm to another person or  property is prohibited.   xii)  Alcohol (GIKI-SC-55)  Use, possession, or sale of intoxicating beverages is strictly prohibited within the Institute  campus, sports, cultural or study tours of any official tour conducted by student or student’s  society outside the premises of the Institute.  xiii)  Effect of alcohol or drugs (GIKI-SC-60)  Any conduct that may have been influenced by alcohol or drugs will not limit or excuse the  student's responsibility for his or her activity."
    },
    {
        "heading": "32",
        "content": "xiv)  Drugs (GIKI-SC-65)  The use, sale, possession, and/or distribution of illegal drugs/cigarettes and drug paraphernalia  are prohibited.   • Any individual who is using illegal drugs and is sitting with a group of people, the  entire group present at that place will be considered equally involved.  • If at least two Officials of GIK Institute verify the usage of any kind of drugs i.e smell  of Chars/Weed/Hashish etc. or any other suspicious substance in a place where an  individual or group of people have been present, all the people present at that place  will be considered equally involved and they will be dealt according to the GIK  Institute policy.   xv)  Smoking at Public Places (GIKI-SC-70)  Smoking in classrooms, laboratories, workshop, faculty buildings, library, examination hall,  convocation hall/Agha Hassan Abidi Auditorium, hostels, TV lounges, central mess, and  other public places is strictly prohibited.  xvi)  Firearms and Dangerous Weapons (GIKI-SC-75)  No student is allowed to carry, possess, or use any firearms, explosives, dangerous chemicals,  or dangerous weapons (including, but is not limited to, shotguns, rifles, pistols, air guns, pellet  guns, longbows, hunting bows, throwing weapons, Knuckle punch tool etc.) inside Institute  premises.  xvii) Illegal Entry and Trespassing (GIKI-SC-80)  Prohibited behaviour includes but is not limited to:"
    },
    {
        "heading": "1. Illegal or attempted illegal entry or trespassing of outsiders/students on Institute property is",
        "content": "prohibited."
    },
    {
        "heading": "2. A female student is not allowed to go inside in any of the Boys’ hostel and roam around in",
        "content": "the premises of Boys’ hostel."
    },
    {
        "heading": "4. Students are not allowed to go beyond the faculty/staff residential area.",
        "content": "xviii) Theft or Damage of Property or Services (GIKI-SC-85)  Actual or attempted theft of, or damage to, property or services belonging to the Institute, any  member of its community, or a campus visit is prohibited. Knowing possession of stolen  property is also prohibited.  xix)  Safety Equipment (GIKI-SC-90)  Improper use/damage or disablement of safety or fire safety equipment, such as fire  extinguishers, fire alarms, or exit signs is prohibited.  xx)  Misrepresentation, Fraud, and Falsification of Institute Records (GIKI-SC-95)  Providing false, misrepresented, or fraudulent information to Institute officials or on Institute  records is prohibited. Such information includes but is not limited to:"
    },
    {
        "heading": "2. Falsifying, misrepresenting, forging, altering, or fraudulently obtaining an institute",
        "content": "transcript or degree."
    },
    {
        "heading": "3. Withholding or misrepresenting relevant information on any Institute form or financial aid",
        "content": "form."
    },
    {
        "heading": "4. Presenting any false information in any Institute disciplinary proceeding, academic",
        "content": "exercise or hearing, employment situation, or in any other Institute situation."
    },
    {
        "heading": "5. Maliciously altering or misusing Institute documents, records, permits, or identification.",
        "content": "xxi)  Computer Abuses (GIKI-SC-100)  Conduct that violates the Institute’s electronic use policy is prohibited and includes (but is not  limited to):"
    },
    {
        "heading": "1. Copying Institute-owned or licensed software or data for personal or external use without",
        "content": "prior approval."
    },
    {
        "heading": "2. Modifying or damaging, attempting to modify or damage computer equipment, software,",
        "content": "databases, or communication lines without permission."
    },
    {
        "heading": "3. Disrupting or attempting to disrupt computer operations. Invading the privacy of an",
        "content": "individual by using electronic means to ascertain confidential information, even if an  individual or department inadvertently allows access to such information."
    },
    {
        "heading": "7. Allowing another individual to use one’s computer identity/account or using another",
        "content": "individual’s computer identity/account. This includes, but is not limited to, logging on to  the account, accessing programs, and reading or altering computer records.   xxii) Disruption (GIKI-SC-105)  Students have the right to freedom of speech, including the right to dissent or protest, but  this expression cannot interfere with the rights of others or disrupt the Institute’s activities.  The following conduct will not be permitted:"
    },
    {
        "heading": "2. Conduct which threatens harm, incites violence, or endangers the health and safety of any",
        "content": "person."
    },
    {
        "heading": "4. Damaging, defacing, or abusing Institute facilities, equipment, or property, or the property",
        "content": "of Institute’s community members."
    },
    {
        "heading": "5. Inciting others to engage in prohibited conduct.",
        "content": "xxiii) Disturbing the Peace (GIKI-SC-110)  Creating noise in such a way as to interfere with the Institute’s mission or creating law and  order situation is prohibited.   xxiv) Interference with Institute or Student Programs or Activities (GIKI-SC-115)  Intentionally or recklessly interfering with any Institute or student program or activity,  including teaching, research, administration, meetings, or fire, security, or emergency  services, is prohibited."
    },
    {
        "heading": "36",
        "content": "xxv) Violation of Institute Policies (GIKI-SC-120)  Violation of any Institute policy or rule is prohibited.  xxvi) Failure to Comply with a Proper Order (GIKI-SC-125)  Willful refusal or failure to comply with a proper order or request of the institute official  acting in the performance of their duties is prohibited.  xxvii) Assisting Illegal or Prohibited Conduct (GIKI-SC-130)  Aiding, assisting in, or serving as an accomplice in the commission of any illegal act or any  act prohibited by the Institute’s standards of conduct is prohibited.   xxviii) Violation of a Disciplinary Sanction (GIKI-SC-135)  Violation of any term or condition of any disciplinary sanction constitutes a new violation  and may subject the student to additional sanctions.  xxix) Failure to Cooperate with the Institute Investigation (GIKI-SC-140)  Failure to cooperate with the institute investigation or interfering with an investigation by  withholding evidence or encouraging or threatening another to interfere with an investigation  or to lie is prohibited. Any student who fears for his or her safety may request that testimony  be given by telephone or other means.   xxx) Misuse of Keys (GIKI-SC-145)  Unauthorized possession, including but is not limited to lending, selling, processing,  duplicating, or using Institute-issued key is prohibited."
    },
    {
        "heading": "37",
        "content": "xxxi) Misuse of Identification (GIKI-SC-150)  Unauthorized possession or use of institute or state-issued identification is prohibited which  includes but is not limited to: lending, selling, processing, or duplicating the identification.  xxxii) Identity Theft (GIKI-SC-155)  Knowingly using or transferring another person’s identification for any unlawful purpose is  prohibited.  xxxiii) Unauthorized Student Society/Club and Functions (GIKI-SC-160)  To organize any club/society of students or to organize any function/event within the campus  or outside the campus except those approved by the Institute is prohibited.   xxxiv) Unauthorized Collection of Funds (GIKI-SC-165)  To collect any money or receive donations or monetary assistance or sponsorships for or on  the behalf of the institute except with the written permission of Dean Student Affairs is  prohibited.  xxxv) Protests and Walkouts (GIKI-SC-170)  To stage, incite or participate in, or assist in any walkout, strike or other forms of agitation  against the institute or its teachers or officers or staff is prohibited.  xxxvi) Inflammatory Speeches (GIKI-SC-175)"
    },
    {
        "heading": "38",
        "content": "To make inflammatory speeches or gestures which may cause resentment among the  community of the institute is prohibited.  xxxvii)  Publications and Statements (GIKI-SC-180)  To issue, publish or circulate statements in press, pamphlets or cartoons casting aspersions on  the institute or its community is prohibited.  xxxviii)  Use of Unauthorized Appliances (GIKI-SC-185)  To use any electrical appliance such as heater, refrigerator, air-conditioner, oven, washing  machine and cooking appliances or chemicals likely to cause hazards is prohibited. In special  cases, it may be allowed by Dean Student Affairs.  xxxix) Littering (GIKI-SC-190)  Littering on the campus is prohibited.   xxxx) Immodest Dress (GIKI-SC-195)  Immodest dressing (guided by religion and culture) on the campus is prohibited.  xxxxi) Unlawful Intimidation (GIKI-SC-200)"
    },
    {
        "heading": "39",
        "content": "To influence, intimidate or pursue any employee or student of the Institute for wrongful gains  and favours is prohibited.  xxxxii) Other Conduct (GIKI-SC-205)  Any other conduct that is detrimental to the institute’s mission or threatens the health or safety  of the community is prohibited."
    },
    {
        "heading": "4.2.1 Disciplinary Action",
        "content": "The Institute's disciplinary process is educational, but students can be suspended or dismissed  for serious violations of the standards of conduct. Institute disciplinary action is independent  of any civil or criminal proceeding and is not influenced by the outcome of those proceedings.  The Institute shall address allegations of student misconduct promptly in its sole discretion."
    },
    {
        "heading": "4.2.2 Institute Officer, Disciplinary Committee (GIKI-SC-210)",
        "content": "i)  The Institute officer is a Student Affairs staff member."
    },
    {
        "heading": "40",
        "content": "ii)  The Pro-Rector Academics appoints the Disciplinary Committee members. This  committee is generally composed of Dean Student Affairs, Director (A&E) and each of  the faculty Dean/HoD.  iii) All Institute officers and hearing board members shall be impartial. Impartial means that  the person is not personally involved in the alleged act or does not have a personal  interest in the outcome of the disciplinary proceeding."
    },
    {
        "heading": "4.2.3. Complaint (GIKI-SC-215)",
        "content": "i)  Any person may file a complaint in writing with the Office of Student Affairs against a  student or student society/club etc.  ii)  The complainant must have direct knowledge of the alleged misconduct and be willing  to appear at a hearing if necessary.  iii) The Institute officer determines if the alleged misconduct constitutes a violation of the  standards of conduct.  iv)  If the Institute officer determines that there may be a violation, the student or student  society/club is requested to attend a preliminary meeting with Dean Students Affairs.  v)  The student or student society/club, in general, is notified in writing of the allegation  against them.  vi)  If a student withdraws after a complaint has been filed, the hearing may be conducted  in the student’s absence. If the student is found responsible for a violation of the  standards of conduct, the institute may impose disciplinary sanctions.  vii) Failure to comply with the institute sanction or failure to resolve a conduct complaint  shall affect a student’s good standing in the institute."
    },
    {
        "heading": "4.2.4. Preliminary Meeting (GIKI-SC-220)",
        "content": "The preliminary meeting is an opportunity to evaluate the student’s or student society’s  alleged involvement in the matter. Dean of Student Affairs shall:   i) Inform the student of the nature of the complaint.  ii) Educate the student about the Institute’s disciplinary process.  iii) Notify the student of his or her rights and responsibilities.   iv) Encourage the student to submit a written explanation of the alleged incident."
    },
    {
        "heading": "4.2.5. Notice (GIKI-SC-225)",
        "content": "In general, any student or student society/club charged with violating the standards of conduct  shall be notified in writing/email or via Warden before the hearing. The notice shall include:  i)  The specific charges, including the Institute policy or regulation allegedly violated.  ii)  The approximate time and place of the alleged act.  iii)  The time and place of the hearing.    However, depending on the nature of the case on the suitable cause of action may be followed  in consultation with Rector or Pro-Rector (Academic)."
    },
    {
        "heading": "4.2.6. Service of Notice (GIKI-SC-230)",
        "content": "i)  Notice of a hearing with Dean Student Affairs or the disciplinary committee is sent by  regular mail and/or electronic mail to the student's last known local address. If the  student is no longer enrolled at the time notice is sent, the notice is sent to the student’s  permanent address.   ii)  The student is responsible for keeping an updated address in student personal file."
    },
    {
        "heading": "4.2.7. Disciplinary Committee Hearing (GIKI-SC-235)",
        "content": "i)  If the student or student society/club fails to appear at a hearing after proper notice, the  Disciplinary Committee has the discretion to proceed in the student or student society's  absence to determine responsibility and appropriate sanctions.   ii)  This disciplinary hearing is not a legal proceeding.  iii) The Disciplinary Committee is not bound by the rules of evidence and may admit any  relevant information or source of information but shall exclude immaterial or unduly  repetitious information.  iv)  The institute must prove the allegation by a preponderance of the evidence or witnesses  etc.  v)  Preponderance of the evidence means evidence that would lead a reasonable person to  conclude that it is more likely than not that a violation occurred."
    },
    {
        "heading": "43",
        "content": "vi)  A hearing may be continued to another time if any person disrupts the proceedings.  vii) The written decision is the initial order.  viii) If the student does not appeal to the Disciplinary Committee’s decision within fourteen  calendar days from the date of the decision letter, it becomes the Institute’s final order.  ix)  Disciplinary Committee’s decisions involving individual students are confidential.  However, the Institute may disclose the outcome of a disciplinary decision in  compliance with  a)  Disclosure to other institute officials with a legitimate educational interest.  b)  Disclosure to an alleged victim of any crime of violence.  c)  Disclosure in connection with a health or safety emergency.  d)  Future exemptions that may apply as amended by federal law. Students will be  notified annually of any new exemptions that may apply.  The Dean Student Affairs shall keep a written record of the hearing. This record shall include  all  documents  relevant  to  the  Disciplinary  Committee’s  decision.   Director Admissions and Examinations shall keep the record of the Academic Disciplinary  Decision (Cheating Cases)."
    },
    {
        "heading": "4.2.8 Appeal (GIKI-SC-240)",
        "content": "i)  The appeal is a review of the record and the appeal letter; it is not a new hearing.  ii)  The Disciplinary Committee’s written decision is the institute's initial order.  iii) The Disciplinary Committee’s decision may be appealed to the Rector or Pro-Rector  (A). All the appeals must be submitted to Dean Student Affairs within 14 working days."
    },
    {
        "heading": "44",
        "content": "iv)  If the student does not appeal the Disciplinary Committee’s decision within fourteen  calendar days from the date of the decision letter, it becomes the institute’s final order.  v)  An appeal letter shall be in writing and filed with the Office of Student Affairs (Dean  Student Affairs).  vi)  The appeal letter shall clearly state the basis for appeal. The following shall be the basis  for an appeal:  a) The institute's disciplinary process was not properly followed and that a procedural  error substantially affected the decision.  b) New information not available at the time of the hearing would have substantially  affected the decision.  c) There was not enough evidence to justify the decision.  d) The sanction was too severe or inappropriate for the violation.  vii) The student bears the burden of proof on appeal.  viii) Burden of proof means the student or student organization must prove he/she, or it is not  responsible for the violation of the standards of conduct.  ix) Rector shall review the record in consultation with Pro-Rector (A) and Dean Student  Affairs; and make one of the following determinations within fourteen calendar days  from the date of the appeal letter:  a) Affirm the Disciplinary Committee’s decision.  b) Reverse the Disciplinary Committee’s decision.  c) Affirm, reverse, or modify the sanctions imposed by the Disciplinary Committee."
    },
    {
        "heading": "4.2.9. Sanctions (GIKI-SC-245)",
        "content": "Any of the following sanctions or any combinations of sanctions may be imposed on a student  or student organization for a violation of the standards of conduct but is not limited to:  i)  Warning. A letter notifying the student that the allegation is not a violation under the  standards of conduct, but repeated behaviour may result in a violation.   ii)  Assessment. The student is required to have any psychiatric assessment by a certified  professional and to comply with the professional's recommendations.  iii) Disciplinary probation. Disciplinary probation means formal conditions are imposed  on a student’s continued attendance at the institute for a specific time. Disciplinary  probation serves as a warning that future misconduct may result in more severe  sanctions.  iv)  Restitution. Restitution may include reimbursement for damaged or stolen property and  any medical expenses incurred by a person injured as a result of the student’s or student  society’s/club’s misconduct.  v)  Loss of privileges. Loss of the right to reside in a specific hostel or loss of the right to  participate in extracurricular activities for a specific time.  vi)  Loss of recognition or charter. A student society’s/club’s recognition or charter may  be withheld permanently or for a specific time.   vii) Hold on transcript and/or registration. This is a temporary measure restricting release  of a student’s transcript or access to registration. Upon satisfactory completion of the  conditions of the sanction, the hold shall be released.  viii) Award of lower grades. In cases of academic dishonesty, grade of the student can be  lowered."
    },
    {
        "heading": "46",
        "content": "ix)  Award of F grades. In cases of severe academic dishonesty, the student can be awarded  F grades in any or all the courses enrolled in that semester.   x)  Revocation of degree. A student’s degree may be revoked if it was falsely or  fraudulently obtained, or if the student was dismissed from the institute based on his or  her misconduct.  xi)  Suspension. The student is suspended for a specific time. Upon satisfactory completion  of stated conditions, the institute may grant reinstatement at its discretion.  a) The suspension is effective immediately if the Disciplinary Committee determines  that the student poses a safety risk to himself/herself or the institute community.  b) Students shall be automatically suspended for a minimum of one semester for  violations of the institute's alcohol/drug policy.  xii) Fines. The Disciplinary Committee can levy appropriate fines.  xiii) Community service: A specific number of hours to be worked in GIK Institute within  a specific time.  Written confirmation by the person responsible for supervising the student that he or she  worked satisfactorily for the specific number of hours assigned by the Disciplinary  Committee or Dean Student Affairs.    xiv) Dismissal. The student’s enrollment is immediately terminated. Dismissal means that a  student’s academic relationship with the Institute is permanently ended.  xv) Special sanctions."
    },
    {
        "heading": "47",
        "content": "a) A student shall forfeit any entitlement of financial assistance for a specific time.  b) Any society, association, or club that knowingly permits hazing to be conducted  by its members or by others, subject to its direction or control shall be deprived  of any official recognition or approval granted by Ghulam Ishaq Khan Institute."
    },
    {
        "heading": "4.2.10. Records",
        "content": "Admissions and Examinations Department maintains all the academic records of students, while  Dean Students Affairs Office maintains students living and discipline records."
    },
    {
        "heading": "5.1.",
        "content": "General:  i)  Hostel rooms are allotted according to the policies and merit set by the   Department of Student Affairs. Students may not claim allotment of a specific room of  their choice and convenience.   ii)  The Degree delay students will not be eligible for the single occupancy room.  iii)  All the students must sign a room inventory form after taking over the room and keep  one copy of the same with them for their record. Any damage/discrepancy should be  pointed out in the room inventory form at the time of taking over the room."
    },
    {
        "heading": "48",
        "content": "iv)  All the students should sign the room inventory form once they take possession of the  room. Later if some damage is detected in furniture, the door of the room or any other  item placed/available inside the room, the repair/replacement charges of the damages  shall be borne by the occupant. Any other sort of damage to hostel/items of the hostel  shall be borne by the student who has caused the damage.  v)  The student shall not occupy a room in the hostels without due allotment and taking  over from the administrative staff of the hostel.   vi)  He/she shall not transfer the allotted room to any other person, nor exchange it with  another student without written permission from the office of Student Affairs.   vii)  Students are not allowed to exchange keys of their rooms with other students or any  other unauthorized person. They shall not make the duplicate keys of their room on  their own. Locks compromised in any way due to the negligence of a student shall be  replaced at the cost of the concerned student.  viii)  The residents are advised to keep their valuable articles under lock. They must keep  the keys of their rooms and locks with them all the time. They may not keep heavy  cash in their hostel rooms and other valuable items like mobile phones, laptop etc. in  their absence. Administrative staff shall not be responsible for any theft/ loss/damage  caused by the negligence of the student.  ix)  Concerned student shall be held responsible for any loss/damage caused by the  negligence/carelessness of the student (e.g. leaving his/her room unlocked).   x)  The residents shall not use any electrical appliance e.g. electric heater, refrigerator, air  conditioner, microwave ovens, washing machine and cooking/heating appliances etc.  likely to cause hazard in their rooms. In special cases, it may be allowed by Dean  Student Affairs."
    },
    {
        "heading": "49",
        "content": "xi)  The residents shall be responsible for keeping their rooms clean. They shall not dispose  of litter in the corridors or other parts of the hostel. Wastepaper basket provided in the  hostel room should be used.  xii)  The institute authorities can visit the student’s room at any time if they so desired for  inspection purposes and implementing institute/hostel policies.  xiii)  There is no special dress code; however, students are expected to wear modest dress in  the common areas of the hostels.  xiv)  GIK Institute hostel premises shall not be used as an office, reading room, library or  for any other purpose by a political, religious, or sectarian body/organization of the  students.  xv)  Students shall not keep any firearm or other weapons, even if licensed. Violation of  this rule shall render a resident liable to expulsion from the Institute.  xvi)  A resident shall not indulge in any amusement, which is likely to cause any kind of  disturbance to the other residence of the hostel. Residents must not make any kind of  noise (listening to loud music etc.) inside the hostels that disturb other residents of the  hostels.  xvii) Religious ceremonies are not permitted in the hostels. No political or religious  gathering is allowed at all in the GIK Institute premises.  xviii) The residents are not allowed to gamble or to use any intoxicant, narcotic and any  suspicious substance. Violation of this rule shall render a resident liable to expulsion  from the Institute in addition to any criminal proceeding that may be instituted against  him under the Penal Law of Pakistan.  xix)  The residents shall not tamper with the room fittings, nor shall they get the doors fitted  with internal locks/hatches."
    },
    {
        "heading": "50",
        "content": "xx)  The residents shall not leave lights/fans, AC or TVs in common rooms \"ON\" when the  rooms are not in use or vacant.  xxi)  The female residents can meet their guests only in the visitor room of their hostel  authorized by their parents in writing. The parents of the students can only be  accommodated in the guest house/parents lodge if there would be a need of overnight  stay in the GIK Institute.  xxii) Students shall not entertain guests in their rooms.  xxiii) As per the policy of the institute, every enrolled student must live in the hostel. Male  students shall not go beyond the GIKI Medical Center, to the faculty residential area  or Girls Hostel. Female students shall not go towards faculty/staff residential area,  inside the Boys’ hostel and the premises of the boys’ hostel.   xxiv) The curfew timing of the female students will be observed according to the following  schedule:  Summer:"
    },
    {
        "heading": "2300 hours to 0530 hours (April - October)",
        "content": "Winter:"
    },
    {
        "heading": "2300 hours to 0700 hours (November - March)",
        "content": "xxv) Only Dean Student Affairs may extend curfew timings on special request (special  circumstances) of the students. The curfew extension request will be entertained if  submitted for approval at least 24 hours before the event occur.   xxvi) A female student shall not leave the campus without the written permission of the  Hostel Warden (Girls). The procedure of obtaining a gate pass for female students have  been mentioned separately in the student handbook. Male students shall not leave the  campus after the sunset. All students must make an entry in the register (book"
    },
    {
        "heading": "51",
        "content": "out/in)/via barcode machine entry kept at the main gate. Forgoing out and coming in,  only main gate shall be used. They must not hesitate to disclose their identity and show  their ID cards on-demand to the security staff on duty.   xxvii) Smoking (Cigarette, e cigarette, pod, vap etc.) inside academic buildings/faculties,  hostels, Sports Complex, and common areas of the campus like cafeteria/mess is  strictly prohibited.   xxviii) The hostel premises must be kept clean. Littering and spitting is very much disliked.  Spoiling lawns and writing on the walls or furniture is not allowed.   xxix) Displaying notice on the glasses of the doors is not permitted.  xxx) Student's Cars/motorcycle, while entering/leaving shall be stopped and checked at the  main gate from security point of view. The students shall not hesitate to show his/her  Car/motorcycle Parking Permits on demand. If he/she fails to produce a permit  (obtained for that car/motorcycle) the vehicle will not be allowed to enter GIK  Institute, and he/she shall be strictly advised to collect the permit from the Security &  Protocol Department. Parking permits for vehicles (Car/motorcycle) can be obtained  from the Security Department by depositing a fee.    xxxi) Students are not allowed to roam around the campus in their vehicles (Car/motorcycle).  It is strictly prohibited, and disciplinary action will be taken against the student except  proceeding/returning on/from weekends/holidays.  xxxii) A student desirous to change his/her room would be required to bear the cost of  damaged items before changing the room.  xxxiii) Any student who does not complete the degree program within four years would be  required to vacate the single accommodation."
    },
    {
        "heading": "52",
        "content": "xxxiv) All those students who are residing in a double/triple room with no roommate, he /she  will be adjusted in one room with the other students. A vacant room shall not be allotted  to any student (on their request) who are residing in two different rooms.  xxxv) Room swapping/shifting request application shall be only considered in the first two  weeks of the academic year (after the new room allotment of all the students).  xxxvi) Curfew and Gate pass: The following procedure will be followed for the curfew  extension of the female students and gate pass of the female students. The approval of  the request may be accepted or rejected based on the circumstances involved.   (a) Society/teams must apply for the Curfew extension request (application) at least 24  hours before the event. Clearly mentioning the names, reg no, hostel, room no of  the female students. Application must be recommended by the Society/Team  adviser.  (b) For FYP, a student must recommend an application from the FYP Adviser and the  concerned faculty dean.   (c) On Society/Team tour event a gate pass application of the female students must  be submitted with the concerned girls hostel warden at least 48 hours before the  tour event. Clearly mentioning the names, reg no, hostel, room no of the female  students. Application must be recommended by the Society/Team adviser.  (i) With reference to point (c) the female students must have a permission from  the parents (Parents must intimate the Girls Hostel warden) for the tour."
    },
    {
        "heading": "5.2.",
        "content": "Shared Premises (Common Room TV Lounge, Corridor, Dining Hall and  Central Mess):  i)  Smoking is strictly prohibited in shared areas of the hostels like common rooms,  corridors, dining halls and the central mess.  ii)  The common room shall be closed and locked at midnight by the hostel staff on  duty, and timings may be changed in special circumstances after the approval  of the Dean Student Affairs.  iii)  The parking areas in front of the hostels are for the general use of all the hostel  residents. No specific area shall be allotted to any individual.  iv)  All students can avail the facility of ironing clothes from the laundry shop.  v)  Common rooms have been provided with TV. TV must be switched OFF when  not being watched. Student shall not fiddle with it unnecessarily.  vi)  Students shall co-operate with hostel staff to keep the common rooms clean and  tidy. Shifting of sofa sets and removing of newspapers etc. are not permitted.  vii)  Hostels are provided with telephone extensions (Exchange 0938/ 271858-61).  These telephones are placed in the reception, which can be used for receiving  calls only."
    },
    {
        "heading": "1) Each year a students’ Mess Committee (Student representatives and Wardens etc.) shall be",
        "content": "constituted by the Student Affairs Department. The committee shall chalk out meals’ menu,  fix meal timings and suggest any improvements required in preparation/service of food."
    },
    {
        "heading": "2) No student, except members of mess committee (Student representatives, Wardens etc.), are",
        "content": "permitted to go inside the kitchen to check the quality or any other issue, and report to the  concerned authority."
    },
    {
        "heading": "3) Students shall not be served meals in living rooms. Mess staff shall not be compelled or asked",
        "content": "to serve in rooms unless advised by the GIK Medical Center doctor. Meals and other eatables,  tea etc. shall be served in the dining hall of Central Mess only. Male guests may also be  entertained in the dining halls of Central Mess only."
    },
    {
        "heading": "5) Students must inform the mess staff regarding new room numbers after room swapping to",
        "content": "avoid any mess bill issue."
    },
    {
        "heading": "7) It is the student's responsibility to update the check out and check in while proceeding on",
        "content": "leave/weekend etc. Failing which he/she shall be charged for the meals cooked for him/her.  Students must not make a false entry in the record book."
    },
    {
        "heading": "8) A student shall not indulge in discussion with mess staff. It is expected that the students",
        "content": "behave in a dignified manner and be courteous to mess staff. Complaints if any may be"
    },
    {
        "heading": "55",
        "content": "referred to Mess Supervisor or Officer In-charge Mess. No tips shall be offered/paid to the  mess/hostel staff."
    },
    {
        "heading": "9) There is no provision of partial dining system or preparation of food other than that being",
        "content": "served according to menu except on doctor's advice."
    },
    {
        "heading": "10) For non-Muslim students during the month of Ramadan meals or eatables shall be served at",
        "content": "the timings prescribed. All students are expected to observe the sanctity of Ramadan."
    },
    {
        "heading": "11) Students are not permitted to take any crockery or cutlery to their rooms or common rooms",
        "content": "from the central mess. Breakage/loss shall be recovered from students through monthly  catering/mess bill."
    },
    {
        "heading": "12) Mess bills for the preceding months are issued by 8th of each month. Students are required to",
        "content": "pay the mess bill at Habib Bank Ltd, GIK Institute Branch within thirty days (30) days,  otherwise, 02% surcharge per month is levied on current mess bill. If a student fails to pay  the mess bill for two consecutive months, he/she shall not be permitted to avail the mess  facility unless all outstanding bills are cleared. Graduation formalities of students are subject  to clearance from all concerned departments."
    },
    {
        "heading": "13) Rs. 8,000, paid as mess security by undergraduate students at the time of admission, shall be",
        "content": "refunded when students leave the institute or adjusted against his/her mess bill (if any)."
    },
    {
        "heading": "14) Students are not allowed to change hostels/rooms without the prior approval of the Dean",
        "content": "Student Affairs."
    },
    {
        "heading": "1. Student Societies (GIKI-SS-005)",
        "content": "Academic study should be one’s primary responsibility in GIK Institute, but the Institute also considers that  there is still much to be learned by taking advantage of the many opportunities outside the classroom. By  getting involved in the activities such as student societies, internships, welfare projects, faculty research and  recreational sports, students develop valuable skills which not only facilitate their campus life but also they  get the knowledge and confidence for the life after college.  Students must be involved in these kinds of activities, because it brings the affiliation among them and the  Institute, and they consider themselves a valuable part of the GIKI community. They build strong  relationships with their peers, faculty, administration and other stakeholders.  If students get involved in the activities outside the classroom then they attain the following benefits in their  life."
    },
    {
        "heading": "1. Students are affiliated with their peers from different cultures and different backgrounds in the student",
        "content": "societies. They learn how to appreciate the diversity and when they go to organizations they  encourage the diversity."
    },
    {
        "heading": "3. Students get to know about themselves, and they realize their skills. They get exposure to different",
        "content": "fields inside the societies like Registrations, creativity, promotions, human resources, marketing,  relationship building and finance."
    },
    {
        "heading": "4. They build strong relationships with the institutes and the organizations, so when they join the",
        "content": "organizations they already have strong networks."
    },
    {
        "heading": "2. Guidelines for Society Members",
        "content": "There are few guidelines while joining the student societies:  • You must involve yourself in the opportunities that interest you. You will find many student societies  in GIK, you can participate in more than one but you must be active for one society which appeals  you more so that you could get some recognition in the society.  • There must be a balance in your academics and co-curricular activities. Because research shows that  more involvement brings more benefits but its excess put in danger. In GIK academics are more  important so keep in mind to have a balance in all activities otherwise it will affect your academics  and wellness.  • Fresh students must not burden themselves with different activities, but also they must balance their  co-curricular activities with their academics, and they should add later on the other activities. It brings  the recognition in the society and also not harms your studies."
    },
    {
        "heading": "3. Student Societies in GIK Institute",
        "content": "GIK Institute recognizes a wide variety of student societies to facilitate the diverse interests of the student  body. Office of Student Affairs is the governing body for all societies that are administered by student  representatives. Societies are granted certain privileges to promote student participation in a variety of  physical, intellectual and recreational activities."
    },
    {
        "heading": "3.1. Membership in Societies: All GIKI students are eligible to participate in student societies regardless",
        "content": "their race, religion, sex, colour, age, marital status or ethnic origin, but there are certain requirements  which must be fulfilled by every student before becoming the member of every society.  • Full membership in student societies will be restricted to enrolled undergraduate and graduate  students at Ghulam Ishaq Khan Institute."
    },
    {
        "heading": "58",
        "content": "• Faculty and others may participate as honorary or associate members (at the option of the group) as  specified in the group’s constitution.  • Only full members may be eligible to vote on matters of business or hold elective office in the society.  • Students must have the CGPA more than 2.00, to become the member of every society."
    },
    {
        "heading": "3.2. Obtaining Recognition for Societies: Students must need to contact to Office of Student Affairs",
        "content": "for the registration of new student societies. To obtain recognition, the following requirements must  be fulfilled by student societies:  • All student societies must have at least 3 office bearers (President, General Secretary, and treasurer).  • Office bearers will be selected for 1 academic year.  • Recognized societies must have a society advisor.  • Societies can be permitted whose objective, scope and reach is different from any existing society.  • There must be at least 20 interested students, for the establishment of a new society.  • Advisors' acceptance must be submitted to the Office of Student Affairs.  • Societies need to submit charter before registration of the society, which must be having:  a) Name of the Society  b) Purpose and objective of establishment  c) Financial sources (e.g. Registration fee, donations, sponsorships or any other financial sources)  d) Duties of Office Bearers.  e) Selection criteria for Office Bearers and other members.  f) National or international affiliations with other organizations and chapters (If any).  g) Adoption and amendment process.  h) Description of Society’s Safety Program.  i) Responsibilities of the advisor."
    },
    {
        "heading": "59",
        "content": "• Societies can work within their domains, provided in the charter.  • No, Office Bearer can hold two key positions in any society."
    },
    {
        "heading": "3.3. Society Responsibilities: There are the following responsibilities, which must be fulfilled by",
        "content": "registered societies:  • All student societies are required to submit Year Activity Plan (Approved by President and Advisor),  along with the budget details to the Office of Student Affairs, in the first three weeks of every  academic year.  • Societies are required to submit contact details of Office Bearers to Office of Student Affairs, which  must be comprised of Names, Registration No., Email IDs, and Mobile No. of Office Bearers and  Society Advisor.  • All Office Bearers are required to check their emails periodically, for any updates.  • Office Bearers are required to submit a detailed report, before handing over the society to new Office  Bearers. The report must be comprised of activities, accomplishments, and financial status of the  current academic year.  • All funds (Registrations, Sponsorships, Donations, or any other) must be deposited in the official  account of the GIK Institute c/o the concerned society or club.   • Events where external participants are involved, no cash collections will be entertained by any  society. All funds (Registration fee, sponsorships etc.) will be in the shape of pay orders, demand  drafts, and crossed checks and will be submitted in the official account of the GIK Institute c/o the  concerned society or club."
    },
    {
        "heading": "60",
        "content": "Note: Student Societies, which are unable to submit their Year Activity Plan and Year-End Report will not  be considered as registered societies. They'll not be allowed to process any event, as well as they will not be  allocated budget for the current academic year."
    },
    {
        "heading": "4. Student Societies’ Event Process",
        "content": "Student Societies are required to comply with the following requirements of the Institute, for arranging  society events in GIK Institute:"
    },
    {
        "heading": "1.",
        "content": "Societies are only allowed to arrange events, which cover their mission statement as per approved  Society Charter."
    },
    {
        "heading": "2.",
        "content": "Event dates will be allocated in the Dean SA Office meeting with all the coordinators/presidents  or the society advisers at the beginning of the fall semester."
    },
    {
        "heading": "3.",
        "content": "Event approval form along with required documents must be submitted to the Office of Student  Affairs 20 days before the event."
    },
    {
        "heading": "4.",
        "content": "The event schedule/activities will not clash with the classes and curfew time and also not affect  the normal activities of faculty/staff/students."
    },
    {
        "heading": "5.",
        "content": "Two weeks before the examinations, no event will be scheduled by any society/club/team."
    },
    {
        "heading": "6.",
        "content": "Event registration fee must be finalized with the advisor before communicating it to the  participants."
    },
    {
        "heading": "7.",
        "content": "Social events (Concerts, dramas, musical nights etc.) will not be allowed in Muharram-ul-Haram  and on other specific dates."
    },
    {
        "heading": "8.",
        "content": "Following details must be attached with the event approval form:  a. Society event undertaking by the society Coordinator/President.  b. Detailed proposal of event activities. Especially musical nights, dramatics, concerts etc. will  be discussed with Dean SA Office before the event."
    },
    {
        "heading": "61",
        "content": "c. Forecasted profit/loss statement of the event.  d. List of facilities on proper forms, required from Institute, i.e. transport, guest house, faculty  club, venues, equipment etc. duly approved from concerned Dean/Departmental Head/Society  Advisor.   e. List of society members, with their latest CGPA."
    },
    {
        "heading": "9.",
        "content": "No outsiders, other than participants will be allowed to enter the campus during events."
    },
    {
        "heading": "10.",
        "content": "Hostel rooms will be made available to participants, voluntarily, and society will be responsible  for the coordination and to accommodate them."
    },
    {
        "heading": "11.",
        "content": "NOCs of the participants will be arranged from respective institutes."
    },
    {
        "heading": "12.",
        "content": "Society will be required to provide the participants’ list two days in advance to Student Affairs  Office and security office, and society members must be present at the main gate, to identify the  participants with the help of security personnel."
    },
    {
        "heading": "13.",
        "content": "The participants must be informed about the Institute's discipline and other rules. Participants  must not be allowed to visit the restricted areas like faculty/staff residence, faculty club, and  participants must be aware of how to maintain discipline in other areas like cafeteria, and market  area. Society will be responsible for any mishaps occurred during the event."
    },
    {
        "heading": "14.",
        "content": "If hiking, or any other activity which is going to be planned outside the campus, then society will  be responsible to collect disclaimers from participants, and must report it to the Student Affairs  Department."
    },
    {
        "heading": "15.",
        "content": "All kind of financial transactions will be processed through the Finance Department of GIK  Institute."
    },
    {
        "heading": "16.",
        "content": "A comprehensive report of the event must be submitted to the Student Affairs Department within"
    },
    {
        "heading": "17.",
        "content": "All necessary reimbursements will be processed after the submission of the event report to the  Student Affairs Department."
    },
    {
        "heading": "18.",
        "content": "Societies are not allowed to arrange such events that discuss objectionable or controversial topics,  or invite any personality of that nature - which may seek to portray any partiality of views on  GIKI’s account or indicate an official/unofficial viewpoint of the Institute, intended or otherwise."
    },
    {
        "heading": "19.",
        "content": "Society members will be responsible for the events, especially those related to sports and outdoor  activities have inherent risks.  Possible injuries might occur which include, but are not limited to  muscle strains and sprains, broken bones, lacerations, cardiac malfunction, head, neck, and back  injury, paralysis and death."
    },
    {
        "heading": "20.",
        "content": "Participants are fully responsible for any medical expenses that may be incurred as a result of  participation in society all Pakistan/Intra etc. events."
    },
    {
        "heading": "21.",
        "content": "Consumption of alcohol is prohibited on campus."
    },
    {
        "heading": "22.",
        "content": "Non-prescribed drugs, performance-enhancing drugs, or any other substances that might be  hazardous to the participant's health or performance as a member of the Society are also  prohibited."
    },
    {
        "heading": "23.",
        "content": "In case of collaborated events, related societies must be required to submit an agreement to the  Student Affairs Department, which must be mutually signed by the presidents and advisors of the  societies.  Note: The Office of Student Affairs reserves the right to cancel the event, or part of it, whenever it deems  inapt for the Institute or community. SOP's are not limited to the above-mentioned points. Any addition"
    },
    {
        "heading": "63",
        "content": "or amendment will be notified to the societies and the society advisers from time to time. Details are  available in the Student Affairs Department."
    },
    {
        "heading": "5. Branding Policy for Societies",
        "content": "Societies must follow the following branding policies:  • Societies are required to get approval of all branding (Banners, posters, flyers, flexes) material from  the Student Affairs Department, before the event.  • For print material, societies are required to get their promotional material to approve, before printing.  • The number of copies of prints (posters, flyers etc.) that are posted on notice boards will be limited.  • Societies will not be allowed to paste any kind of promotional material on faculties’ walls.  • Prior permission must be obtained from the Student Affairs Department, for hanging large banners  on buildings and societies will be responsible for the safety of members who hang banners on  buildings.   • If sponsor companies need to put some stalls on campus, then the whole agreement must be approved  from the Student Affairs Department.  • Student societies will be responsible to remove the promotional material from campus within 2 days  after the event.  Note: All societies are required to submit a copy of all distributed material to external participants, during  events."
    },
    {
        "heading": "6. Society/Club Finance Policies",
        "content": "There are following policies for society/club financing in GIK Institute:  • Registered Student Societies will be allocated budget from GIK Institute every year, after the  submission of Year Activity Plan and budget requirement to the Student Affairs Department.  • Allocated budget must be utilized in the current academic year; otherwise, it will be rolled back to  the GIK Institute account at the end of Academic Year.  • All sponsorship funds, generated by student societies will be added in the budget, allocated by the  GIK Institute.  • All reimbursements must be submitted to the Student Affairs Department within two weeks after the  event.  • All advance, reimbursement and adjustment requests must be signed by the Advisor of the society,  before submitting it to the Student Affairs Department.  • Advance cash requests must be forwarded to the Student Affairs Department at least 5 working days  in advance.  • All funds, generated through registration fee, sponsorships etc. must be submitted into GIK Institute  account c/o the concerned society’s account, by society members."
    },
    {
        "heading": "7. Delegate Code of Conduct",
        "content": "There is a following code of conduct for GIKI members, when to participate in other institutes, outside GIKI:  • Student Societies may be allowed only for competitive and creative competitions, after the approval  of the society advisor.  • A head delegate must be appointed from the whole group to oversee the activities occurred prior,  during and after the event."
    },
    {
        "heading": "65",
        "content": "• Head Delegate must have the ultimate power of decision making, and it is mandatory for all delegates,  to follow his instructions.  • Head Delegate will be responsible for the preparation, performance, and conduct during the event.  • Head Delegate will be responsible to manage the logistical issues of the entire delegation, and may  have the authority to assign different tasks to different team members for smooth working.  • All members must remain together during the events, and act as ambassadors of GIK Institute.  • During all social events (related to the conference or otherwise), delegates will not be allowed to  indulge in any unethical practices such as taking drugs or drinking. Anyone failing to abide by this  rule will have to face the GIKI Disciplinary Committee on return to GIK Campus.  • No delegate will be allowed to leave the group without the special permission of the Head Delegate.  • If Media is involved in the event, then only the appointed person will be allowed to interact with  them.  • During social events (Concerts, musical nights, dramas etc) follow the instructions of the organizers  and must be aware of the emergency exits before the event.   Note: Students may not be allowed for outside competitions during examinations."
    },
    {
        "heading": "8. Instructions for A.H.A Auditorium",
        "content": "Student Societies must follow the following rules, while arranging social events in GIKI A.H.A. Auditorium:  • Prior approval must be required from the Facilitation Department, before using the facility.  • No brochures will be pasted on A.H.A Auditorium’s walls.  • Societies need to instruct the external vendors while installing the sound and other facilities inside  the auditorium that they must have to take care of all the facilities, otherwise concerned society will  be penalized for any occurred damages."
    },
    {
        "heading": "66",
        "content": "• Portable electric devices may be set up professionally, accounting for all possible hazards or electric  shock and they must not smother the atmosphere inside the auditorium.  • All entry and exit doors will be opened for the audience and no facility will be set up in front of the  doors.   • Society members will ensure the queue of the audience while getting entered into the auditorium, and  they must be properly seated on their seats.  • No liquor will be allowed inside the auditorium.  • No pathway will be blocked by the audience and the audience will not be allowed to sit on auditorium  stairs.  • Nobody will be allowed to stand up on seats.  • Society members must need to communicate with the artists before the event that they should not call  the audience to stand up during the performance because it is against the Institute's policy.  • Any play or drama-related event must carry a write up on the theme and script must be submitted to  organizer society. Care should be taken to avoid references to abuse or use of loose or foul language  and account for religious/ethnic sensitivities.  • Student societies are obligated to clean up the auditorium after the event.  • Failure to clean-up the facility may lead to disciplinary action against the society members and society  may be banned for holding the event next time.  • Wall chalking inside the auditorium is strictly prohibited.  • Amplifications of music must be maintained at a reasonable level, which must not disturb any other  activity or the GIKI community.  • All society events must be concluded before 11:00 pm."
    },
    {
        "heading": "GUIDELINES FOR SOCIETIES IN THE GIK INSTITUTE",
        "content": "a)  Prior approval of the event and financial transaction/ procurement of the major items be  obtained from the Pro-Rector (Admin and Finance)/ Rector through DSA and advisors of the  societies.  b)  The purchase must be preferably through procurement/finance department on  competitive rates, supported by 3 quotations of the different suppliers/vendors.  c)  The cases shall be processed in advance at least 15 days before commencement of the event  so that procurement & Finance Department get sufficient time for processing of the case."
    },
    {
        "heading": "7.1 Societies/Clubs Functional in the Institute.",
        "content": "Serial  No.  Society Name"
    },
    {
        "heading": "GMS",
        "content": "GIKI Mathematics Society"
    },
    {
        "heading": "WES",
        "content": "Women Engineers Society"
    },
    {
        "heading": "SPIE",
        "content": "International Society for Photo-optical Instrumentation Engineers"
    },
    {
        "heading": "4",
        "content": "Science  Society  Science Society"
    },
    {
        "heading": "IET",
        "content": "Institute of Engineering And Technology"
    },
    {
        "heading": "6",
        "content": "GIKI Sports S.  GIKI Sports Society"
    },
    {
        "heading": "GSS",
        "content": "Graduate Students Society"
    },
    {
        "heading": "IEEE",
        "content": "Institute of Electrical and Electronic Engineers"
    },
    {
        "heading": "9",
        "content": "Media Club  Media Club"
    },
    {
        "heading": "AIAA",
        "content": "American Institute of Aeronautics and Astronautics"
    },
    {
        "heading": "ASME",
        "content": "American Society Of Mechanical Engineers"
    },
    {
        "heading": "12",
        "content": "Project Topi  Project Topi"
    },
    {
        "heading": "ASHRAE",
        "content": "American Society of Heating, Refrigerating and Air Conditioning Engineers"
    },
    {
        "heading": "SMEP",
        "content": "Society of Mechanical Engineers of Pakistan"
    },
    {
        "heading": "ACM",
        "content": "Association for Computing Machinery"
    },
    {
        "heading": "CDES",
        "content": "Cultural Dramatics & Entertainment Society"
    },
    {
        "heading": "18",
        "content": "Netronix  Netronix"
    },
    {
        "heading": "19",
        "content": "Web team  Web Team"
    },
    {
        "heading": "LDS",
        "content": "Literary And Debating Society"
    },
    {
        "heading": "ASM/TMS",
        "content": "The Mineral, Metal & Material Society/American Society of Materials"
    },
    {
        "heading": "SOPHEP",
        "content": "Society for the Promotion of Higher Education in Pakistan"
    },
    {
        "heading": "AIESEC",
        "content": "Association International des Etudiants en Sciences Economiques et  Commercial"
    },
    {
        "heading": "24",
        "content": "AIChE  American Institute of Chemical Engineers"
    },
    {
        "heading": "CBS",
        "content": "Character Building Society"
    },
    {
        "heading": "26",
        "content": "IMechE  Institution of Mechanical Engineers"
    },
    {
        "heading": "LES",
        "content": "Leadership and Entrepreneurial Society"
    },
    {
        "heading": "ICE",
        "content": "Institutions of Civil Engineers"
    },
    {
        "heading": "7.3. Advisors to Recognized Student Societies (GIKI-SS-010).",
        "content": "i)  Society Advisors are members of the faculty whom the student members choose and  whose interest in the group indicates that they would judiciously advise the society  concerning its goals, purposes and procedures. Society Advisors guide the group  following the purposes and ideas of the institute and the society. They do not directly  control the Society/group's programs and activities.  ii)  Society Advisors assist the Dean Student Affairs Office to implement the policies for  the student societies.  Society Advisors’ Responsibilities:  Responsibilities may include the following:  i)  Review and approve an organization’s annual goals.  ii)  Sign off on operating and programming funding requests.  iii)  Attend and monitor all the events and activities of a society.   iv)  Review university policies with the executive officers and the entire general  membership as needed.  v)  Take a role in formulating the organization’s goals.  vi)  Help the society leaders to prepare an annual budget.  vii)  Review the society’s finances with the treasurer once a month."
    },
    {
        "heading": "70",
        "content": "viii)  Take an active role in the transition of responsibilities between old and new officers.  Whenever that transition is scheduled to take place.  ix)  Veto a decision when it violates a stated objective, the society’s constitution, bylaws  or standing rules, or university policy.  x)  Objectively mediate interpersonal conflicts that arise between members.  xi)  Attending the society's meetings.  xii)  Selection of Office Bearers of the societies.  xiii)  To help the students in preparation of societies’ constitution and any other amendments  time by time.  xiv)  To provide awareness about the societies' process to every upcoming student council  and instruct them for the fulfilment of all rules and regulations regarding the student  societies.  xv)  Assisting in planning the student societies’ activities and help them out to handle the  administrative matters.  xvi)  Supervision of student societies’ funds, provided by GIK Institute as well as generated  through any other source and the approval for all societies’ expenditures.  xvii) Assisting the office bearers in arranging institute facilities and equipment for student  societies’ activities.   xviii) In case a society adviser is off-campus. He/She must nominate a substitute (any other  faculty member) to look into the matters of the society."
    },
    {
        "heading": "7.4.",
        "content": "Scheduling of Events (GIKI-SS-015)"
    },
    {
        "heading": "7.4.1. Facilities. Recognized student groups schedule facilities by contacting the appropriate",
        "content": "campus departments. The Dean Student Affairs office will approve the event and will  provide liaison required for such facilities."
    },
    {
        "heading": "7.5.",
        "content": "Financial Projects (GIKI-SS-020)"
    },
    {
        "heading": "7.5.1. Definition. A financial project is any approved activity of a student society, which is",
        "content": "undertaken to raise funds and/or to defray the expense. Projects may be for the benefit  of societies themselves or charity groups."
    },
    {
        "heading": "7.5.2. Approval. The Dean of Student Affairs has been given the responsibility of approving",
        "content": "all financial projects so that the following services can be provided:   i)  Planning advice.  ii)  Advertising and publicity assistance.  iii)  Facility and equipment arrangements."
    },
    {
        "heading": "7.6. Sponsored Projects must be administered under institute policy governing such funds.",
        "content": "Sponsoring societies may reserve the right to select recipients and to establish the amount of  grants under policies of the Dean Student Affairs office."
    },
    {
        "heading": "8. Ghulam Ishaq Khan Institute of Engineering Science and Technology Social Responsibility Policies",
        "content": "GIK Institute believe that the long-term future of the University is best served by respecting the interests of  all our stakeholders: students, staff, parents, GIK community and the local community. We look actively for  opportunities to improve the environment and to contribute to the wellbeing of the communities in which we  operate.  This policy is with the aim to display social and environmental awareness alongside expansion, which is in  line with our principles and programmes.   Principles   Honesty and Accountability   We aim to develop and implement social and environmental policies which fit in with the GIK Institute’s  everyday activities and responsibilities and displaying a consistently transparent operation throughout. We  will communicate our environmental policies, objectives and performance openly and honestly to our  students and staff and to GIK community with an interest in our activities. We will encourage them to  communicate with us and will seek their views. Furthermore, we will also commit and show compliance to  honest advertising and our educational responsibilities as an institution."
    },
    {
        "heading": "73",
        "content": "Sustainable Progress   We are committed to improving our performance. We will take into account technical developments,  changing scientific evidence, costs and customer concerns and expectations in the development and  implementation of all new social and environmental policies and procedures. We will monitor our  performance, set objectives for improvements and report our progress.   Programmes  Sustainable Development   We will take all reasonable steps to manage our operations so as to minimise our environmental impact and  to promote good environmental practice. We will demonstrate this by:   - Reviewing our Environmental Policies every year.   - Improving our standing in the Clean and Green Pakistan Campaign, Clean GIK Campaign.   - Continuing to reduce our waste Plastic waste, food waste, water waste etc.   - Conducting “Plantation Drive” to engage our staff, students and local community.   - Carrying out the annual Sustainability Week.   - Supporting our GIK Societies/teams to promote and encourage energy saving actions.   - Actively encouraging and promoting sustainable transport options for staff."
    },
    {
        "heading": "74",
        "content": "- Actively engaging GIK Social societies that are Project Topi and Character building society to  promote/conduct sustainable environmental related activities.   Communities   We will build relationships with our members, GIK community and the local communities. We will obtain a  wide range of views on our social and environmental policies and performance. We will encourage our staff  and GIK community to actively and positively contribute to the local community."
    },
    {
        "heading": "75",
        "content": "While every effort has been made to ensure the accuracy of the information in this   Students Handbook 2021-22, the Institute or Office of Student Affairs can accept no  responsibility for any errors or omissions.   The Institute reserves the right to amend, add, delete, or discontinue the rules, regulations or  other such information provided in this Handbook whenever it deems fit. The students are  responsible to keep themselves up to date about changes in this book."
    }
]